[Killed] ConditionalExpression
src/lib/actions/tasks.ts:37:7
   const user = await getCurrentUser();
 
   // Only search within user's own tasks for privacy
-  if (!user?.id) {
+  if (false) {
     return [];
   }
killedBy: Task Actions - Archive/Recurring Functions findSimilarTasks should return empty array when user is not authenticated
statusReason: Cannot read properties of null (reading 'id')

[Killed] BlockStatement
src/lib/actions/tasks.ts:37:18
   const user = await getCurrentUser();
 
   // Only search within user's own tasks for privacy
-  if (!user?.id) {
-    return [];
-  }
+  if (!user?.id) {}
 
   const tasks = db
killedBy: Task Actions - Archive/Recurring Functions findSimilarTasks should return empty array when user is not authenticated
statusReason: Cannot read properties of null (reading 'id')

[Survived] MethodExpression
src/lib/actions/tasks.ts:45:27
     .prepare('SELECT id, name, date FROM tasks WHERE user_id = ?')
     .all(user.id) as Array<{ id: number; name: string; date: string | null }>;
 
-  const normalizedInput = name.toLowerCase().trim();
+  const normalizedInput = name.toLowerCase();
 
   return tasks

[Survived] MethodExpression
src/lib/actions/tasks.ts:45:27
     .prepare('SELECT id, name, date FROM tasks WHERE user_id = ?')
     .all(user.id) as Array<{ id: number; name: string; date: string | null }>;
 
-  const normalizedInput = name.toLowerCase().trim();
+  const normalizedInput = name.toUpperCase().trim();
 
   return tasks

[Killed] MethodExpression
src/lib/actions/tasks.ts:47:10
 
   const normalizedInput = name.toLowerCase().trim();
 
-  return tasks
-    .filter(t => t.id !== excludeTaskId)
-    .map(t => {
-      const normalizedExisting = t.name.toLowerCase().trim();
-      // Simple similarity: check if one contains the other or they share significant words
-      const words = normalizedInput.split(/\s+/);
-      const existingWords = normalizedExisting.split(/\s+/);
-
-      const commonWords = words.filter(w => existingWords.includes(w));
-      const similarity =
-        words.length > 0 ? commonWords.length / words.length : 0;
-
-      // Also check for substring matches
-      const containsMatch =
-        normalizedExisting.includes(normalizedInput) ||
-        normalizedInput.includes(normalizedExisting)
-          ? 0.8
-          : 0;
-
-      return { ...t, similarity: Math.max(similarity, containsMatch) };
-    })
-    .filter(t => t.similarity > 0.5)
-    .sort((a, b) => b.similarity - a.similarity)
-    .slice(0, 5);
+  return tasks.filter(t => t.id !== excludeTaskId).map(t => {
+  const normalizedExisting = t.name.toLowerCase().trim();
+  // Simple similarity: check if one contains the other or they share significant words
+  const words = normalizedInput.split(/\s+/);
+  const existingWords = normalizedExisting.split(/\s+/);
+  const commonWords = words.filter(w => existingWords.includes(w));
+  const similarity = words.length > 0 ? commonWords.length / words.length : 0;
+
+  // Also check for substring matches
+  const containsMatch = normalizedExisting.includes(normalizedInput) || normalizedInput.includes(normalizedExisting) ? 0.8 : 0;
+  return {
+    ...t,
+    similarity: Math.max(similarity, containsMatch)
+  };
+}).filter(t => t.similarity > 0.5).sort((a, b) => b.similarity - a.similarity);
 }
 
killedBy: Task Actions - Archive/Recurring Functions findSimilarTasks should limit results to 5
statusReason: expected 10 to be less than or equal to 5

[Killed] MethodExpression
src/lib/actions/tasks.ts:47:10
 
   const normalizedInput = name.toLowerCase().trim();
 
-  return tasks
-    .filter(t => t.id !== excludeTaskId)
+  return tasks
     .map(t => {
       const normalizedExisting = t.name.toLowerCase().trim();
killedBy: Task Actions - Archive/Recurring Functions findSimilarTasks should exclude the task being searched for
statusReason: expected { id: 1, completed: +0, …(4) } to be undefined

[Killed] EqualityOperator
src/lib/actions/tasks.ts:48:18
   const normalizedInput = name.toLowerCase().trim();
 
   return tasks
-    .filter(t => t.id !== excludeTaskId)
+    .filter(t => t.id === excludeTaskId)
     .map(t => {
       const normalizedExisting = t.name.toLowerCase().trim();
killedBy: Task Actions - Archive/Recurring Functions findSimilarTasks should exclude the task being searched for
statusReason: expected { id: 1, completed: +0, …(4) } to be undefined

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:48:18
   const normalizedInput = name.toLowerCase().trim();
 
   return tasks
-    .filter(t => t.id !== excludeTaskId)
+    .filter(t => true)
     .map(t => {
       const normalizedExisting = t.name.toLowerCase().trim();
killedBy: Task Actions - Archive/Recurring Functions findSimilarTasks should exclude the task being searched for
statusReason: expected { id: 1, completed: +0, …(4) } to be undefined

[Killed] BlockStatement
src/lib/actions/tasks.ts:49:15
 
   return tasks
     .filter(t => t.id !== excludeTaskId)
-    .map(t => {
-      const normalizedExisting = t.name.toLowerCase().trim();
-      // Simple similarity: check if one contains the other or they share significant words
-      const words = normalizedInput.split(/\s+/);
-      const existingWords = normalizedExisting.split(/\s+/);
-
-      const commonWords = words.filter(w => existingWords.includes(w));
-      const similarity =
-        words.length > 0 ? commonWords.length / words.length : 0;
-
-      // Also check for substring matches
-      const containsMatch =
-        normalizedExisting.includes(normalizedInput) ||
-        normalizedInput.includes(normalizedExisting)
-          ? 0.8
-          : 0;
-
-      return { ...t, similarity: Math.max(similarity, containsMatch) };
-    })
+    .map(t => {})
     .filter(t => t.similarity > 0.5)
     .sort((a, b) => b.similarity - a.similarity)
killedBy: Task Actions - Archive/Recurring Functions findSimilarTasks should find similar tasks by substring match
statusReason: Cannot read properties of undefined (reading 'similarity')

[Survived] MethodExpression
src/lib/actions/tasks.ts:50:34
   return tasks
     .filter(t => t.id !== excludeTaskId)
     .map(t => {
-      const normalizedExisting = t.name.toLowerCase().trim();
+      const normalizedExisting = t.name.toLowerCase();
       // Simple similarity: check if one contains the other or they share significant words
       const words = normalizedInput.split(/\s+/);

[Survived] MethodExpression
src/lib/actions/tasks.ts:50:34
   return tasks
     .filter(t => t.id !== excludeTaskId)
     .map(t => {
-      const normalizedExisting = t.name.toLowerCase().trim();
+      const normalizedExisting = t.name.toUpperCase().trim();
       // Simple similarity: check if one contains the other or they share significant words
       const words = normalizedInput.split(/\s+/);

[Survived] Regex
src/lib/actions/tasks.ts:52:43
     .map(t => {
       const normalizedExisting = t.name.toLowerCase().trim();
       // Simple similarity: check if one contains the other or they share significant words
-      const words = normalizedInput.split(/\s+/);
+      const words = normalizedInput.split(/\S+/);
       const existingWords = normalizedExisting.split(/\s+/);
 

[Survived] ArrowFunction
src/lib/actions/tasks.ts:55:40
       const words = normalizedInput.split(/\s+/);
       const existingWords = normalizedExisting.split(/\s+/);
 
-      const commonWords = words.filter(w => existingWords.includes(w));
+      const commonWords = words.filter(() => undefined);
       const similarity =
         words.length > 0 ? commonWords.length / words.length : 0;

[Survived] MethodExpression
src/lib/actions/tasks.ts:55:27
       const words = normalizedInput.split(/\s+/);
       const existingWords = normalizedExisting.split(/\s+/);
 
-      const commonWords = words.filter(w => existingWords.includes(w));
+      const commonWords = words;
       const similarity =
         words.length > 0 ? commonWords.length / words.length : 0;

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:57:28
 
       const commonWords = words.filter(w => existingWords.includes(w));
       const similarity =
-        words.length > 0 ? commonWords.length / words.length : 0;
+        words.length > 0 ? commonWords.length * words.length : 0;
 
       // Also check for substring matches

[Survived] EqualityOperator
src/lib/actions/tasks.ts:57:9
 
       const commonWords = words.filter(w => existingWords.includes(w));
       const similarity =
-        words.length > 0 ? commonWords.length / words.length : 0;
+        words.length >= 0 ? commonWords.length / words.length : 0;
 
       // Also check for substring matches

[Survived] LogicalOperator
src/lib/actions/tasks.ts:61:9
 
       // Also check for substring matches
       const containsMatch =
-        normalizedExisting.includes(normalizedInput) ||
-        normalizedInput.includes(normalizedExisting)
+        normalizedExisting.includes(normalizedInput) && normalizedInput.includes(normalizedExisting)
           ? 0.8
           : 0;

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:61:9
 
       // Also check for substring matches
       const containsMatch =
-        normalizedExisting.includes(normalizedInput) ||
-        normalizedInput.includes(normalizedExisting)
+        true
           ? 0.8
           : 0;

[Survived] MethodExpression
src/lib/actions/tasks.ts:66:34
           ? 0.8
           : 0;
 
-      return { ...t, similarity: Math.max(similarity, containsMatch) };
+      return { ...t, similarity: Math.min(similarity, containsMatch) };
     })
     .filter(t => t.similarity > 0.5)

[Survived] EqualityOperator
src/lib/actions/tasks.ts:68:18
 
       return { ...t, similarity: Math.max(similarity, containsMatch) };
     })
-    .filter(t => t.similarity > 0.5)
+    .filter(t => t.similarity >= 0.5)
     .sort((a, b) => b.similarity - a.similarity)
     .slice(0, 5);

[Survived] EqualityOperator
src/lib/actions/tasks.ts:68:18
 
       return { ...t, similarity: Math.max(similarity, containsMatch) };
     })
-    .filter(t => t.similarity > 0.5)
+    .filter(t => t.similarity <= 0.5)
     .sort((a, b) => b.similarity - a.similarity)
     .slice(0, 5);

[Survived] ArrowFunction
src/lib/actions/tasks.ts:69:11
       return { ...t, similarity: Math.max(similarity, containsMatch) };
     })
     .filter(t => t.similarity > 0.5)
-    .sort((a, b) => b.similarity - a.similarity)
+    .sort(() => undefined)
     .slice(0, 5);
 }

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:69:21
       return { ...t, similarity: Math.max(similarity, containsMatch) };
     })
     .filter(t => t.similarity > 0.5)
-    .sort((a, b) => b.similarity - a.similarity)
+    .sort((a, b) => b.similarity + a.similarity)
     .slice(0, 5);
 }

[Survived] OptionalChaining
src/lib/actions/tasks.ts:78:7
   const user = await getCurrentUser();
 
   // User isolation: only show lists owned by the user
-  if (user?.id) {
+  if (user.id) {
     return db
       .prepare(

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:78:7
   const user = await getCurrentUser();
 
   // User isolation: only show lists owned by the user
-  if (user?.id) {
+  if (true) {
     return db
       .prepare(

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:88:5
 
   // In test/demo mode, return inbox with user_id = 1 or null (for compatibility)
   if (
-    process.env.NODE_ENV === 'test' ||
-    process.env.NEXTAUTH_SECRET === 'demo-secret'
+    false
   ) {
     return db

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:88:5
 
   // In test/demo mode, return inbox with user_id = 1 or null (for compatibility)
   if (
-    process.env.NODE_ENV === 'test' ||
+    false ||
     process.env.NEXTAUTH_SECRET === 'demo-secret'
   ) {

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:89:5
   // In test/demo mode, return inbox with user_id = 1 or null (for compatibility)
   if (
     process.env.NODE_ENV === 'test' ||
-    process.env.NEXTAUTH_SECRET === 'demo-secret'
+    false
   ) {
     return db

[NoCoverage] EqualityOperator
src/lib/actions/tasks.ts:89:5
   // In test/demo mode, return inbox with user_id = 1 or null (for compatibility)
   if (
     process.env.NODE_ENV === 'test' ||
-    process.env.NEXTAUTH_SECRET === 'demo-secret'
+    process.env.NEXTAUTH_SECRET !== 'demo-secret'
   ) {
     return db

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:90:5
   if (
     process.env.NODE_ENV === 'test' ||
     process.env.NEXTAUTH_SECRET === 'demo-secret'
-  ) {
-    return db
-      .prepare(
-        'SELECT * FROM lists WHERE user_id = 1 OR user_id IS NULL ORDER BY is_inbox DESC, name ASC'
-      )
-      .all() as List[];
-  }
+  ) {}
 
   return [];

[Killed] BlockStatement
src/lib/actions/tasks.ts:101:74
   return [];
 }
 
-export async function getListById(id: number): Promise<List | undefined> {
-  const db = getDb();
-  const user = await getCurrentUser();
-
-  // User isolation: only show lists owned by the user
-  if (user?.id) {
-    return db
-      .prepare('SELECT * FROM lists WHERE id = ? AND user_id = ?')
-      .get(id, user.id) as List | undefined;
-  }
-
-  // In test/demo mode, allow access to any list
-  if (
-    process.env.NODE_ENV === 'test' ||
-    process.env.NEXTAUTH_SECRET === 'demo-secret'
-  ) {
-    return db.prepare('SELECT * FROM lists WHERE id = ?').get(id) as
-      List | undefined;
-  }
-
-  return undefined;
-}
+export async function getListById(id: number): Promise<List | undefined> {}
 
 export async function createList(input: CreateListInput): Promise<List> {
killedBy: Task Actions Lists should create a new list
statusReason: Failed to create list

[Survived] BlockStatement
src/lib/actions/tasks.ts:106:17
   const user = await getCurrentUser();
 
   // User isolation: only show lists owned by the user
-  if (user?.id) {
-    return db
-      .prepare('SELECT * FROM lists WHERE id = ? AND user_id = ?')
-      .get(id, user.id) as List | undefined;
-  }
+  if (user?.id) {}
 
   // In test/demo mode, allow access to any list

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:114:5
 
   // In test/demo mode, allow access to any list
   if (
-    process.env.NODE_ENV === 'test' ||
-    process.env.NEXTAUTH_SECRET === 'demo-secret'
+    true
   ) {
     return db.prepare('SELECT * FROM lists WHERE id = ?').get(id) as

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:116:5
   if (
     process.env.NODE_ENV === 'test' ||
     process.env.NEXTAUTH_SECRET === 'demo-secret'
-  ) {
-    return db.prepare('SELECT * FROM lists WHERE id = ?').get(id) as
-      List | undefined;
-  }
+  ) {}
 
   return undefined;

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:127:7
 export async function createList(input: CreateListInput): Promise<List> {
   // Validate input
   const parsed = listSchema.safeParse(input);
-  if (!parsed.success) {
+  if (true) {
     throw new Error(parsed.error.issues[0]?.message || 'Invalid list data');
   }
killedBy: Task Actions - Comprehensive Tests List Operations getLists should create and retrieve lists
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:127:7
 export async function createList(input: CreateListInput): Promise<List> {
   // Validate input
   const parsed = listSchema.safeParse(input);
-  if (!parsed.success) {
+  if (parsed.success) {
     throw new Error(parsed.error.issues[0]?.message || 'Invalid list data');
   }
killedBy: Task Actions - Comprehensive Tests List Operations getLists should create and retrieve lists
statusReason: Cannot read properties of undefined (reading 'issues')

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:128:21
   // Validate input
   const parsed = listSchema.safeParse(input);
   if (!parsed.success) {
-    throw new Error(parsed.error.issues[0]?.message || 'Invalid list data');
+    throw new Error(true);
   }
 

[Survived] OptionalChaining
src/lib/actions/tasks.ts:128:21
   // Validate input
   const parsed = listSchema.safeParse(input);
   if (!parsed.success) {
-    throw new Error(parsed.error.issues[0]?.message || 'Invalid list data');
+    throw new Error(parsed.error.issues[0].message || 'Invalid list data');
   }
 

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:133:31
 
   const db = getDb();
   const user = await getCurrentUser();
-  const userId = user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
+  const userId = user?.id ?? (false ? 1 : null);
 
   const result = db

[Survived] OptionalChaining
src/lib/actions/tasks.ts:133:18
 
   const db = getDb();
   const user = await getCurrentUser();
-  const userId = user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
+  const userId = user.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
 
   const result = db

[Killed] LogicalOperator
src/lib/actions/tasks.ts:141:7
     )
     .run(
       parsed.data.name,
-      parsed.data.emoji || '📋',
+      parsed.data.emoji && '📋'
       parsed.data.color || '#6366f1',
       userId
killedBy: Task Actions - Comprehensive Tests List Operations createList should create a list with custom values
statusReason: expected '📋' to be '📁' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:141:7
     )
     .run(
       parsed.data.name,
-      parsed.data.emoji || '📋',
+      false
       parsed.data.color || '#6366f1',
       userId
killedBy: Task Actions - Comprehensive Tests List Operations createList should create a list with default values
statusReason: expected false to be '📋' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:142:7
     .run(
       parsed.data.name,
       parsed.data.emoji || '📋',
-      parsed.data.color || '#6366f1',
+      false,
       userId
     );
killedBy: Task Actions - Comprehensive Tests List Operations createList should create a list with custom values
statusReason: expected false to be '#ff0000' // Object.is equality

[Killed] LogicalOperator
src/lib/actions/tasks.ts:142:7
     .run(
       parsed.data.name,
       parsed.data.emoji || '📋',
-      parsed.data.color || '#6366f1',
+      parsed.data.color && '#6366f1',
       userId
     );
killedBy: Task Actions - Comprehensive Tests List Operations createList should create a list with custom values
statusReason: expected '#6366f1' to be '#ff0000' // Object.is equality

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:146:7
       userId
     );
   const list = await getListById(Number(result.lastInsertRowid));
-  if (!list) {
+  if (list) {
     throw new Error('Failed to create list');
   }
killedBy: Task Actions - Comprehensive Tests List Operations getLists should create and retrieve lists
statusReason: Failed to create list

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:146:7
       userId
     );
   const list = await getListById(Number(result.lastInsertRowid));
-  if (!list) {
+  if (true) {
     throw new Error('Failed to create list');
   }
killedBy: Task Actions - Comprehensive Tests List Operations getLists should create and retrieve lists
statusReason: Failed to create list

[Survived] LogicalOperator
src/lib/actions/tasks.ts:161:5
 
   // Verify user owns the list before updating (or test mode)
   const effectiveUserId =
-    user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
+    user?.id && (process.env.NODE_ENV === 'test' ? 1 : null);
   if (effectiveUserId && process.env.NODE_ENV !== 'test') {
     const existing = db

[NoCoverage] EqualityOperator
src/lib/actions/tasks.ts:161:18
 
   // Verify user owns the list before updating (or test mode)
   const effectiveUserId =
-    user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
+    user?.id ?? (process.env.NODE_ENV !== 'test' ? 1 : null);
   if (effectiveUserId && process.env.NODE_ENV !== 'test') {
     const existing = db

[Survived] EqualityOperator
src/lib/actions/tasks.ts:162:26
   // Verify user owns the list before updating (or test mode)
   const effectiveUserId =
     user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-  if (effectiveUserId && process.env.NODE_ENV !== 'test') {
+  if (effectiveUserId && process.env.NODE_ENV === 'test') {
     const existing = db
       .prepare('SELECT id FROM lists WHERE id = ? AND user_id = ?')

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:162:7
   // Verify user owns the list before updating (or test mode)
   const effectiveUserId =
     user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-  if (effectiveUserId && process.env.NODE_ENV !== 'test') {
+  if (true) {
     const existing = db
       .prepare('SELECT id FROM lists WHERE id = ? AND user_id = ?')

[NoCoverage] BooleanLiteral
src/lib/actions/tasks.ts:166:9
     const existing = db
       .prepare('SELECT id FROM lists WHERE id = ? AND user_id = ?')
       .get(id, effectiveUserId);
-    if (!existing) {
+    if (existing) {
       throw new Error('List not found or access denied');
     }

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:166:9
     const existing = db
       .prepare('SELECT id FROM lists WHERE id = ? AND user_id = ?')
       .get(id, effectiveUserId);
-    if (!existing) {
+    if (true) {
       throw new Error('List not found or access denied');
     }

[Killed] BlockStatement
src/lib/actions/tasks.ts:173:33
 
   const fields: string[] = [];
   const values: unknown[] = [];
-  if (input.name !== undefined) {
-    fields.push('name = ?');
-    values.push(input.name);
-  }
+  if (input.name !== undefined) {}
   if (input.emoji !== undefined) {
     fields.push('emoji = ?');
killedBy: Task Actions - Comprehensive Tests List Operations updateList should update list name
statusReason: No fields to update

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:173:7
 
   const fields: string[] = [];
   const values: unknown[] = [];
-  if (input.name !== undefined) {
+  if (false) {
     fields.push('name = ?');
     values.push(input.name);
killedBy: Task Actions - Comprehensive Tests List Operations updateList should update list name
statusReason: No fields to update

[Killed] StringLiteral
src/lib/actions/tasks.ts:174:17
   const fields: string[] = [];
   const values: unknown[] = [];
   if (input.name !== undefined) {
-    fields.push('name = ?');
+    fields.push("");
     values.push(input.name);
   }
killedBy: Task Actions - Comprehensive Tests List Operations updateList should update list name
statusReason: expected 'Work' to be 'Work Updated' // Object.is equality

[Survived] EqualityOperator
src/lib/actions/tasks.ts:177:7
     fields.push('name = ?');
     values.push(input.name);
   }
-  if (input.emoji !== undefined) {
+  if (input.emoji === undefined) {
     fields.push('emoji = ?');
     values.push(input.emoji);

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:177:7
     fields.push('name = ?');
     values.push(input.name);
   }
-  if (input.emoji !== undefined) {
+  if (false) {
     fields.push('emoji = ?');
     values.push(input.emoji);

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:178:17
     values.push(input.name);
   }
   if (input.emoji !== undefined) {
-    fields.push('emoji = ?');
+    fields.push("");
     values.push(input.emoji);
   }

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:181:34
     fields.push('emoji = ?');
     values.push(input.emoji);
   }
-  if (input.color !== undefined) {
-    fields.push('color = ?');
-    values.push(input.color);
-  }
+  if (input.color !== undefined) {}
   if (fields.length === 0) throw new Error('No fields to update');
   values.push(id);

[Survived] EqualityOperator
src/lib/actions/tasks.ts:181:7
     fields.push('emoji = ?');
     values.push(input.emoji);
   }
-  if (input.color !== undefined) {
+  if (input.color === undefined) {
     fields.push('color = ?');
     values.push(input.color);

[Killed] EqualityOperator
src/lib/actions/tasks.ts:185:7
     fields.push('color = ?');
     values.push(input.color);
   }
-  if (fields.length === 0) throw new Error('No fields to update');
+  if (fields.length !== 0) throw new Error('No fields to update');
   values.push(id);
   db.prepare(`UPDATE lists SET ${fields.join(', ')} WHERE id = ?`).run(
killedBy: Task Actions - Comprehensive Tests List Operations updateList should update list name
statusReason: No fields to update

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:185:7
     fields.push('color = ?');
     values.push(input.color);
   }
-  if (fields.length === 0) throw new Error('No fields to update');
+  if (true) throw new Error('No fields to update');
   values.push(id);
   db.prepare(`UPDATE lists SET ${fields.join(', ')} WHERE id = ?`).run(
killedBy: Task Actions - Comprehensive Tests List Operations updateList should update list name
statusReason: No fields to update

[Killed] StringLiteral
src/lib/actions/tasks.ts:187:14
   }
   if (fields.length === 0) throw new Error('No fields to update');
   values.push(id);
-  db.prepare(`UPDATE lists SET ${fields.join(', ')} WHERE id = ?`).run(
+  db.prepare(``).run(
     ...values
   );
killedBy: Task Actions - Comprehensive Tests List Operations updateList should update list name
statusReason: expected 'Work' to be 'Work Updated' // Object.is equality

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:191:7
     ...values
   );
   const updated = await getListById(id);
-  if (!updated) {
+  if (updated) {
     throw new Error('Failed to update list');
   }
killedBy: Task Actions - Comprehensive Tests List Operations updateList should update list name
statusReason: Failed to update list

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:191:7
     ...values
   );
   const updated = await getListById(id);
-  if (!updated) {
+  if (true) {
     throw new Error('Failed to update list');
   }
killedBy: Task Actions - Comprehensive Tests List Operations updateList should update list name
statusReason: Failed to update list

[Killed] BlockStatement
src/lib/actions/tasks.ts:197:61
   return updated;
 }
 
-export async function deleteList(id: number): Promise<void> {
-  const db = getDb();
-  const user = await getCurrentUser();
-
-  // Verify user owns the list before deleting (or test mode)
-  if (user?.id || process.env.NODE_ENV === 'test') {
-    const effectiveUserId =
-      user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-    if (effectiveUserId) {
-      db.prepare('UPDATE tasks SET list_id = 1 WHERE list_id = ?').run(id);
-      db.prepare('DELETE FROM lists WHERE id = ?').run(id);
-    }
-  }
-}
+export async function deleteList(id: number): Promise<void> {}
 
 export async function getLabels(): Promise<Label[]> {
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: expected { id: 1, name: 'Temp', …(3) } to be undefined

[Killed] BlockStatement
src/lib/actions/tasks.ts:202:52
   const user = await getCurrentUser();
 
   // Verify user owns the list before deleting (or test mode)
-  if (user?.id || process.env.NODE_ENV === 'test') {
-    const effectiveUserId =
-      user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-    if (effectiveUserId) {
-      db.prepare('UPDATE tasks SET list_id = 1 WHERE list_id = ?').run(id);
-      db.prepare('DELETE FROM lists WHERE id = ?').run(id);
-    }
-  }
+  if (user?.id || process.env.NODE_ENV === 'test') {}
 }
 
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: expected { id: 1, name: 'Temp', …(3) } to be undefined

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:202:7
   const user = await getCurrentUser();
 
   // Verify user owns the list before deleting (or test mode)
-  if (user?.id || process.env.NODE_ENV === 'test') {
+  if (false) {
     const effectiveUserId =
       user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
killedBy: Task Actions - Comprehensive Tests List Operations deleteList should delete a list
statusReason: expected { id: 1, name: 'Work', …(3) } to be undefined

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:204:20
   // Verify user owns the list before deleting (or test mode)
   if (user?.id || process.env.NODE_ENV === 'test') {
     const effectiveUserId =
-      user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
+      user?.id ?? (true ? 1 : null);
     if (effectiveUserId) {
       db.prepare('UPDATE tasks SET list_id = 1 WHERE list_id = ?').run(id);

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:205:9
   if (user?.id || process.env.NODE_ENV === 'test') {
     const effectiveUserId =
       user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-    if (effectiveUserId) {
+    if (false) {
       db.prepare('UPDATE tasks SET list_id = 1 WHERE list_id = ?').run(id);
       db.prepare('DELETE FROM lists WHERE id = ?').run(id);
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: expected { id: 1, name: 'Temp', …(3) } to be undefined

[Killed] BlockStatement
src/lib/actions/tasks.ts:205:26
   if (user?.id || process.env.NODE_ENV === 'test') {
     const effectiveUserId =
       user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-    if (effectiveUserId) {
-      db.prepare('UPDATE tasks SET list_id = 1 WHERE list_id = ?').run(id);
-      db.prepare('DELETE FROM lists WHERE id = ?').run(id);
-    }
+    if (effectiveUserId) {}
   }
 }
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: expected { id: 1, name: 'Temp', …(3) } to be undefined

[Survived] StringLiteral
src/lib/actions/tasks.ts:206:18
     const effectiveUserId =
       user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
     if (effectiveUserId) {
-      db.prepare('UPDATE tasks SET list_id = 1 WHERE list_id = ?').run(id);
+      db.prepare("").run(id);
       db.prepare('DELETE FROM lists WHERE id = ?').run(id);
     }
