[Killed] ConditionalExpression
app/api/task-votes/route.ts:21:7
  */
 export async function GET(request: NextRequest) {
   const middlewareResult = await applyMiddleware(request);
-  if (middlewareResult.error) {
+  if (true) {
     return middlewareResult.error;
   }
killedBy: Task Voting API - Response Structure Tests should return proper response structure for GET without params
statusReason: Cannot read properties of null (reading 'status')

[NoCoverage] BlockStatement
app/api/task-votes/route.ts:21:31
  */
 export async function GET(request: NextRequest) {
   const middlewareResult = await applyMiddleware(request);
-  if (middlewareResult.error) {
-    return middlewareResult.error;
-  }
+  if (middlewareResult.error) {}
 
   try {

[Killed] ConditionalExpression
app/api/task-votes/route.ts:32:9
 
     const db = getDb();
 
-    if (taskIdParam && userIdParam) {
+    if (true) {
       // Get vote for specific user and task
       const vote = await db
killedBy: Task Voting API - Response Structure Tests should return proper response structure for GET without params
statusReason: expected { vote: null } to have property "votes"

[Survived] LogicalOperator
app/api/task-votes/route.ts:32:9
 
     const db = getDb();
 
-    if (taskIdParam && userIdParam) {
+    if (taskIdParam || userIdParam) {
       // Get vote for specific user and task
       const vote = await db

[Survived] LogicalOperator
app/api/task-votes/route.ts:39:17
         .get(parseInt(taskIdParam), parseInt(userIdParam));
 
       return jsonResponse(
-        { vote: vote || null },
+        { vote: vote && null },
         200,
         middlewareResult.headers

[Survived] ConditionalExpression
app/api/task-votes/route.ts:39:17
         .get(parseInt(taskIdParam), parseInt(userIdParam));
 
       return jsonResponse(
-        { vote: vote || null },
+        { vote: true },
         200,
         middlewareResult.headers

[Survived] ConditionalExpression
app/api/task-votes/route.ts:45:9
       );
     }
 
-    if (taskIdParam) {
+    if (false) {
       // Get all votes for a task with user info
       const votes = await db

[Survived] ConditionalExpression
app/api/task-votes/route.ts:45:9
       );
     }
 
-    if (taskIdParam) {
+    if (true) {
       // Get all votes for a task with user info
       const votes = await db

[NoCoverage] ArithmeticOperator
app/api/task-votes/route.ts:57:48
         .all(parseInt(taskIdParam));
 
       const total = votes.reduce(
-        (sum: number, v: { value: number }) => sum + v.value,
+        (sum: number, v: { value: number }) => sum - v.value,
         0
       );

[Survived] ArrowFunction
app/api/task-votes/route.ts:57:9
         .all(parseInt(taskIdParam));
 
       const total = votes.reduce(
-        (sum: number, v: { value: number }) => sum + v.value,
+        () => undefined,
         0
       );

[Survived] ObjectLiteral
app/api/task-votes/route.ts:63:9
       const count = votes.length;
 
       return jsonResponse(
-        {
-          votes,
-          total,
-          count,
-          score: count > 0 ? total / count : 0,
-        },
+        {},
         200,
         middlewareResult.headers

[Survived] ConditionalExpression
app/api/task-votes/route.ts:67:18
           votes,
           total,
           count,
-          score: count > 0 ? total / count : 0,
+          score: false ? total / count : 0,
         },
         200,

[NoCoverage] ArithmeticOperator
app/api/task-votes/route.ts:67:30
           votes,
           total,
           count,
-          score: count > 0 ? total / count : 0,
+          score: count > 0 ? total * count : 0,
         },
         200,

[Survived] ConditionalExpression
app/api/task-votes/route.ts:83:9
     `;
     const params: number[] = [];
 
-    if (userIdParam) {
+    if (true) {
       query += ' WHERE tv.user_id = ?';
       params.push(parseInt(userIdParam));

[Survived] ConditionalExpression
app/api/task-votes/route.ts:83:9
     `;
     const params: number[] = [];
 
-    if (userIdParam) {
+    if (false) {
       query += ' WHERE tv.user_id = ?';
       params.push(parseInt(userIdParam));

[Survived] StringLiteral
app/api/task-votes/route.ts:88:14
       params.push(parseInt(userIdParam));
     }
 
-    query += ' ORDER BY tv.created_at DESC';
+    query += "";
 
     const votes = await db.prepare(query).all(...params);

[Killed] ObjectLiteral
app/api/task-votes/route.ts:91:25
     query += ' ORDER BY tv.created_at DESC';
 
     const votes = await db.prepare(query).all(...params);
-    return jsonResponse({ votes }, 200, middlewareResult.headers);
+    return jsonResponse({}, 200, middlewareResult.headers);
   } catch (error) {
     logError(
killedBy: Task Voting API - Response Structure Tests should return proper response structure for GET without params
statusReason: expected {} to have property "votes"

[NoCoverage] BlockStatement
app/api/task-votes/route.ts:92:19
 
     const votes = await db.prepare(query).all(...params);
     return jsonResponse({ votes }, 200, middlewareResult.headers);
-  } catch (error) {
-    logError(
-      'Failed to fetch votes',
-      undefined,
-      error instanceof Error ? error : new Error(String(error))
-    );
-    return errorResponse('Failed to fetch votes', 500);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
app/api/task-votes/route.ts:98:26
       undefined,
       error instanceof Error ? error : new Error(String(error))
     );
-    return errorResponse('Failed to fetch votes', 500);
+    return errorResponse("", 500);
   }
 }

[Survived] ConditionalExpression
app/api/task-votes/route.ts:107:7
  */
 export async function POST(request: NextRequest) {
   const middlewareResult = await applyMiddleware(request);
-  if (middlewareResult.error) {
+  if (false) {
     return middlewareResult.error;
   }

[Killed] LogicalOperator
app/api/task-votes/route.ts:115:9
     const body = await request.json();
     const { task_id, value } = body as VoteBody;
 
-    if (!task_id || !value || (value !== -1 && value !== 1)) {
+    if ((!task_id || !value) && value !== -1 && value !== 1) {
       return errorResponse('Invalid vote data. value must be -1 or 1', 400);
     }
killedBy: Task Voting API - Request Validation Tests POST validation should return 400 for missing task_id
statusReason: expected 404 to be 400 // Object.is equality

[Killed] LogicalOperator
app/api/task-votes/route.ts:115:32
     const body = await request.json();
     const { task_id, value } = body as VoteBody;
 
-    if (!task_id || !value || (value !== -1 && value !== 1)) {
+    if (!task_id || !value || (value !== -1 || value !== 1)) {
       return errorResponse('Invalid vote data. value must be -1 or 1', 400);
     }
killedBy: Task Voting API - Response Structure Tests should return proper response structure for POST success
statusReason: expected [ 200, 404, 500 ] to include 400

[Survived] ConditionalExpression
app/api/task-votes/route.ts:125:9
     const task = await db
       .prepare('SELECT id FROM tasks WHERE id = ?')
       .get(task_id);
-    if (!task) {
+    if (false) {
       return errorResponse('Task not found', 404);
     }

[Survived] ConditionalExpression
app/api/task-votes/route.ts:125:9
     const task = await db
       .prepare('SELECT id FROM tasks WHERE id = ?')
       .get(task_id);
-    if (!task) {
+    if (true) {
       return errorResponse('Task not found', 404);
     }

[Survived] ConditionalExpression
app/api/task-votes/route.ts:130:20
     }
 
     // Get user from auth
-    const userId = middlewareResult.auth?.userId || 1;
+    const userId = false;
 
     // Upsert vote

[Survived] LogicalOperator
app/api/task-votes/route.ts:130:20
     }
 
     // Get user from auth
-    const userId = middlewareResult.auth?.userId || 1;
+    const userId = middlewareResult.auth?.userId && 1;
 
     // Upsert vote

[Survived] StringLiteral
app/api/task-votes/route.ts:134:16
 
     // Upsert vote
     const existingVote = await db
-      .prepare('SELECT id FROM task_votes WHERE task_id = ? AND user_id = ?')
+      .prepare("")
       .get(task_id, userId);
 

[Survived] ConditionalExpression
app/api/task-votes/route.ts:137:9
       .prepare('SELECT id FROM task_votes WHERE task_id = ? AND user_id = ?')
       .get(task_id, userId);
 
-    if (existingVote) {
+    if (false) {
       // Update existing vote
       db.prepare(

[Survived] ConditionalExpression
app/api/task-votes/route.ts:137:9
       .prepare('SELECT id FROM task_votes WHERE task_id = ? AND user_id = ?')
       .get(task_id, userId);
 
-    if (existingVote) {
+    if (true) {
       // Update existing vote
       db.prepare(

[Survived] BlockStatement
app/api/task-votes/route.ts:142:12
       db.prepare(
         'UPDATE task_votes SET value = ? WHERE task_id = ? AND user_id = ?'
       ).run(value, task_id, userId);
-    } else {
-      // Create new vote
-      db.prepare(
-        'INSERT INTO task_votes (task_id, user_id, value) VALUES (?, ?, ?)'
-      ).run(task_id, userId, value);
-    }
+    } else {}
 
     // Get updated vote count

[Survived] StringLiteral
app/api/task-votes/route.ts:145:9
     } else {
       // Create new vote
       db.prepare(
-        'INSERT INTO task_votes (task_id, user_id, value) VALUES (?, ?, ?)'
+        ""
       ).run(task_id, userId, value);
     }

[Survived] EqualityOperator
app/api/task-votes/route.ts:164:18
         stats: {
           total: voteStats.total,
           count: voteStats.count,
-          score: voteStats.count > 0 ? voteStats.total / voteStats.count : 0,
+          score: voteStats.count >= 0 ? voteStats.total / voteStats.count : 0,
         },
       },

[Survived] ArithmeticOperator
app/api/task-votes/route.ts:164:40
         stats: {
           total: voteStats.total,
           count: voteStats.count,
-          score: voteStats.count > 0 ? voteStats.total / voteStats.count : 0,
+          score: voteStats.count > 0 ? voteStats.total * voteStats.count : 0,
         },
       },

[NoCoverage] BlockStatement
app/api/task-votes/route.ts:170:19
       200,
       middlewareResult.headers
     );
-  } catch (error) {
-    logError(
-      'Failed to create vote',
-      undefined,
-      error instanceof Error ? error : new Error(String(error))
-    );
-    return errorResponse('Failed to create vote', 500);
-  }
+  } catch (error) {}
 }
 

[Killed] BlockStatement
app/api/task-votes/route.ts:189:7
     return middlewareResult.error;
   }
 
-  try {
-    const searchParams = request.nextUrl.searchParams;
-    const taskIdParam = searchParams.get('task_id');
-
-    if (!taskIdParam) {
-      return errorResponse('task_id is required', 400);
-    }
-
-    const db = getDb();
-    const userId = middlewareResult.auth?.userId || 1;
-    await db
-      .prepare('DELETE FROM task_votes WHERE task_id = ? AND user_id = ?')
-      .run(parseInt(taskIdParam), userId);
-
-    return jsonResponse({ success: true }, 200, middlewareResult.headers);
-  } catch (error) {
+  try {} catch (error) {
     logError(
       'Failed to delete vote',
killedBy: Task Votes API DELETE deletes a vote
statusReason: expected undefined to be defined

[Killed] BlockStatement
app/api/task-votes/route.ts:193:23
     const searchParams = request.nextUrl.searchParams;
     const taskIdParam = searchParams.get('task_id');
 
-    if (!taskIdParam) {
-      return errorResponse('task_id is required', 400);
-    }
+    if (!taskIdParam) {}
 
     const db = getDb();
killedBy: Task Voting API - Request Validation Tests DELETE validation should return 400 for missing task_id
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BooleanLiteral
app/api/task-votes/route.ts:193:9
     const searchParams = request.nextUrl.searchParams;
     const taskIdParam = searchParams.get('task_id');
 
-    if (!taskIdParam) {
+    if (taskIdParam) {
       return errorResponse('task_id is required', 400);
     }
killedBy: Task Voting API - Request Validation Tests DELETE validation should return 400 for missing task_id
statusReason: expected 200 to be 400 // Object.is equality

[Survived] ConditionalExpression
app/api/task-votes/route.ts:198:20
     }
 
     const db = getDb();
-    const userId = middlewareResult.auth?.userId || 1;
+    const userId = false;
     await db
       .prepare('DELETE FROM task_votes WHERE task_id = ? AND user_id = ?')

[Survived] ConditionalExpression
app/api/task-votes/route.ts:198:20
     }
 
     const db = getDb();
-    const userId = middlewareResult.auth?.userId || 1;
+    const userId = true;
     await db
       .prepare('DELETE FROM task_votes WHERE task_id = ? AND user_id = ?')

[Survived] BooleanLiteral
app/api/task-votes/route.ts:203:36
       .prepare('DELETE FROM task_votes WHERE task_id = ? AND user_id = ?')
       .run(parseInt(taskIdParam), userId);
 
-    return jsonResponse({ success: true }, 200, middlewareResult.headers);
+    return jsonResponse({ success: false }, 200, middlewareResult.headers);
   } catch (error) {
     logError(

[Survived] ObjectLiteral
app/api/task-votes/route.ts:203:25
       .prepare('DELETE FROM task_votes WHERE task_id = ? AND user_id = ?')
       .run(parseInt(taskIdParam), userId);
 
-    return jsonResponse({ success: true }, 200, middlewareResult.headers);
+    return jsonResponse({}, 200, middlewareResult.headers);
   } catch (error) {
     logError(

[NoCoverage] BlockStatement
app/api/task-votes/route.ts:204:19
       .run(parseInt(taskIdParam), userId);
 
     return jsonResponse({ success: true }, 200, middlewareResult.headers);
-  } catch (error) {
-    logError(
-      'Failed to delete vote',
-      undefined,
-      error instanceof Error ? error : new Error(String(error))
-    );
-    return errorResponse('Failed to delete vote', 500);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
app/api/task-votes/route.ts:206:7
     return jsonResponse({ success: true }, 200, middlewareResult.headers);
   } catch (error) {
     logError(
-      'Failed to delete vote',
+      "",
       undefined,
       error instanceof Error ? error : new Error(String(error))

[NoCoverage] StringLiteral
app/api/task-votes/route.ts:210:26
       undefined,
       error instanceof Error ? error : new Error(String(error))
     );
-    return errorResponse('Failed to delete vote', 500);
+    return errorResponse("", 500);
   }
 }
