[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:58:3
 
 const defaultShortcuts: Shortcut[] = [
   // Navigation
-  {
-    id: 'new_task',
-    key: 'n',
-    label: 'New Task',
-    description: 'Create a new task',
-    category: 'navigation',
-    enabled: true,
-  },
+  {},
   {
     id: 'search',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:60:10
   // Navigation
   {
     id: 'new_task',
-    key: 'n',
+    key: "",
     label: 'New Task',
     description: 'Create a new task',

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:64:14
     label: 'New Task',
     description: 'Create a new task',
     category: 'navigation',
-    enabled: true,
+    enabled: false,
   },
   {

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:66:3
     category: 'navigation',
     enabled: true,
   },
-  {
-    id: 'search',
-    key: '/',
-    label: 'Search',
-    description: 'Focus search bar',
-    category: 'navigation',
-    enabled: true,
-  },
+  {},
   {
     id: 'clear',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:68:10
   },
   {
     id: 'search',
-    key: '/',
+    key: "",
     label: 'Search',
     description: 'Focus search bar',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:69:12
   {
     id: 'search',
     key: '/',
-    label: 'Search',
+    label: "",
     description: 'Focus search bar',
     category: 'navigation',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:71:15
     key: '/',
     label: 'Search',
     description: 'Focus search bar',
-    category: 'navigation',
+    category: "",
     enabled: true,
   },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:87:15
     key: '1',
     label: 'Today',
     description: 'Switch to Today view',
-    category: 'navigation',
+    category: "",
     enabled: true,
   },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:107:9
     enabled: true,
   },
   {
-    id: 'view_gantt',
+    id: "",
     key: 'g',
     label: 'Gantt',

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:113:12
     description: 'Switch to Gantt chart',
     category: 'navigation',
     enabled: true,
-    shift: true,
+    shift: false,
   },
   {

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:115:3
     enabled: true,
     shift: true,
   },
-  {
-    id: 'view_matrix',
-    key: 'm',
-    label: 'Matrix',
-    description: 'Switch to Eisenhower Matrix',
-    category: 'navigation',
-    enabled: true,
-    shift: true,
-  },
+  {},
   {
     id: 'ai_assistant',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:116:9
     shift: true,
   },
   {
-    id: 'view_matrix',
+    id: "",
     key: 'm',
     label: 'Matrix',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:125:9
     shift: true,
   },
   {
-    id: 'ai_assistant',
+    id: "",
     key: 'a',
     label: 'AI Assistant',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:126:10
   },
   {
     id: 'ai_assistant',
-    key: 'a',
+    key: "",
     label: 'AI Assistant',
     description: 'Open AI Assistant',

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:131:11
     description: 'Open AI Assistant',
     category: 'navigation',
     enabled: true,
-    meta: true,
+    meta: false,
   },
   {

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:133:3
     enabled: true,
     meta: true,
   },
-  {
-    id: 'view_calendar',
-    key: 'c',
-    label: 'Calendar',
-    description: 'Switch to Calendar view',
-    category: 'navigation',
-    enabled: true,
-  },
+  {},
   {
     id: 'show_shortcuts',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:136:12
   {
     id: 'view_calendar',
     key: 'c',
-    label: 'Calendar',
+    label: "",
     description: 'Switch to Calendar view',
     category: 'navigation',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:137:18
     id: 'view_calendar',
     key: 'c',
     label: 'Calendar',
-    description: 'Switch to Calendar view',
+    description: "",
     category: 'navigation',
     enabled: true,

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:138:15
     key: 'c',
     label: 'Calendar',
     description: 'Switch to Calendar view',
-    category: 'navigation',
+    category: "",
     enabled: true,
   },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:143:10
   },
   {
     id: 'show_shortcuts',
-    key: 'k',
+    key: "",
     label: 'Shortcuts',
     description: 'Show keyboard shortcuts',

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:152:3
   },
 
   // Tasks
-  {
-    id: 'toggle_complete',
-    key: 'space',
-    label: 'Toggle',
-    description: 'Mark task as complete/incomplete',
-    category: 'tasks',
-    enabled: true,
-  },
+  {},
   {
     id: 'edit_task',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:153:9
 
   // Tasks
   {
-    id: 'toggle_complete',
+    id: "",
     key: 'space',
     label: 'Toggle',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:154:10
   // Tasks
   {
     id: 'toggle_complete',
-    key: 'space',
+    key: "",
     label: 'Toggle',
     description: 'Mark task as complete/incomplete',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:156:18
     id: 'toggle_complete',
     key: 'space',
     label: 'Toggle',
-    description: 'Mark task as complete/incomplete',
+    description: "",
     category: 'tasks',
     enabled: true,

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:157:15
     key: 'space',
     label: 'Toggle',
     description: 'Mark task as complete/incomplete',
-    category: 'tasks',
+    category: "",
     enabled: true,
   },

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:158:14
     label: 'Toggle',
     description: 'Mark task as complete/incomplete',
     category: 'tasks',
-    enabled: true,
+    enabled: false,
   },
   {

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:161:9
     enabled: true,
   },
   {
-    id: 'edit_task',
+    id: "",
     key: 'e',
     label: 'Edit',

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:168:3
     category: 'tasks',
     enabled: true,
   },
-  {
-    id: 'delete_task',
-    key: 'delete',
-    label: 'Delete',
-    description: 'Delete selected task',
-    category: 'tasks',
-    enabled: true,
-  },
+  {},
   {
     id: 'navigate_tasks',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:169:9
     enabled: true,
   },
   {
-    id: 'delete_task',
+    id: "",
     key: 'delete',
     label: 'Delete',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:171:12
   {
     id: 'delete_task',
     key: 'delete',
-    label: 'Delete',
+    label: "",
     description: 'Delete selected task',
     category: 'tasks',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:172:18
     id: 'delete_task',
     key: 'delete',
     label: 'Delete',
-    description: 'Delete selected task',
+    description: "",
     category: 'tasks',
     enabled: true,

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:179:12
   {
     id: 'navigate_tasks',
     key: 'arrow',
-    label: 'Navigate',
+    label: "",
     description: 'Move between tasks',
     category: 'tasks',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:180:18
     id: 'navigate_tasks',
     key: 'arrow',
     label: 'Navigate',
-    description: 'Move between tasks',
+    description: "",
     category: 'tasks',
     enabled: true,

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:181:15
     key: 'arrow',
     label: 'Navigate',
     description: 'Move between tasks',
-    category: 'tasks',
+    category: "",
     enabled: true,
   },

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:184:3
     category: 'tasks',
     enabled: true,
   },
-  {
-    id: 'focus_mode',
-    key: 'f',
-    label: 'Focus',
-    description: 'Enter focus mode',
-    category: 'tasks',
-    enabled: true,
-    shift: true,
-  },
+  {},
   {
     id: 'assign_task',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:185:9
     enabled: true,
   },
   {
-    id: 'focus_mode',
+    id: "",
     key: 'f',
     label: 'Focus',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:187:12
   {
     id: 'focus_mode',
     key: 'f',
-    label: 'Focus',
+    label: "",
     description: 'Enter focus mode',
     category: 'tasks',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:189:15
     key: 'f',
     label: 'Focus',
     description: 'Enter focus mode',
-    category: 'tasks',
+    category: "",
     enabled: true,
     shift: true,

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:193:3
     enabled: true,
     shift: true,
   },
-  {
-    id: 'assign_task',
-    key: 'a',
-    label: 'Assign',
-    description: 'Open assignment tab',
-    category: 'tasks',
-    enabled: true,
-    shift: true,
-  },
+  {},
   {
     id: 'time_track',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:205:12
   {
     id: 'time_track',
     key: 't',
-    label: 'Time',
+    label: "",
     description: 'Open time tracking tab',
     category: 'tasks',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:214:12
   {
     id: 'add_comment',
     key: 'c',
-    label: 'Comments',
+    label: "",
     description: 'Open comments tab',
     category: 'tasks',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:216:15
     key: 'c',
     label: 'Comments',
     description: 'Open comments tab',
-    category: 'tasks',
+    category: "",
     enabled: true,
     shift: true,

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:222:10
   },
   {
     id: 'add_attachment',
-    key: 'f',
+    key: "",
     label: 'Files',
     description: 'Open attachments tab',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:224:18
     id: 'add_attachment',
     key: 'f',
     label: 'Files',
-    description: 'Open attachments tab',
+    description: "",
     category: 'tasks',
     enabled: true,

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:231:3
   },
 
   // Search
-  {
-    id: 'settings',
-    key: ',',
-    label: 'Settings',
-    description: 'Open settings',
-    category: 'search',
-    enabled: true,
-    meta: true,
-  },
+  {},
 ];
 

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:233:10
   // Search
   {
     id: 'settings',
-    key: ',',
+    key: "",
     label: 'Settings',
     description: 'Open settings',

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:237:14
     label: 'Settings',
     description: 'Open settings',
     category: 'search',
-    enabled: true,
+    enabled: false,
     meta: true,
   },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:243:3
 ];
 
 const availableKeys = [
-  'a',
+  "",
   'b',
   'c',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:245:3
 const availableKeys = [
   'a',
   'b',
-  'c',
+  "",
   'd',
   'e',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:247:3
   'b',
   'c',
   'd',
-  'e',
+  "",
   'f',
   'g',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:254:3
   'i',
   'j',
   'k',
-  'l',
+  "",
   'm',
   'n',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:255:3
   'j',
   'k',
   'l',
-  'm',
+  "",
   'n',
   'o',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:257:3
   'l',
   'm',
   'n',
-  'o',
+  "",
   'p',
   'q',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:258:3
   'm',
   'n',
   'o',
-  'p',
+  "",
   'q',
   'r',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:259:3
   'n',
   'o',
   'p',
-  'q',
+  "",
   'r',
   's',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:260:3
   'o',
   'p',
   'q',
-  'r',
+  "",
   's',
   't',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:264:3
   's',
   't',
   'u',
-  'v',
+  "",
   'w',
   'x',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:273:3
   '1',
   '2',
   '3',
-  '4',
+  "",
   '5',
   '6',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:281:3
   '9',
   'escape',
   'enter',
-  'tab',
+  "",
   'space',
   'backspace',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:282:3
   'escape',
   'enter',
   'tab',
-  'space',
+  "",
   'backspace',
   'delete',

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:288:3
   'arrowup',
   'arrowdown',
   'arrowleft',
-  'arrowright',
+  "",
 ];
 

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:296:64
   onSaveSettings: _onSaveSettings,
 }: KeyboardShortcutsProps) {
   const [searchQuery, setSearchQuery] = useState('');
-  const [shortcuts, setShortcuts] = useState<Shortcut[]>(() => {
-    // Safe localStorage access with SSR check
-    if (typeof window !== 'undefined') {
-      const saved = localStorage.getItem('keyboard-shortcuts');
-      if (saved) {
-        try {
-          return JSON.parse(saved);
-        } catch {
-          return defaultShortcuts;
-        }
-      }
-    }
-    return defaultShortcuts;
-  });
+  const [shortcuts, setShortcuts] = useState<Shortcut[]>(() => {});
 
   useEffect(() => {

[NoCoverage] EqualityOperator
src/components/task/keyboard-shortcuts.tsx:298:9
   const [searchQuery, setSearchQuery] = useState('');
   const [shortcuts, setShortcuts] = useState<Shortcut[]>(() => {
     // Safe localStorage access with SSR check
-    if (typeof window !== 'undefined') {
+    if (typeof window === 'undefined') {
       const saved = localStorage.getItem('keyboard-shortcuts');
       if (saved) {

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:298:9
   const [searchQuery, setSearchQuery] = useState('');
   const [shortcuts, setShortcuts] = useState<Shortcut[]>(() => {
     // Safe localStorage access with SSR check
-    if (typeof window !== 'undefined') {
+    if (true) {
       const saved = localStorage.getItem('keyboard-shortcuts');
       if (saved) {

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:299:42
   const [shortcuts, setShortcuts] = useState<Shortcut[]>(() => {
     // Safe localStorage access with SSR check
     if (typeof window !== 'undefined') {
-      const saved = localStorage.getItem('keyboard-shortcuts');
+      const saved = localStorage.getItem("");
       if (saved) {
         try {

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:300:11
     // Safe localStorage access with SSR check
     if (typeof window !== 'undefined') {
       const saved = localStorage.getItem('keyboard-shortcuts');
-      if (saved) {
+      if (true) {
         try {
           return JSON.parse(saved);

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:300:11
     // Safe localStorage access with SSR check
     if (typeof window !== 'undefined') {
       const saved = localStorage.getItem('keyboard-shortcuts');
-      if (saved) {
+      if (false) {
         try {
           return JSON.parse(saved);

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:301:13
     if (typeof window !== 'undefined') {
       const saved = localStorage.getItem('keyboard-shortcuts');
       if (saved) {
-        try {
-          return JSON.parse(saved);
-        } catch {
+        try {} catch {
           return defaultShortcuts;
         }

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:303:17
       if (saved) {
         try {
           return JSON.parse(saved);
-        } catch {
-          return defaultShortcuts;
-        }
+        } catch {}
       }
     }

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:311:19
     return defaultShortcuts;
   });
 
-  useEffect(() => {
-    if (typeof window !== 'undefined') {
-      localStorage.setItem('keyboard-shortcuts', JSON.stringify(shortcuts));
-    }
-  }, [shortcuts]);
+  useEffect(() => {}, [shortcuts]);
 
   const handleSaveShortcut = (id: string, updates: Partial<Shortcut>) => {

[NoCoverage] EqualityOperator
src/components/task/keyboard-shortcuts.tsx:312:9
   });
 
   useEffect(() => {
-    if (typeof window !== 'undefined') {
+    if (typeof window === 'undefined') {
       localStorage.setItem('keyboard-shortcuts', JSON.stringify(shortcuts));
     }

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:312:9
   });
 
   useEffect(() => {
-    if (typeof window !== 'undefined') {
+    if (true) {
       localStorage.setItem('keyboard-shortcuts', JSON.stringify(shortcuts));
     }

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:313:28
 
   useEffect(() => {
     if (typeof window !== 'undefined') {
-      localStorage.setItem('keyboard-shortcuts', JSON.stringify(shortcuts));
+      localStorage.setItem("", JSON.stringify(shortcuts));
     }
   }, [shortcuts]);

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:317:74
     }
   }, [shortcuts]);
 
-  const handleSaveShortcut = (id: string, updates: Partial<Shortcut>) => {
-    setShortcuts(prev =>
-      prev.map(s => (s.id === id ? { ...s, ...updates } : s))
-    );
-  };
+  const handleSaveShortcut = (id: string, updates: Partial<Shortcut>) => {};
 
   const handleReset = () => {

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:318:18
   }, [shortcuts]);
 
   const handleSaveShortcut = (id: string, updates: Partial<Shortcut>) => {
-    setShortcuts(prev =>
-      prev.map(s => (s.id === id ? { ...s, ...updates } : s))
+    setShortcuts(() => undefined
     );
   };

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:319:22
 
   const handleSaveShortcut = (id: string, updates: Partial<Shortcut>) => {
     setShortcuts(prev =>
-      prev.map(s => (s.id === id ? { ...s, ...updates } : s))
+      prev.map(s => (true ? { ...s, ...updates } : s))
     );
   };

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:319:16
 
   const handleSaveShortcut = (id: string, updates: Partial<Shortcut>) => {
     setShortcuts(prev =>
-      prev.map(s => (s.id === id ? { ...s, ...updates } : s))
+      prev.map(() => undefined)
     );
   };

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:323:29
     );
   };
 
-  const handleReset = () => {
-    setShortcuts(defaultShortcuts);
-    localStorage.removeItem('keyboard-shortcuts');
-  };
+  const handleReset = () => {};
 
   const filteredShortcuts = shortcuts.filter(

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:325:29
 
   const handleReset = () => {
     setShortcuts(defaultShortcuts);
-    localStorage.removeItem('keyboard-shortcuts');
+    localStorage.removeItem("");
   };
 

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:328:29
     localStorage.removeItem('keyboard-shortcuts');
   };
 
-  const filteredShortcuts = shortcuts.filter(
-    s =>
-      s.enabled &&
-      (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.description.toLowerCase().includes(searchQuery.toLowerCase()))
-  );
+  const filteredShortcuts = shortcuts;
 
   const groupedShortcuts = {

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:329:5
   };
 
   const filteredShortcuts = shortcuts.filter(
-    s =>
-      s.enabled &&
-      (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.description.toLowerCase().includes(searchQuery.toLowerCase()))
+    () => undefined
   );
 

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:330:7
 
   const filteredShortcuts = shortcuts.filter(
     s =>
-      s.enabled &&
-      (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.description.toLowerCase().includes(searchQuery.toLowerCase()))
+      true
   );
 

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:330:7
 
   const filteredShortcuts = shortcuts.filter(
     s =>
-      s.enabled &&
-      (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.description.toLowerCase().includes(searchQuery.toLowerCase()))
+      false
   );
 

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:331:37
   const filteredShortcuts = shortcuts.filter(
     s =>
       s.enabled &&
-      (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
+      (s.key.toLowerCase().includes(searchQuery.toUpperCase()) ||
         s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
         s.description.toLowerCase().includes(searchQuery.toLowerCase()))

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:331:8
   const filteredShortcuts = shortcuts.filter(
     s =>
       s.enabled &&
-      (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.description.toLowerCase().includes(searchQuery.toLowerCase()))
+      (true)
   );
 

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:332:40
     s =>
       s.enabled &&
       (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
+        s.label.toLowerCase().includes(searchQuery.toUpperCase()) ||
         s.description.toLowerCase().includes(searchQuery.toLowerCase()))
   );

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:332:9
     s =>
       s.enabled &&
       (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
+        s.label.toUpperCase().includes(searchQuery.toLowerCase()) ||
         s.description.toLowerCase().includes(searchQuery.toLowerCase()))
   );

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:333:9
       s.enabled &&
       (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
         s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.description.toLowerCase().includes(searchQuery.toLowerCase()))
+        s.description.toUpperCase().includes(searchQuery.toLowerCase()))
   );
 

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:333:46
       s.enabled &&
       (s.key.toLowerCase().includes(searchQuery.toLowerCase()) ||
         s.label.toLowerCase().includes(searchQuery.toLowerCase()) ||
-        s.description.toLowerCase().includes(searchQuery.toLowerCase()))
+        s.description.toLowerCase().includes(searchQuery.toUpperCase()))
   );
 

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:336:28
         s.description.toLowerCase().includes(searchQuery.toLowerCase()))
   );
 
-  const groupedShortcuts = {
-    navigation: filteredShortcuts.filter(s => s.category === 'navigation'),
-    tasks: filteredShortcuts.filter(s => s.category === 'tasks'),
-    search: filteredShortcuts.filter(s => s.category === 'search'),
-  };
+  const groupedShortcuts = {};
 
   const formatKey = (shortcut: Shortcut) => {

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:337:17
   );
 
   const groupedShortcuts = {
-    navigation: filteredShortcuts.filter(s => s.category === 'navigation'),
+    navigation: filteredShortcuts,
     tasks: filteredShortcuts.filter(s => s.category === 'tasks'),
     search: filteredShortcuts.filter(s => s.category === 'search'),

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:337:42
   );
 
   const groupedShortcuts = {
-    navigation: filteredShortcuts.filter(s => s.category === 'navigation'),
+    navigation: filteredShortcuts.filter(() => undefined),
     tasks: filteredShortcuts.filter(s => s.category === 'tasks'),
     search: filteredShortcuts.filter(s => s.category === 'search'),

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:338:37
 
   const groupedShortcuts = {
     navigation: filteredShortcuts.filter(s => s.category === 'navigation'),
-    tasks: filteredShortcuts.filter(s => s.category === 'tasks'),
+    tasks: filteredShortcuts.filter(() => undefined),
     search: filteredShortcuts.filter(s => s.category === 'search'),
   };

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:338:12
 
   const groupedShortcuts = {
     navigation: filteredShortcuts.filter(s => s.category === 'navigation'),
-    tasks: filteredShortcuts.filter(s => s.category === 'tasks'),
+    tasks: filteredShortcuts,
     search: filteredShortcuts.filter(s => s.category === 'search'),
   };

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:339:43
   const groupedShortcuts = {
     navigation: filteredShortcuts.filter(s => s.category === 'navigation'),
     tasks: filteredShortcuts.filter(s => s.category === 'tasks'),
-    search: filteredShortcuts.filter(s => s.category === 'search'),
+    search: filteredShortcuts.filter(s => true),
   };
 

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:339:13
   const groupedShortcuts = {
     navigation: filteredShortcuts.filter(s => s.category === 'navigation'),
     tasks: filteredShortcuts.filter(s => s.category === 'tasks'),
-    search: filteredShortcuts.filter(s => s.category === 'search'),
+    search: filteredShortcuts,
   };
 

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:342:45
     search: filteredShortcuts.filter(s => s.category === 'search'),
   };
 
-  const formatKey = (shortcut: Shortcut) => {
-    const parts: string[] = [];
-    if (shortcut.meta) parts.push('⌘');
-    if (shortcut.shift) parts.push('⇧');
-    parts.push(shortcut.key.toUpperCase());
-    return parts.join('+');
-  };
+  const formatKey = (shortcut: Shortcut) => {};
 
   return (

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:344:9
 
   const formatKey = (shortcut: Shortcut) => {
     const parts: string[] = [];
-    if (shortcut.meta) parts.push('⌘');
+    if (true) parts.push('⌘');
     if (shortcut.shift) parts.push('⇧');
     parts.push(shortcut.key.toUpperCase());

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:344:9
 
   const formatKey = (shortcut: Shortcut) => {
     const parts: string[] = [];
-    if (shortcut.meta) parts.push('⌘');
+    if (false) parts.push('⌘');
     if (shortcut.shift) parts.push('⇧');
     parts.push(shortcut.key.toUpperCase());

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:345:9
   const formatKey = (shortcut: Shortcut) => {
     const parts: string[] = [];
     if (shortcut.meta) parts.push('⌘');
-    if (shortcut.shift) parts.push('⇧');
+    if (true) parts.push('⇧');
     parts.push(shortcut.key.toUpperCase());
     return parts.join('+');

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:345:9
   const formatKey = (shortcut: Shortcut) => {
     const parts: string[] = [];
     if (shortcut.meta) parts.push('⌘');
-    if (shortcut.shift) parts.push('⇧');
+    if (false) parts.push('⇧');
     parts.push(shortcut.key.toUpperCase());
     return parts.join('+');

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:346:16
     const parts: string[] = [];
     if (shortcut.meta) parts.push('⌘');
     if (shortcut.shift) parts.push('⇧');
-    parts.push(shortcut.key.toUpperCase());
+    parts.push(shortcut.key.toLowerCase());
     return parts.join('+');
   };

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:375:27
                 placeholder="Search shortcuts..."
                 className="pl-9"
                 value={searchQuery}
-                onChange={e => setSearchQuery(e.target.value)}
+                onChange={() => undefined}
               />
               {searchQuery && (

[NoCoverage] LogicalOperator
src/components/task/keyboard-shortcuts.tsx:377:16
                 value={searchQuery}
                 onChange={e => setSearchQuery(e.target.value)}
               />
-              {searchQuery && (
-                <Button
-                  variant="ghost"
-                  size="sm"
-                  className="absolute right-1 top-1/2 -translate-y-1/2 h-6 w-6 p-0"
-                  onClick={() => setSearchQuery('')}
-                >
-                  <X className="h-3 w-3" />
-                </Button>
-              )}
+              {searchQuery || <Button variant="ghost" size="sm" className="absolute right-1 top-1/2 -translate-y-1/2 h-6 w-6 p-0" onClick={() => setSearchQuery('')}>
+                  <X className="h-3 w-3" />
+                </Button>}
             </div>
             <Button
