[Killed] BlockStatement
src/lib/actions/tasks.ts:212:53
   }
 }
 
-export async function getLabels(): Promise<Label[]> {
-  const db = getDb();
-  const user = await getCurrentUser();
-
-  // User isolation: only show labels owned by the user
-  if (user?.id) {
-    return db
-      .prepare('SELECT * FROM labels WHERE user_id = ? ORDER BY name ASC')
-      .all(user.id) as Label[];
-  }
-
-  // In test/demo mode, return all labels
-  if (
-    process.env.NODE_ENV === 'test' ||
-    process.env.NEXTAUTH_SECRET === 'demo-secret'
-  ) {
-    return db
-      .prepare('SELECT * FROM labels ORDER BY name ASC')
-      .all() as Label[];
-  }
-
-  return [];
-}
+export async function getLabels(): Promise<Label[]> {}
 
 export async function getLabelById(id: number): Promise<Label | undefined> {
killedBy: Task Actions - Comprehensive Tests Label Operations getLabels should return empty array when no labels
statusReason: expected undefined to deeply equal []

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:217:7
   const user = await getCurrentUser();
 
   // User isolation: only show labels owned by the user
-  if (user?.id) {
+  if (true) {
     return db
       .prepare('SELECT * FROM labels WHERE user_id = ? ORDER BY name ASC')

[Survived] BlockStatement
src/lib/actions/tasks.ts:217:17
   const user = await getCurrentUser();
 
   // User isolation: only show labels owned by the user
-  if (user?.id) {
-    return db
-      .prepare('SELECT * FROM labels WHERE user_id = ? ORDER BY name ASC')
-      .all(user.id) as Label[];
-  }
+  if (user?.id) {}
 
   // In test/demo mode, return all labels

[NoCoverage] EqualityOperator
src/lib/actions/tasks.ts:225:5
 
   // In test/demo mode, return all labels
   if (
-    process.env.NODE_ENV === 'test' ||
+    process.env.NODE_ENV !== 'test' ||
     process.env.NEXTAUTH_SECRET === 'demo-secret'
   ) {

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:225:5
 
   // In test/demo mode, return all labels
   if (
-    process.env.NODE_ENV === 'test' ||
-    process.env.NEXTAUTH_SECRET === 'demo-secret'
+    process.env.NODE_ENV === 'test' && process.env.NEXTAUTH_SECRET === 'demo-secret'
   ) {
     return db

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:227:5
   if (
     process.env.NODE_ENV === 'test' ||
     process.env.NEXTAUTH_SECRET === 'demo-secret'
-  ) {
-    return db
-      .prepare('SELECT * FROM labels ORDER BY name ASC')
-      .all() as Label[];
-  }
+  ) {}
 
   return [];

[Killed] BlockStatement
src/lib/actions/tasks.ts:236:76
   return [];
 }
 
-export async function getLabelById(id: number): Promise<Label | undefined> {
-  const db = getDb();
-  const user = await getCurrentUser();
-
-  // User isolation: only show labels owned by the user
-  if (user?.id) {
-    return db
-      .prepare('SELECT * FROM labels WHERE id = ? AND user_id = ?')
-      .get(id, user.id) as Label | undefined;
-  }
-
-  // In test/demo mode, allow access to any label
-  if (
-    process.env.NODE_ENV === 'test' ||
-    process.env.NEXTAUTH_SECRET === 'demo-secret'
-  ) {
-    return db.prepare('SELECT * FROM labels WHERE id = ?').get(id) as
-      Label | undefined;
-  }
-
-  return undefined;
-}
+export async function getLabelById(id: number): Promise<Label | undefined> {}
 
 export async function createLabel(input: CreateLabelInput): Promise<Label> {
killedBy: Task Actions - Comprehensive Tests Label Operations getLabels should return all labels ordered by name
statusReason: Failed to create label

[Survived] OptionalChaining
src/lib/actions/tasks.ts:241:7
   const user = await getCurrentUser();
 
   // User isolation: only show labels owned by the user
-  if (user?.id) {
+  if (user.id) {
     return db
       .prepare('SELECT * FROM labels WHERE id = ? AND user_id = ?')

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:251:5
   if (
     process.env.NODE_ENV === 'test' ||
     process.env.NEXTAUTH_SECRET === 'demo-secret'
-  ) {
-    return db.prepare('SELECT * FROM labels WHERE id = ?').get(id) as
-      Label | undefined;
-  }
+  ) {}
 
   return undefined;

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:262:7
 export async function createLabel(input: CreateLabelInput): Promise<Label> {
   // Validate input
   const parsed = labelSchema.safeParse(input);
-  if (!parsed.success) {
+  if (parsed.success) {
     throw new Error(parsed.error.issues[0]?.message || 'Invalid label data');
   }
killedBy: Task Actions - Comprehensive Tests Label Operations getLabels should return all labels ordered by name
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:262:7
 export async function createLabel(input: CreateLabelInput): Promise<Label> {
   // Validate input
   const parsed = labelSchema.safeParse(input);
-  if (!parsed.success) {
+  if (true) {
     throw new Error(parsed.error.issues[0]?.message || 'Invalid label data');
   }
killedBy: Task Actions - Comprehensive Tests Label Operations getLabels should return all labels ordered by name
statusReason: Cannot read properties of undefined (reading 'issues')

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:263:21
   // Validate input
   const parsed = labelSchema.safeParse(input);
   if (!parsed.success) {
-    throw new Error(parsed.error.issues[0]?.message || 'Invalid label data');
+    throw new Error(true);
   }
 

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:263:21
   // Validate input
   const parsed = labelSchema.safeParse(input);
   if (!parsed.success) {
-    throw new Error(parsed.error.issues[0]?.message || 'Invalid label data');
+    throw new Error(parsed.error.issues[0]?.message && 'Invalid label data');
   }
 

[NoCoverage] EqualityOperator
src/lib/actions/tasks.ts:268:31
 
   const db = getDb();
   const user = await getCurrentUser();
-  const userId = user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
+  const userId = user?.id ?? (process.env.NODE_ENV !== 'test' ? 1 : null);
 
   const result = db

[Killed] StringLiteral
src/lib/actions/tasks.ts:272:7
 
   const result = db
     .prepare(
-      'INSERT INTO labels (name, icon, color, user_id) VALUES (?, ?, ?, ?)'
+      ""
     )
     .run(
killedBy: Task Actions - Comprehensive Tests Label Operations getLabels should return all labels ordered by name
statusReason: Failed to create label

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:276:7
     )
     .run(
       parsed.data.name,
-      parsed.data.icon || '🏷️',
+      true
       parsed.data.color || '#8b5cf6',
       userId
killedBy: Task Actions - Comprehensive Tests Label Operations createLabel should create a label with default values
statusReason: expected true to be '🏷️' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:276:7
     )
     .run(
       parsed.data.name,
-      parsed.data.icon || '🏷️',
+      false
       parsed.data.color || '#8b5cf6',
       userId
killedBy: Task Actions - Comprehensive Tests Label Operations createLabel should create a label with default values
statusReason: expected false to be '🏷️' // Object.is equality

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:277:7
     .run(
       parsed.data.name,
       parsed.data.icon || '🏷️',
-      parsed.data.color || '#8b5cf6',
+      false,
       userId
     );

[Survived] LogicalOperator
src/lib/actions/tasks.ts:277:7
     .run(
       parsed.data.name,
       parsed.data.icon || '🏷️',
-      parsed.data.color || '#8b5cf6',
+      parsed.data.color && '#8b5cf6',
       userId
     );

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:281:7
       userId
     );
   const label = await getLabelById(Number(result.lastInsertRowid));
-  if (!label) {
+  if (label) {
     throw new Error('Failed to create label');
   }
killedBy: Task Actions - Comprehensive Tests Label Operations getLabels should return all labels ordered by name
statusReason: Failed to create label

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:281:7
       userId
     );
   const label = await getLabelById(Number(result.lastInsertRowid));
-  if (!label) {
+  if (true) {
     throw new Error('Failed to create label');
   }
killedBy: Task Actions - Comprehensive Tests Label Operations getLabels should return all labels ordered by name
statusReason: Failed to create label

[Killed] BlockStatement
src/lib/actions/tasks.ts:287:62
   return label;
 }
 
-export async function deleteLabel(id: number): Promise<void> {
-  const db = getDb();
-  const user = await getCurrentUser();
-
-  // In test mode or when user has access, allow deletion
-  if (user?.id || process.env.NODE_ENV === 'test') {
-    db.prepare('DELETE FROM task_labels WHERE label_id = ?').run(id);
-    db.prepare('DELETE FROM labels WHERE id = ?').run(id);
-  } else {
-    throw new Error('Authentication required');
-  }
-}
+export async function deleteLabel(id: number): Promise<void> {}
 
 // Note: These helper functions are kept for potential future use but are currently
killedBy: Task Actions - Comprehensive Tests Label Operations deleteLabel should delete a label
statusReason: expected { id: 1, name: 'Work', …(3) } to be undefined

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:292:7
   const user = await getCurrentUser();
 
   // In test mode or when user has access, allow deletion
-  if (user?.id || process.env.NODE_ENV === 'test') {
+  if (false) {
     db.prepare('DELETE FROM task_labels WHERE label_id = ?').run(id);
     db.prepare('DELETE FROM labels WHERE id = ?').run(id);
killedBy: Task Actions - Comprehensive Tests Label Operations deleteLabel should delete a label
statusReason: Authentication required

[Killed] BlockStatement
src/lib/actions/tasks.ts:292:52
   const user = await getCurrentUser();
 
   // In test mode or when user has access, allow deletion
-  if (user?.id || process.env.NODE_ENV === 'test') {
-    db.prepare('DELETE FROM task_labels WHERE label_id = ?').run(id);
-    db.prepare('DELETE FROM labels WHERE id = ?').run(id);
-  } else {
+  if (user?.id || process.env.NODE_ENV === 'test') {} else {
     throw new Error('Authentication required');
   }
killedBy: Task Actions - Comprehensive Tests Label Operations deleteLabel should delete a label
statusReason: expected { id: 1, name: 'Work', …(3) } to be undefined

[Killed] StringLiteral
src/lib/actions/tasks.ts:294:16
   // In test mode or when user has access, allow deletion
   if (user?.id || process.env.NODE_ENV === 'test') {
     db.prepare('DELETE FROM task_labels WHERE label_id = ?').run(id);
-    db.prepare('DELETE FROM labels WHERE id = ?').run(id);
+    db.prepare("").run(id);
   } else {
     throw new Error('Authentication required');
killedBy: Task Actions - Comprehensive Tests Label Operations deleteLabel should delete a label
statusReason: expected { id: 1, name: 'Work', …(3) } to be undefined

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:295:10
   if (user?.id || process.env.NODE_ENV === 'test') {
     db.prepare('DELETE FROM task_labels WHERE label_id = ?').run(id);
     db.prepare('DELETE FROM labels WHERE id = ?').run(id);
-  } else {
-    throw new Error('Authentication required');
-  }
+  } else {}
 }
 

[Killed] OptionalChaining
src/lib/actions/tasks.ts:311:16
   const user = await getCurrentUser();
 
   // User isolation: only allow access to user's own tasks
-  const task = user?.id
+  const task = user.id
     ? (db
         .prepare('SELECT * FROM tasks WHERE id = ? AND user_id = ?')
killedBy: Scheduling Actions suggestOptimalTimes suggests multiple optimal time slots
statusReason: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:315:7
     ? (db
         .prepare('SELECT * FROM tasks WHERE id = ? AND user_id = ?')
         .get(id, user.id) as Task | undefined)
-    : process.env.NODE_ENV === 'production'
+    : true
       ? undefined
       : (db.prepare('SELECT * FROM tasks WHERE id = ?').get(id) as
killedBy: Scheduling Actions suggestOptimalTimes suggests multiple optimal time slots
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/lib/actions/tasks.ts:315:7
     ? (db
         .prepare('SELECT * FROM tasks WHERE id = ? AND user_id = ?')
         .get(id, user.id) as Task | undefined)
-    : process.env.NODE_ENV === 'production'
+    : process.env.NODE_ENV !== 'production'
       ? undefined
       : (db.prepare('SELECT * FROM tasks WHERE id = ?').get(id) as
killedBy: Scheduling Actions suggestOptimalTimes suggests multiple optimal time slots
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:320:7
       : (db.prepare('SELECT * FROM tasks WHERE id = ?').get(id) as
           Task | undefined);
 
-  if (!task) return undefined;
+  if (true) return undefined;
 
   // Fetch relations using shared utility
killedBy: Scheduling Actions suggestOptimalTimes suggests multiple optimal time slots
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:320:7
       : (db.prepare('SELECT * FROM tasks WHERE id = ?').get(id) as
           Task | undefined);
 
-  if (!task) return undefined;
+  if (false) return undefined;
 
   // Fetch relations using shared utility
killedBy: Task Actions Tasks should delete a task
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:324:21
 
   // Fetch relations using shared utility
   const relationsMap = await getTaskRelations(db, [task.id]);
-  const relations = relationsMap[task.id] || {
-    labels: [],
-    subtasks: [],
-    reminders: [],
-    logs: [],
-    comments: [],
-    attachments: [],
-    blockers: [],
-    blocked_by: [],
-    assignee: undefined,
-    time_entries: [],
-    recurring_exceptions: [],
-  };
+  const relations = true;
 
   return {
killedBy: Task Actions - Comprehensive Tests Task Operations toggleSubtask should handle toggleSubtask without throwing
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:324:21
 
   // Fetch relations using shared utility
   const relationsMap = await getTaskRelations(db, [task.id]);
-  const relations = relationsMap[task.id] || {
-    labels: [],
-    subtasks: [],
-    reminders: [],
-    logs: [],
-    comments: [],
-    attachments: [],
-    blockers: [],
-    blocked_by: [],
-    assignee: undefined,
-    time_entries: [],
-    recurring_exceptions: [],
-  };
+  const relations = false;
 
   return {
killedBy: Task Actions - Comprehensive Tests Task Operations toggleSubtask should handle toggleSubtask without throwing
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:328:11
     labels: [],
     subtasks: [],
     reminders: [],
-    logs: [],
+    logs: ["Stryker was here"],
     comments: [],
     attachments: [],

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:330:18
     reminders: [],
     logs: [],
     comments: [],
-    attachments: [],
+    attachments: ["Stryker was here"],
     blockers: [],
     blocked_by: [],

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:332:17
     comments: [],
     attachments: [],
     blockers: [],
-    blocked_by: [],
+    blocked_by: ["Stryker was here"],
     assignee: undefined,
     time_entries: [],

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:334:19
     blockers: [],
     blocked_by: [],
     assignee: undefined,
-    time_entries: [],
+    time_entries: ["Stryker was here"],
     recurring_exceptions: [],
   };

[Killed] ObjectLiteral
src/lib/actions/tasks.ts:338:10
     recurring_exceptions: [],
   };
 
-  return {
-    ...task,
-    labels: relations.labels,
-    subtasks: relations.subtasks,
-    reminders: relations.reminders,
-    logs: relations.logs,
-    comments: relations.comments,
-    attachments: relations.attachments,
-    blockers: relations.blockers,
-    blocked_by: relations.blocked_by,
-    time_entries: relations.time_entries,
-    recurring_exceptions: relations.recurring_exceptions,
-  };
+  return {};
 }
 
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should create a task with minimal data
statusReason: expected undefined to be 'Test Task' // Object.is equality

[Survived] StringLiteral
src/lib/actions/tasks.ts:372:48
   const user = await getCurrentUser();
   const whereClauses: string[] = [];
   const params: unknown[] = [];
-  const today = new Date().toISOString().split('T')[0];
+  const today = new Date().toISOString().split("")[0];
 
   // Security: Only show tasks owned by authenticated user

[Killed] BlockStatement
src/lib/actions/tasks.ts:375:18
   const today = new Date().toISOString().split('T')[0];
 
   // Security: Only show tasks owned by authenticated user
-  if (!user?.id) {
-    return [];
-  }
+  if (!user?.id) {}
   whereClauses.push('user_id = ?');
   params.push(user.id);
killedBy: Export Actions exportData should export empty state with just inbox
statusReason: Cannot read properties of null (reading 'id')

[Killed] OptionalChaining
src/lib/actions/tasks.ts:375:8
   const today = new Date().toISOString().split('T')[0];
 
   // Security: Only show tasks owned by authenticated user
-  if (!user?.id) {
+  if (!user.id) {
     return [];
   }
killedBy: Export Actions exportData should export empty state with just inbox
statusReason: Cannot read properties of null (reading 'id')

[Killed] OptionalChaining
src/lib/actions/tasks.ts:382:8
   params.push(user.id);
 
   // Exclude archived tasks by default (show archived: true to include them)
-  if (!options?.showArchived) {
+  if (!options.showArchived) {
     whereClauses.push('archived = 0');
   }
killedBy: Task Actions - Comprehensive Tests Task Operations getTasks should return empty array when no tasks
statusReason: Cannot read properties of undefined (reading 'showArchived')

[Survived] BlockStatement
src/lib/actions/tasks.ts:382:31
   params.push(user.id);
 
   // Exclude archived tasks by default (show archived: true to include them)
-  if (!options?.showArchived) {
-    whereClauses.push('archived = 0');
-  }
+  if (!options?.showArchived) {}
 
   if (!options?.includeCompleted) {

[Killed] OptionalChaining
src/lib/actions/tasks.ts:386:8
     whereClauses.push('archived = 0');
   }
 
-  if (!options?.includeCompleted) {
+  if (!options.includeCompleted) {
     whereClauses.push('completed = 0');
   }
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: Cannot read properties of undefined (reading 'includeCompleted')

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:386:7
     whereClauses.push('archived = 0');
   }
 
-  if (!options?.includeCompleted) {
+  if (true) {
     whereClauses.push('completed = 0');
   }

[Survived] StringLiteral
src/lib/actions/tasks.ts:387:23
   }
 
   if (!options?.includeCompleted) {
-    whereClauses.push('completed = 0');
+    whereClauses.push("");
   }
 

[Killed] OptionalChaining
src/lib/actions/tasks.ts:390:7
     whereClauses.push('completed = 0');
   }
 
-  if (options?.listId !== undefined) {
+  if (options.listId !== undefined) {
     whereClauses.push('list_id = ?');
     params.push(options.listId);
killedBy: Task Actions - Comprehensive Tests Task Operations getTasks should return empty array when no tasks
statusReason: Cannot read properties of undefined (reading 'listId')

[Killed] EqualityOperator
src/lib/actions/tasks.ts:390:7
     whereClauses.push('completed = 0');
   }
 
-  if (options?.listId !== undefined) {
+  if (options?.listId === undefined) {
     whereClauses.push('list_id = ?');
     params.push(options.listId);
killedBy: Task Actions - Comprehensive Tests Task Operations getTasks should return empty array when no tasks
statusReason: Cannot read properties of undefined (reading 'listId')

[Killed] OptionalChaining
src/lib/actions/tasks.ts:395:11
     params.push(options.listId);
   }
 
-  switch (options?.view) {
+  switch (options.view) {
     case 'today':
       whereClauses.push('date = ?');
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: Cannot read properties of undefined (reading 'view')

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:396:5
   }
 
   switch (options?.view) {
-    case 'today':
-      whereClauses.push('date = ?');
-      params.push(today);
-      break;
+    case 'today':
     case 'next7': {
       const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:400:5
       whereClauses.push('date = ?');
       params.push(today);
       break;
-    case 'next7': {
-      const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
-        .toISOString()
-        .split('T')[0];
-      whereClauses.push('date >= ? AND date <= ?');
-      params.push(today, nextWeek);
-      break;
-    }
+    case 'next7':
     case 'upcoming':
       whereClauses.push('date >= ?');

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:400:19
       whereClauses.push('date = ?');
       params.push(today);
       break;
-    case 'next7': {
-      const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
-        .toISOString()
-        .split('T')[0];
-      whereClauses.push('date >= ? AND date <= ?');
-      params.push(today, nextWeek);
-      break;
-    }
+    case 'next7': {}
     case 'upcoming':
       whereClauses.push('date >= ?');

[NoCoverage] ArithmeticOperator
src/lib/actions/tasks.ts:401:46
       params.push(today);
       break;
     case 'next7': {
-      const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
+      const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 / 1000)
         .toISOString()
         .split('T')[0];

[NoCoverage] ArithmeticOperator
src/lib/actions/tasks.ts:401:46
       params.push(today);
       break;
     case 'next7': {
-      const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
+      const nextWeek = new Date(Date.now() + 7 * 24 / 60 * 60 * 1000)
         .toISOString()
         .split('T')[0];

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:408:5
       params.push(today, nextWeek);
       break;
     }
-    case 'upcoming':
-      whereClauses.push('date >= ?');
-      params.push(today);
-      break;
+    case 'upcoming':
     case 'blocked': {
       // Tasks that have dependencies pointing to them (are blocked)

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:412:21
       whereClauses.push('date >= ?');
       params.push(today);
       break;
-    case 'blocked': {
-      // Tasks that have dependencies pointing to them (are blocked)
-      whereClauses.push('id IN (SELECT task_id FROM task_dependencies)');
-      break;
-    }
+    case 'blocked': {}
     case 'all':
     default:

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:412:5
       whereClauses.push('date >= ?');
       params.push(today);
       break;
-    case 'blocked': {
-      // Tasks that have dependencies pointing to them (are blocked)
-      whereClauses.push('id IN (SELECT task_id FROM task_dependencies)');
-      break;
-    }
+    case 'blocked':
     case 'all':
     default:

[Survived] StringLiteral
src/lib/actions/tasks.ts:417:10
       whereClauses.push('id IN (SELECT task_id FROM task_dependencies)');
       break;
     }
-    case 'all':
+    case "":
     default:
       break;

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:418:5
       break;
     }
     case 'all':
-    default:
-      break;
+    default:
   }
 

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:423:7
   }
 
   // Handle filter presets
-  if (options?.filterPreset) {
+  if (true) {
     switch (options.filterPreset) {
       case 'needs_attention':
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: Cannot read properties of undefined (reading 'filterPreset')

[Killed] OptionalChaining
src/lib/actions/tasks.ts:423:7
   }
 
   // Handle filter presets
-  if (options?.filterPreset) {
+  if (options.filterPreset) {
     switch (options.filterPreset) {
       case 'needs_attention':
killedBy: Task Actions - Comprehensive Tests Task Operations getTasks should return empty array when no tasks
statusReason: Cannot read properties of undefined (reading 'filterPreset')

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:425:7
   // Handle filter presets
   if (options?.filterPreset) {
     switch (options.filterPreset) {
-      case 'needs_attention':
-        // High priority tasks due today or overdue
-        whereClauses.push(
-          "(priority = 'high' AND (date = ? OR (date < ? AND completed = 0)))"
-        );
-        params.push(today, today);
-        break;
+      case 'needs_attention':
       case 'this_week':
         const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:432:7
         );
         params.push(today, today);
         break;
-      case 'this_week':
-        const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
-          .toISOString()
-          .split('T')[0];
-        whereClauses.push('date >= ? AND date <= ?');
-        params.push(today, nextWeek);
-        break;
+      case 'this_week':
       case 'with_labels':
         whereClauses.push('id IN (SELECT DISTINCT task_id FROM task_labels)');

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:432:12
         );
         params.push(today, today);
         break;
-      case 'this_week':
+      case "":
         const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
           .toISOString()

[NoCoverage] ArithmeticOperator
src/lib/actions/tasks.ts:433:48
         params.push(today, today);
         break;
       case 'this_week':
-        const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
+        const nextWeek = new Date(Date.now() + 7 * 24 * 60 / 60 * 1000)
           .toISOString()
           .split('T')[0];

[NoCoverage] ArithmeticOperator
src/lib/actions/tasks.ts:433:48
         params.push(today, today);
         break;
       case 'this_week':
-        const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
+        const nextWeek = new Date(Date.now() + 7 * 24 * 60 * 60 / 1000)
           .toISOString()
           .split('T')[0];

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:439:7
         whereClauses.push('date >= ? AND date <= ?');
         params.push(today, nextWeek);
         break;
-      case 'with_labels':
-        whereClauses.push('id IN (SELECT DISTINCT task_id FROM task_labels)');
-        break;
+      case 'with_labels':
       case 'with_subtasks':
         whereClauses.push('id IN (SELECT DISTINCT task_id FROM subtasks)');

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:442:7
       case 'with_labels':
         whereClauses.push('id IN (SELECT DISTINCT task_id FROM task_labels)');
         break;
-      case 'with_subtasks':
-        whereClauses.push('id IN (SELECT DISTINCT task_id FROM subtasks)');
-        break;
+      case 'with_subtasks':
       case 'completed':
         whereClauses.push('completed = 1');

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:445:7
       case 'with_subtasks':
         whereClauses.push('id IN (SELECT DISTINCT task_id FROM subtasks)');
         break;
-      case 'completed':
-        whereClauses.push('completed = 1');
-        break;
+      case 'completed':
     }
   }

[Survived] EqualityOperator
src/lib/actions/tasks.ts:452:5
   }
 
   const where =
-    whereClauses.length > 0 ? `WHERE ${whereClauses.join(' AND ')}` : '';
+    whereClauses.length >= 0 ? `WHERE ${whereClauses.join(' AND ')}` : '';
   const orderBy =
     options?.view === 'all'

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:452:5
   }
 
   const where =
-    whereClauses.length > 0 ? `WHERE ${whereClauses.join(' AND ')}` : '';
+    true ? `WHERE ${whereClauses.join(' AND ')}` : '';
   const orderBy =
     options?.view === 'all'

[Killed] OptionalChaining
src/lib/actions/tasks.ts:454:5
   const where =
     whereClauses.length > 0 ? `WHERE ${whereClauses.join(' AND ')}` : '';
   const orderBy =
-    options?.view === 'all'
+    options.view === 'all'
       ? 'updated_at DESC, sort_order ASC'
       : 'sort_order ASC, date ASC, deadline ASC, priority DESC';
killedBy: Task Actions - Comprehensive Tests Task Operations getTasks should return empty array when no tasks
statusReason: Cannot read properties of undefined (reading 'view')

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:454:5
   const where =
     whereClauses.length > 0 ? `WHERE ${whereClauses.join(' AND ')}` : '';
   const orderBy =
-    options?.view === 'all'
+    false
       ? 'updated_at DESC, sort_order ASC'
       : 'sort_order ASC, date ASC, deadline ASC, priority DESC';

[Killed] OptionalChaining
src/lib/actions/tasks.ts:462:26
   const safeOrderBy = orderBy; // Already validated as hardcoded strings above
 
   // Default limit to prevent excessive data loads
-  const limit = Math.min(options?.limit || 100, 100);
+  const limit = Math.min(options.limit || 100, 100);
   const offset = options?.offset || 0;
 
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: Cannot read properties of undefined (reading 'limit')

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:462:26
   const safeOrderBy = orderBy; // Already validated as hardcoded strings above
 
   // Default limit to prevent excessive data loads
-  const limit = Math.min(options?.limit || 100, 100);
+  const limit = Math.min(false, 100);
   const offset = options?.offset || 0;
 
