[Killed] OptionalChaining
src/lib/actions/tasks.ts:463:18
 
   // Default limit to prevent excessive data loads
   const limit = Math.min(options?.limit || 100, 100);
-  const offset = options?.offset || 0;
+  const offset = options.offset || 0;
 
   const tasks = db
killedBy: Task Actions - Comprehensive Tests Task Operations getTasks should return empty array when no tasks
statusReason: Cannot read properties of undefined (reading 'offset')

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:463:18
 
   // Default limit to prevent excessive data loads
   const limit = Math.min(options?.limit || 100, 100);
-  const offset = options?.offset || 0;
+  const offset = true;
 
   const tasks = db

[Survived] ArrowFunction
src/lib/actions/tasks.ts:470:29
       `SELECT * FROM tasks ${where} ORDER BY ${safeOrderBy} LIMIT ? OFFSET ?`
     )
     .all(...params, limit, offset) as Task[];
-  const taskIds = tasks.map(t => t.id);
+  const taskIds = tasks.map(() => undefined);
 
   // Batch fetch all relations using shared utility

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:480:27
     number,
     { total: number; count: number; score: number }
   > = {};
-  if (taskIds.length > 0) {
-    const placeholder = taskIds.map(() => '?').join(',');
-    const votes = db
-      .prepare(
-        `SELECT task_id, SUM(value) as total, COUNT(*) as count,
-              CASE WHEN COUNT(*) > 0 THEN SUM(value) * 1.0 / COUNT(*) ELSE 0 END as score
-       FROM task_votes WHERE task_id IN (${placeholder})
-       GROUP BY task_id`
-      )
-      .all(...taskIds) as Array<{
-      task_id: number;
-      total: number;
-      count: number;
-      score: number;
-    }>;
-
-    for (const vote of votes) {
-      voteScores[vote.task_id] = {
-        total: vote.total || 0,
-        count: vote.count || 0,
-        score: vote.score || 0,
-      };
-    }
-  }
+  if (taskIds.length > 0) {}
 
   const result: TaskWithRelations[] = tasks.map(task => {

[Survived] EqualityOperator
src/lib/actions/tasks.ts:480:7
     number,
     { total: number; count: number; score: number }
   > = {};
-  if (taskIds.length > 0) {
+  if (taskIds.length <= 0) {
     const placeholder = taskIds.map(() => '?').join(',');
     const votes = db

[NoCoverage] ArrowFunction
src/lib/actions/tasks.ts:481:37
     { total: number; count: number; score: number }
   > = {};
   if (taskIds.length > 0) {
-    const placeholder = taskIds.map(() => '?').join(',');
+    const placeholder = taskIds.map(() => undefined).join(',');
     const votes = db
       .prepare(

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:496:31
       score: number;
     }>;
 
-    for (const vote of votes) {
-      voteScores[vote.task_id] = {
-        total: vote.total || 0,
-        count: vote.count || 0,
-        score: vote.score || 0,
-      };
-    }
+    for (const vote of votes) {}
   }
 

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:498:16
 
     for (const vote of votes) {
       voteScores[vote.task_id] = {
-        total: vote.total || 0,
+        total: true,
         count: vote.count || 0,
         score: vote.score || 0,

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:498:16
 
     for (const vote of votes) {
       voteScores[vote.task_id] = {
-        total: vote.total || 0,
+        total: false,
         count: vote.count || 0,
         score: vote.score || 0,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:499:16
     for (const vote of votes) {
       voteScores[vote.task_id] = {
         total: vote.total || 0,
-        count: vote.count || 0,
+        count: vote.count && 0,
         score: vote.score || 0,
       };

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:499:16
     for (const vote of votes) {
       voteScores[vote.task_id] = {
         total: vote.total || 0,
-        count: vote.count || 0,
+        count: true,
         score: vote.score || 0,
       };

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:500:16
       voteScores[vote.task_id] = {
         total: vote.total || 0,
         count: vote.count || 0,
-        score: vote.score || 0,
+        score: vote.score && 0,
       };
     }

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:500:16
       voteScores[vote.task_id] = {
         total: vote.total || 0,
         count: vote.count || 0,
-        score: vote.score || 0,
+        score: true,
       };
     }

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:506:23
   }
 
   const result: TaskWithRelations[] = tasks.map(task => {
-    const relations = relationsMap[task.id] || {
-      labels: [],
-      subtasks: [],
-      reminders: [],
-      logs: [],
-      comments: [],
-      attachments: [],
-      blockers: [],
-      blocked_by: [],
-      assignee: undefined,
-      time_entries: [],
-      recurring_exceptions: [],
-    };
+    const relations = true;
 
     const voteData = voteScores[task.id] || { total: 0, count: 0, score: 0 };

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:506:23
   }
 
   const result: TaskWithRelations[] = tasks.map(task => {
-    const relations = relationsMap[task.id] || {
-      labels: [],
-      subtasks: [],
-      reminders: [],
-      logs: [],
-      comments: [],
-      attachments: [],
-      blockers: [],
-      blocked_by: [],
-      assignee: undefined,
-      time_entries: [],
-      recurring_exceptions: [],
-    };
+    const relations = relationsMap[task.id] && {
+  labels: [],
+  subtasks: [],
+  reminders: [],
+  logs: [],
+  comments: [],
+  attachments: [],
+  blockers: [],
+  blocked_by: [],
+  assignee: undefined,
+  time_entries: [],
+  recurring_exceptions: []
+};
 
     const voteData = voteScores[task.id] || { total: 0, count: 0, score: 0 };

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:511:17
       subtasks: [],
       reminders: [],
       logs: [],
-      comments: [],
+      comments: ["Stryker was here"],
       attachments: [],
       blockers: [],

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:513:17
       logs: [],
       comments: [],
       attachments: [],
-      blockers: [],
+      blockers: ["Stryker was here"],
       blocked_by: [],
       assignee: undefined,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:520:22
       recurring_exceptions: [],
     };
 
-    const voteData = voteScores[task.id] || { total: 0, count: 0, score: 0 };
+    const voteData = voteScores[task.id] && {
+  total: 0,
+  count: 0,
+  score: 0
+};
 
     return {

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:520:22
       recurring_exceptions: [],
     };
 
-    const voteData = voteScores[task.id] || { total: 0, count: 0, score: 0 };
+    const voteData = true;
 
     return {

[NoCoverage] ObjectLiteral
src/lib/actions/tasks.ts:522:12
 
     const voteData = voteScores[task.id] || { total: 0, count: 0, score: 0 };
 
-    return {
-      ...task,
-      labels: relations.labels,
-      subtasks: relations.subtasks,
-      reminders: relations.reminders,
-      logs: relations.logs,
-      comments: relations.comments,
-      attachments: relations.attachments,
-      blockers: relations.blockers,
-      blocked_by: relations.blocked_by,
-      time_entries: relations.time_entries,
-      recurring_exceptions: relations.recurring_exceptions,
-      vote_score: voteData.score,
-      vote_count: voteData.count,
-    };
+    return {};
   });
 

[Killed] OptionalChaining
src/lib/actions/tasks.ts:539:7
     };
   });
 
-  if (options?.searchQuery) {
+  if (options.searchQuery) {
     const Fuse = (await import('fuse.js')).default;
     const fuse = new Fuse(result, {
killedBy: Task Actions - Comprehensive Tests Task Operations getTasks should return empty array when no tasks
statusReason: Cannot read properties of undefined (reading 'searchQuery')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:539:7
     };
   });
 
-  if (options?.searchQuery) {
+  if (true) {
     const Fuse = (await import('fuse.js')).default;
     const fuse = new Fuse(result, {
killedBy: Task Actions Lists should delete a list and move tasks to inbox
statusReason: Cannot read properties of undefined (reading 'searchQuery')

[Survived] StringLiteral
src/lib/actions/tasks.ts:542:22
   if (options?.searchQuery) {
     const Fuse = (await import('fuse.js')).default;
     const fuse = new Fuse(result, {
-      keys: ['name', 'description'],
+      keys: ['name', ""],
       threshold: 0.4,
     });

[Survived] ArrayDeclaration
src/lib/actions/tasks.ts:542:13
   if (options?.searchQuery) {
     const Fuse = (await import('fuse.js')).default;
     const fuse = new Fuse(result, {
-      keys: ['name', 'description'],
+      keys: [],
       threshold: 0.4,
     });

[Survived] ArrowFunction
src/lib/actions/tasks.ts:545:49
       keys: ['name', 'description'],
       threshold: 0.4,
     });
-    return fuse.search(options.searchQuery).map(r => r.item);
+    return fuse.search(options.searchQuery).map(() => undefined);
   }
 

[Killed] LogicalOperator
src/lib/actions/tasks.ts:556:18
 ): Promise<TaskWithRelations> {
   const db = getDb();
   const user = await getCurrentUser();
-  const userId = user?.id ?? 0;
+  const userId = user?.id && 0;
 
   // Sanitize input to prevent XSS
killedBy: Task Actions - Archive/Recurring Functions generateRecurringTasks should generate daily recurring tasks
statusReason: Task not found

[Killed] OptionalChaining
src/lib/actions/tasks.ts:556:18
 ): Promise<TaskWithRelations> {
   const db = getDb();
   const user = await getCurrentUser();
-  const userId = user?.id ?? 0;
+  const userId = user.id ?? 0;
 
   // Sanitize input to prevent XSS
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: Cannot read properties of null (reading 'id')

[Killed] ObjectLiteral
src/lib/actions/tasks.ts:559:26
   const userId = user?.id ?? 0;
 
   // Sanitize input to prevent XSS
-  const sanitizedInput = {
-    ...input,
-    name: sanitizeString(input.name) ?? '',
-    description: sanitizeString(input.description),
-    notes: sanitizeString(input.notes),
-  };
+  const sanitizedInput = {};
 
   // Use transaction for atomic operation
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should create a task with minimal data
statusReason: expected undefined to be 'Test Task' // Object.is equality

[Killed] LogicalOperator
src/lib/actions/tasks.ts:561:11
   // Sanitize input to prevent XSS
   const sanitizedInput = {
     ...input,
-    name: sanitizeString(input.name) ?? '',
+    name: sanitizeString(input.name) && '',
     description: sanitizeString(input.description),
     notes: sanitizeString(input.notes),
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should create a task with minimal data
statusReason: expected '' to be 'Test Task' // Object.is equality

[Killed] EqualityOperator
src/lib/actions/tasks.ts:570:9
   const result = db.transaction(() => {
     // Determine sort_order: use provided value or auto-increment
     let sortOrder: number;
-    if (sanitizedInput.sort_order !== undefined) {
+    if (sanitizedInput.sort_order === undefined) {
       sortOrder = sanitizedInput.sort_order;
     } else {
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should assign sort order automatically
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:570:9
   const result = db.transaction(() => {
     // Determine sort_order: use provided value or auto-increment
     let sortOrder: number;
-    if (sanitizedInput.sort_order !== undefined) {
+    if (true) {
       sortOrder = sanitizedInput.sort_order;
     } else {
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should assign sort order automatically
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/actions/tasks.ts:572:12
     let sortOrder: number;
     if (sanitizedInput.sort_order !== undefined) {
       sortOrder = sanitizedInput.sort_order;
-    } else {
-      // Get max sort_order for the list or default to 0
-      const maxResult = sanitizedInput.list_id
-        ? (db
-            .prepare(
-              'SELECT MAX(sort_order) as max FROM tasks WHERE list_id = ? AND user_id = ?'
-            )
-            .get(sanitizedInput.list_id, userId) as { max: number })
-        : (db
-            .prepare(
-              'SELECT MAX(sort_order) as max FROM tasks WHERE user_id = ?'
-            )
-            .get(userId) as { max: number });
-      sortOrder = (maxResult?.max ?? -1) + 1;
-    }
+    } else {}
     const insertResult = db
       .prepare(
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should assign sort order automatically
statusReason: expected undefined to be defined

[Killed] OptionalChaining
src/lib/actions/tasks.ts:585:20
               'SELECT MAX(sort_order) as max FROM tasks WHERE user_id = ?'
             )
             .get(userId) as { max: number });
-      sortOrder = (maxResult?.max ?? -1) + 1;
+      sortOrder = (maxResult.max ?? -1) + 1;
     }
     const insertResult = db
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: Cannot read properties of undefined (reading 'max')

[Survived] LogicalOperator
src/lib/actions/tasks.ts:585:20
               'SELECT MAX(sort_order) as max FROM tasks WHERE user_id = ?'
             )
             .get(userId) as { max: number });
-      sortOrder = (maxResult?.max ?? -1) + 1;
+      sortOrder = (maxResult?.max && -1) + 1;
     }
     const insertResult = db

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:596:9
       .run(
         userId,
         sanitizedInput.name,
-        sanitizedInput.description || null,
+        true,
         sanitizedInput.list_id || 1,
         sanitizedInput.date || null,
killedBy: Task Actions - Comprehensive Tests Task Operations generateRecurringTasks edge cases should handle non-custom recurring without config
statusReason: clean.replace is not a function

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:596:9
       .run(
         userId,
         sanitizedInput.name,
-        sanitizedInput.description || null,
+        false,
         sanitizedInput.list_id || 1,
         sanitizedInput.date || null,

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:597:9
         userId,
         sanitizedInput.name,
         sanitizedInput.description || null,
-        sanitizedInput.list_id || 1,
+        false,
         sanitizedInput.date || null,
         sanitizedInput.deadline || null,

[Survived] LogicalOperator
src/lib/actions/tasks.ts:597:9
         userId,
         sanitizedInput.name,
         sanitizedInput.description || null,
-        sanitizedInput.list_id || 1,
+        sanitizedInput.list_id && 1,
         sanitizedInput.date || null,
         sanitizedInput.deadline || null,

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:598:9
         sanitizedInput.name,
         sanitizedInput.description || null,
         sanitizedInput.list_id || 1,
-        sanitizedInput.date || null,
+        true,
         sanitizedInput.deadline || null,
         sanitizedInput.estimate || null,
killedBy: Task Actions - Comprehensive Tests Task Operations getOverdueCount should count overdue tasks
statusReason: expected true to be '2026-09-11' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:598:9
         sanitizedInput.name,
         sanitizedInput.description || null,
         sanitizedInput.list_id || 1,
-        sanitizedInput.date || null,
+        false,
         sanitizedInput.deadline || null,
         sanitizedInput.estimate || null,
killedBy: Task Actions - Comprehensive Tests Task Operations getOverdueCount should count overdue tasks
statusReason: expected false to be '2026-09-11' // Object.is equality

[Survived] LogicalOperator
src/lib/actions/tasks.ts:599:9
         sanitizedInput.description || null,
         sanitizedInput.list_id || 1,
         sanitizedInput.date || null,
-        sanitizedInput.deadline || null,
+        sanitizedInput.deadline && null,
         sanitizedInput.estimate || null,
         sanitizedInput.actual_time || null,

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:599:9
         sanitizedInput.description || null,
         sanitizedInput.list_id || 1,
         sanitizedInput.date || null,
-        sanitizedInput.deadline || null,
+        false,
         sanitizedInput.estimate || null,
         sanitizedInput.actual_time || null,

[Survived] LogicalOperator
src/lib/actions/tasks.ts:600:9
         sanitizedInput.list_id || 1,
         sanitizedInput.date || null,
         sanitizedInput.deadline || null,
-        sanitizedInput.estimate || null,
+        sanitizedInput.estimate && null,
         sanitizedInput.actual_time || null,
         sanitizedInput.priority || 'none',

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:600:9
         sanitizedInput.list_id || 1,
         sanitizedInput.date || null,
         sanitizedInput.deadline || null,
-        sanitizedInput.estimate || null,
+        false,
         sanitizedInput.actual_time || null,
         sanitizedInput.priority || 'none',

[Survived] LogicalOperator
src/lib/actions/tasks.ts:601:9
         sanitizedInput.date || null,
         sanitizedInput.deadline || null,
         sanitizedInput.estimate || null,
-        sanitizedInput.actual_time || null,
+        sanitizedInput.actual_time && null,
         sanitizedInput.priority || 'none',
         sanitizedInput.recurring || 'none',

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:601:9
         sanitizedInput.date || null,
         sanitizedInput.deadline || null,
         sanitizedInput.estimate || null,
-        sanitizedInput.actual_time || null,
+        false,
         sanitizedInput.priority || 'none',
         sanitizedInput.recurring || 'none',

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:602:9
         sanitizedInput.deadline || null,
         sanitizedInput.estimate || null,
         sanitizedInput.actual_time || null,
-        sanitizedInput.priority || 'none',
+        false,
         sanitizedInput.recurring || 'none',
         sanitizedInput.recurring_config || null,
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should create a task with minimal data
statusReason: expected false to be 'none' // Object.is equality

[Killed] LogicalOperator
src/lib/actions/tasks.ts:602:9
         sanitizedInput.deadline || null,
         sanitizedInput.estimate || null,
         sanitizedInput.actual_time || null,
-        sanitizedInput.priority || 'none',
+        sanitizedInput.priority && 'none',
         sanitizedInput.recurring || 'none',
         sanitizedInput.recurring_config || null,
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should create a task with minimal data
statusReason: expected undefined to be 'none' // Object.is equality

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:603:9
         sanitizedInput.estimate || null,
         sanitizedInput.actual_time || null,
         sanitizedInput.priority || 'none',
-        sanitizedInput.recurring || 'none',
+        true,
         sanitizedInput.recurring_config || null,
         sortOrder,

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:603:9
         sanitizedInput.estimate || null,
         sanitizedInput.actual_time || null,
         sanitizedInput.priority || 'none',
-        sanitizedInput.recurring || 'none',
+        false,
         sanitizedInput.recurring_config || null,
         sortOrder,

[Survived] LogicalOperator
src/lib/actions/tasks.ts:604:9
         sanitizedInput.actual_time || null,
         sanitizedInput.priority || 'none',
         sanitizedInput.recurring || 'none',
-        sanitizedInput.recurring_config || null,
+        sanitizedInput.recurring_config && null,
         sortOrder,
         sanitizedInput.ai_provider || 'keyword-parser',

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:604:9
         sanitizedInput.actual_time || null,
         sanitizedInput.priority || 'none',
         sanitizedInput.recurring || 'none',
-        sanitizedInput.recurring_config || null,
+        false,
         sortOrder,
         sanitizedInput.ai_provider || 'keyword-parser',

[Survived] LogicalOperator
src/lib/actions/tasks.ts:606:9
         sanitizedInput.recurring || 'none',
         sanitizedInput.recurring_config || null,
         sortOrder,
-        sanitizedInput.ai_provider || 'keyword-parser',
+        sanitizedInput.ai_provider && 'keyword-parser',
         sanitizedInput.confidence_score ?? 0.5
       );

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:606:9
         sanitizedInput.recurring || 'none',
         sanitizedInput.recurring_config || null,
         sortOrder,
-        sanitizedInput.ai_provider || 'keyword-parser',
+        true,
         sanitizedInput.confidence_score ?? 0.5
       );

[Survived] LogicalOperator
src/lib/actions/tasks.ts:607:9
         sanitizedInput.recurring_config || null,
         sortOrder,
         sanitizedInput.ai_provider || 'keyword-parser',
-        sanitizedInput.confidence_score ?? 0.5
+        sanitizedInput.confidence_score && 0.5
       );
 

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:612:9
 
     const taskId = insertResult.lastInsertRowid as number;
 
-    if (sanitizedInput.label_ids?.length) {
+    if (true) {
       const stmt = db.prepare(
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: sanitizedInput.label_ids is not iterable

[Killed] OptionalChaining
src/lib/actions/tasks.ts:612:9
 
     const taskId = insertResult.lastInsertRowid as number;
 
-    if (sanitizedInput.label_ids?.length) {
+    if (sanitizedInput.label_ids.length) {
       const stmt = db.prepare(
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] BlockStatement
src/lib/actions/tasks.ts:616:55
       const stmt = db.prepare(
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'
       );
-      for (const labelId of sanitizedInput.label_ids) {
-        stmt.run(taskId, labelId);
-      }
+      for (const labelId of sanitizedInput.label_ids) {}
     }
 

[Killed] BlockStatement
src/lib/actions/tasks.ts:621:42
       }
     }
 
-    if (sanitizedInput.subtasks?.length) {
-      const stmt = db.prepare(
-        'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'
-      );
-      for (const name of sanitizedInput.subtasks) {
-        stmt.run(taskId, sanitizeString(name) ?? name);
-      }
-    }
+    if (sanitizedInput.subtasks?.length) {}
 
     if (sanitizedInput.reminders?.length) {
killedBy: Task Actions - Comprehensive Tests Templates saveTemplateFromTask should create template from task with subtasks
statusReason: expected [] to deeply equal [ 'Subtask 1', 'Subtask 2' ]

[Killed] OptionalChaining
src/lib/actions/tasks.ts:621:9
       }
     }
 
-    if (sanitizedInput.subtasks?.length) {
+    if (sanitizedInput.subtasks.length) {
       const stmt = db.prepare(
         'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'
killedBy: Task Actions - Comprehensive Tests List Operations deleteList should reassign tasks to inbox when list is deleted
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/lib/actions/tasks.ts:625:51
       const stmt = db.prepare(
         'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'
       );
-      for (const name of sanitizedInput.subtasks) {
-        stmt.run(taskId, sanitizeString(name) ?? name);
-      }
+      for (const name of sanitizedInput.subtasks) {}
     }
 
killedBy: Task Actions - Comprehensive Tests Templates saveTemplateFromTask should create template from task with subtasks
statusReason: expected [] to deeply equal [ 'Subtask 1', 'Subtask 2' ]

[Survived] LogicalOperator
src/lib/actions/tasks.ts:626:26
         'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'
       );
       for (const name of sanitizedInput.subtasks) {
-        stmt.run(taskId, sanitizeString(name) ?? name);
+        stmt.run(taskId, sanitizeString(name) && name);
       }
     }

[Killed] OptionalChaining
src/lib/actions/tasks.ts:630:9
       }
     }
 
-    if (sanitizedInput.reminders?.length) {
+    if (sanitizedInput.reminders.length) {
       const stmt = db.prepare(
         'INSERT INTO reminders (task_id, remind_at) VALUES (?, ?)'
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:630:9
       }
     }
 
-    if (sanitizedInput.reminders?.length) {
+    if (true) {
       const stmt = db.prepare(
         'INSERT INTO reminders (task_id, remind_at) VALUES (?, ?)'
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: sanitizedInput.reminders is not iterable

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:634:56
       const stmt = db.prepare(
         'INSERT INTO reminders (task_id, remind_at) VALUES (?, ?)'
       );
-      for (const remindAt of sanitizedInput.reminders) {
-        stmt.run(taskId, remindAt);
-      }
+      for (const remindAt of sanitizedInput.reminders) {}
     }
 

[Killed] OptionalChaining
src/lib/actions/tasks.ts:640:9
     }
 
     // Handle task dependencies (blockers)
-    if (sanitizedInput.blocker_ids?.length) {
+    if (sanitizedInput.blocker_ids.length) {
       const stmt = db.prepare(
         'INSERT INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:640:9
     }
 
     // Handle task dependencies (blockers)
-    if (sanitizedInput.blocker_ids?.length) {
+    if (true) {
       const stmt = db.prepare(
         'INSERT INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: sanitizedInput.blocker_ids is not iterable

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:644:64
       const stmt = db.prepare(
         'INSERT INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'
       );
-      for (const blockingTaskId of sanitizedInput.blocker_ids) {
-        stmt.run(taskId, blockingTaskId);
-      }
+      for (const blockingTaskId of sanitizedInput.blocker_ids) {}
     }
 

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:650:9
     }
 
     // Handle recurring exceptions (dates to skip)
-    if (sanitizedInput.recurring_exception_dates?.length) {
+    if (true) {
       const stmt = db.prepare(
         'INSERT INTO recurring_exceptions (task_id, exception_date) VALUES (?, ?)'
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: sanitizedInput.recurring_exception_dates is not iterable

[Killed] OptionalChaining
src/lib/actions/tasks.ts:650:9
     }
 
     // Handle recurring exceptions (dates to skip)
-    if (sanitizedInput.recurring_exception_dates?.length) {
+    if (sanitizedInput.recurring_exception_dates.length) {
       const stmt = db.prepare(
         'INSERT INTO recurring_exceptions (task_id, exception_date) VALUES (?, ?)'
killedBy: API Routes - Lists DELETE /api/lists should move tasks to inbox when list is deleted
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:654:77
       const stmt = db.prepare(
         'INSERT INTO recurring_exceptions (task_id, exception_date) VALUES (?, ?)'
       );
-      for (const exceptionDate of sanitizedInput.recurring_exception_dates) {
-        stmt.run(taskId, exceptionDate);
-      }
+      for (const exceptionDate of sanitizedInput.recurring_exception_dates) {}
     }
 

[Survived] StringLiteral
src/lib/actions/tasks.ts:659:27
       }
     }
 
-    logTaskAction(taskId, 'created', `Task "${input.name}" created`);
+    logTaskAction(taskId, "", `Task "${input.name}" created`);
 
     return taskId;

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:664:18
     return taskId;
   });
 
-  const taskId = typeof result === 'number' ? result : await result;
+  const taskId = true ? result : await result;
   const task = await getTaskById(taskId);
 

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:664:18
     return taskId;
   });
 
-  const taskId = typeof result === 'number' ? result : await result;
+  const taskId = false ? result : await result;
   const task = await getTaskById(taskId);
 

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:667:7
   const taskId = typeof result === 'number' ? result : await result;
   const task = await getTaskById(taskId);
 
-  if (task) {
+  if (false) {
     // Broadcast task creation for real-time updates
     await broadcastTaskUpdate(

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:667:7
   const taskId = typeof result === 'number' ? result : await result;
   const task = await getTaskById(taskId);
 
-  if (task) {
+  if (true) {
     // Broadcast task creation for real-time updates
     await broadcastTaskUpdate(
