[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:377:16
                 value={searchQuery}
                 onChange={e => setSearchQuery(e.target.value)}
               />
-              {searchQuery && (
-                <Button
-                  variant="ghost"
-                  size="sm"
-                  className="absolute right-1 top-1/2 -translate-y-1/2 h-6 w-6 p-0"
-                  onClick={() => setSearchQuery('')}
-                >
-                  <X className="h-3 w-3" />
-                </Button>
-              )}
+              {false}
             </div>
             <Button

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:382:28
                   variant="ghost"
                   size="sm"
                   className="absolute right-1 top-1/2 -translate-y-1/2 h-6 w-6 p-0"
-                  onClick={() => setSearchQuery('')}
+                  onClick={() => undefined}
                 >
                   <X className="h-3 w-3" />

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:402:42
           <div className="flex items-center gap-4 text-sm">
             <label className="flex items-center gap-2">
               <Switch
-                checked={shortcuts.every(s => s.enabled)}
+                checked={shortcuts.every(() => undefined)}
                 onCheckedChange={checked => {
                   setShortcuts(

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:402:26
           <div className="flex items-center gap-4 text-sm">
             <label className="flex items-center gap-2">
               <Switch
-                checked={shortcuts.every(s => s.enabled)}
+                checked={shortcuts.some(s => s.enabled)}
                 onCheckedChange={checked => {
                   setShortcuts(

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:403:45
             <label className="flex items-center gap-2">
               <Switch
                 checked={shortcuts.every(s => s.enabled)}
-                onCheckedChange={checked => {
-                  setShortcuts(
-                    shortcuts.map(s => ({ ...s, enabled: checked }))
-                  );
-                }}
+                onCheckedChange={checked => {}}
               />
               Enable all shortcuts

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:405:35
                 checked={shortcuts.every(s => s.enabled)}
                 onCheckedChange={checked => {
                   setShortcuts(
-                    shortcuts.map(s => ({ ...s, enabled: checked }))
+                    shortcuts.map(() => undefined)
                   );
                 }}

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:416:21
           <ScrollArea className="max-h-96">
             <div className="space-y-4">
               {Object.entries(groupedShortcuts).map(([category, items]) => {
-                if (items.length === 0) return null;
+                if (false) return null;
 
                 const categoryLabels: Record<

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:416:21
           <ScrollArea className="max-h-96">
             <div className="space-y-4">
               {Object.entries(groupedShortcuts).map(([category, items]) => {
-                if (items.length === 0) return null;
+                if (true) return null;
 
                 const categoryLabels: Record<

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:426:35
                     title: 'Navigation',
                     icon: <Shield className="h-4 w-4" />,
                   },
-                  tasks: { title: 'Tasks', icon: <Plus className="h-4 w-4" /> },
+                  tasks: { title: "", icon: <Plus className="h-4 w-4" /> },
                   search: {
                     title: 'Search',

[NoCoverage] OptionalChaining
src/components/task/keyboard-shortcuts.tsx:436:24
                 return (
                   <div key={category} className="space-y-2">
                     <h3 className="text-sm font-medium text-muted-foreground uppercase tracking-wider flex items-center gap-2">
-                      {categoryLabels[category]?.icon}
+                      {categoryLabels[category].icon}
                       {categoryLabels[category]?.title}
                     </h3>

[NoCoverage] OptionalChaining
src/components/task/keyboard-shortcuts.tsx:437:24
                   <div key={category} className="space-y-2">
                     <h3 className="text-sm font-medium text-muted-foreground uppercase tracking-wider flex items-center gap-2">
                       {categoryLabels[category]?.icon}
-                      {categoryLabels[category]?.title}
+                      {categoryLabels[category].title}
                     </h3>
                     <div className="space-y-1">

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:440:34
                       {categoryLabels[category]?.title}
                     </h3>
                     <div className="space-y-1">
-                      {items.map(shortcut => (
-                        <ShortcutItem
-                          key={shortcut.id}
-                          shortcut={shortcut}
-                          onSave={handleSaveShortcut}
-                          formatKey={formatKey}
-                        />
-                      ))}
+                      {items.map(() => undefined)}
                     </div>
                   </div>

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:471:46
 }
 
 function ShortcutItem({ shortcut, onSave, formatKey }: ShortcutItemProps) {
-  const [isEditing, setIsEditing] = useState(false);
+  const [isEditing, setIsEditing] = useState(true);
   const [editKey, setEditKey] = useState(shortcut.key ?? '');
   const [editMeta, setEditMeta] = useState(shortcut.meta ?? false);

[NoCoverage] LogicalOperator
src/components/task/keyboard-shortcuts.tsx:472:42
 
 function ShortcutItem({ shortcut, onSave, formatKey }: ShortcutItemProps) {
   const [isEditing, setIsEditing] = useState(false);
-  const [editKey, setEditKey] = useState(shortcut.key ?? '');
+  const [editKey, setEditKey] = useState(shortcut.key && '');
   const [editMeta, setEditMeta] = useState(shortcut.meta ?? false);
   const [editShift, setEditShift] = useState(shortcut.shift ?? false);

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:472:58
 
 function ShortcutItem({ shortcut, onSave, formatKey }: ShortcutItemProps) {
   const [isEditing, setIsEditing] = useState(false);
-  const [editKey, setEditKey] = useState(shortcut.key ?? '');
+  const [editKey, setEditKey] = useState(shortcut.key ?? "Stryker was here!");
   const [editMeta, setEditMeta] = useState(shortcut.meta ?? false);
   const [editShift, setEditShift] = useState(shortcut.shift ?? false);

[NoCoverage] LogicalOperator
src/components/task/keyboard-shortcuts.tsx:473:44
 function ShortcutItem({ shortcut, onSave, formatKey }: ShortcutItemProps) {
   const [isEditing, setIsEditing] = useState(false);
   const [editKey, setEditKey] = useState(shortcut.key ?? '');
-  const [editMeta, setEditMeta] = useState(shortcut.meta ?? false);
+  const [editMeta, setEditMeta] = useState(shortcut.meta && false);
   const [editShift, setEditShift] = useState(shortcut.shift ?? false);
 

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:473:61
 function ShortcutItem({ shortcut, onSave, formatKey }: ShortcutItemProps) {
   const [isEditing, setIsEditing] = useState(false);
   const [editKey, setEditKey] = useState(shortcut.key ?? '');
-  const [editMeta, setEditMeta] = useState(shortcut.meta ?? false);
+  const [editMeta, setEditMeta] = useState(shortcut.meta ?? true);
   const [editShift, setEditShift] = useState(shortcut.shift ?? false);
 

[NoCoverage] LogicalOperator
src/components/task/keyboard-shortcuts.tsx:474:46
   const [isEditing, setIsEditing] = useState(false);
   const [editKey, setEditKey] = useState(shortcut.key ?? '');
   const [editMeta, setEditMeta] = useState(shortcut.meta ?? false);
-  const [editShift, setEditShift] = useState(shortcut.shift ?? false);
+  const [editShift, setEditShift] = useState(shortcut.shift && false);
 
   const handleSave = () => {

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:474:64
   const [isEditing, setIsEditing] = useState(false);
   const [editKey, setEditKey] = useState(shortcut.key ?? '');
   const [editMeta, setEditMeta] = useState(shortcut.meta ?? false);
-  const [editShift, setEditShift] = useState(shortcut.shift ?? false);
+  const [editShift, setEditShift] = useState(shortcut.shift ?? true);
 
   const handleSave = () => {

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:476:28
   const [editMeta, setEditMeta] = useState(shortcut.meta ?? false);
   const [editShift, setEditShift] = useState(shortcut.shift ?? false);
 
-  const handleSave = () => {
-    // Check for conflicts
-    const conflictingShortcut = defaultShortcuts.find(
-      s =>
-        s.key === editKey &&
-        s.shift === editShift &&
-        s.meta === editMeta &&
-        s.id !== shortcut.id
-    );
-
-    if (conflictingShortcut) {
-      return; // Don't allow conflicts for now
-    }
-
-    onSave(shortcut.id, {
-      key: editKey,
-      meta: editMeta || undefined,
-      shift: editShift || undefined,
-      custom: true,
-    });
-    setIsEditing(false);
-  };
+  const handleSave = () => {};
 
   if (isEditing) {

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:479:7
   const handleSave = () => {
     // Check for conflicts
     const conflictingShortcut = defaultShortcuts.find(
-      s =>
-        s.key === editKey &&
-        s.shift === editShift &&
-        s.meta === editMeta &&
-        s.id !== shortcut.id
+      () => undefined
     );
 

[NoCoverage] LogicalOperator
src/components/task/keyboard-shortcuts.tsx:480:9
     // Check for conflicts
     const conflictingShortcut = defaultShortcuts.find(
       s =>
-        s.key === editKey &&
-        s.shift === editShift &&
-        s.meta === editMeta &&
+        s.key === editKey && s.shift === editShift || s.meta === editMeta &&
         s.id !== shortcut.id
     );

[NoCoverage] LogicalOperator
src/components/task/keyboard-shortcuts.tsx:480:9
     // Check for conflicts
     const conflictingShortcut = defaultShortcuts.find(
       s =>
-        s.key === editKey &&
-        s.shift === editShift &&
-        s.meta === editMeta &&
-        s.id !== shortcut.id
+        s.key === editKey && s.shift === editShift && s.meta === editMeta || s.id !== shortcut.id
     );
 

[NoCoverage] EqualityOperator
src/components/task/keyboard-shortcuts.tsx:481:9
     const conflictingShortcut = defaultShortcuts.find(
       s =>
         s.key === editKey &&
-        s.shift === editShift &&
+        s.shift !== editShift &&
         s.meta === editMeta &&
         s.id !== shortcut.id

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:481:9
     const conflictingShortcut = defaultShortcuts.find(
       s =>
         s.key === editKey &&
-        s.shift === editShift &&
+        true &&
         s.meta === editMeta &&
         s.id !== shortcut.id

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:482:9
       s =>
         s.key === editKey &&
         s.shift === editShift &&
-        s.meta === editMeta &&
+        true &&
         s.id !== shortcut.id
     );

[NoCoverage] EqualityOperator
src/components/task/keyboard-shortcuts.tsx:482:9
       s =>
         s.key === editKey &&
         s.shift === editShift &&
-        s.meta === editMeta &&
+        s.meta !== editMeta &&
         s.id !== shortcut.id
     );

[NoCoverage] EqualityOperator
src/components/task/keyboard-shortcuts.tsx:483:9
         s.key === editKey &&
         s.shift === editShift &&
         s.meta === editMeta &&
-        s.id !== shortcut.id
+        s.id === shortcut.id
     );
 

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:483:9
         s.key === editKey &&
         s.shift === editShift &&
         s.meta === editMeta &&
-        s.id !== shortcut.id
+        true
     );
 

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:486:9
         s.id !== shortcut.id
     );
 
-    if (conflictingShortcut) {
+    if (false) {
       return; // Don't allow conflicts for now
     }

[NoCoverage] BlockStatement
src/components/task/keyboard-shortcuts.tsx:486:30
         s.id !== shortcut.id
     );
 
-    if (conflictingShortcut) {
-      return; // Don't allow conflicts for now
-    }
+    if (conflictingShortcut) {}
 
     onSave(shortcut.id, {

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:492:13
 
     onSave(shortcut.id, {
       key: editKey,
-      meta: editMeta || undefined,
+      meta: false,
       shift: editShift || undefined,
       custom: true,

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:492:13
 
     onSave(shortcut.id, {
       key: editKey,
-      meta: editMeta || undefined,
+      meta: true,
       shift: editShift || undefined,
       custom: true,

[NoCoverage] LogicalOperator
src/components/task/keyboard-shortcuts.tsx:493:14
     onSave(shortcut.id, {
       key: editKey,
       meta: editMeta || undefined,
-      shift: editShift || undefined,
+      shift: editShift && undefined,
       custom: true,
     });

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:493:14
     onSave(shortcut.id, {
       key: editKey,
       meta: editMeta || undefined,
-      shift: editShift || undefined,
+      shift: false,
       custom: true,
     });

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:494:15
       key: editKey,
       meta: editMeta || undefined,
       shift: editShift || undefined,
-      custom: true,
+      custom: false,
     });
     setIsEditing(false);

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:496:18
       shift: editShift || undefined,
       custom: true,
     });
-    setIsEditing(false);
+    setIsEditing(true);
   };
 

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:499:7
     setIsEditing(false);
   };
 
-  if (isEditing) {
+  if (true) {
     return (
       <div className="flex items-center gap-2 px-2 py-1.5 rounded bg-accent/50">

[NoCoverage] ConditionalExpression
src/components/task/keyboard-shortcuts.tsx:499:7
     setIsEditing(false);
   };
 
-  if (isEditing) {
+  if (false) {
     return (
       <div className="flex items-center gap-2 px-2 py-1.5 rounded bg-accent/50">

[NoCoverage] LogicalOperator
src/components/task/keyboard-shortcuts.tsx:502:64
   if (isEditing) {
     return (
       <div className="flex items-center gap-2 px-2 py-1.5 rounded bg-accent/50">
-        <Select value={editKey} onValueChange={v => setEditKey(v ?? '')}>
+        <Select value={editKey} onValueChange={v => setEditKey(v && '')}>
           <SelectTrigger className="h-7 w-[120px]">
             <SelectValue />

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:502:48
   if (isEditing) {
     return (
       <div className="flex items-center gap-2 px-2 py-1.5 rounded bg-accent/50">
-        <Select value={editKey} onValueChange={v => setEditKey(v ?? '')}>
+        <Select value={editKey} onValueChange={() => undefined}>
           <SelectTrigger className="h-7 w-[120px]">
             <SelectValue />

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:507:32
             <SelectValue />
           </SelectTrigger>
           <SelectContent>
-            {availableKeys.map(key => (
-              <SelectItem key={key} value={key}>
-                {key.toUpperCase()}
-              </SelectItem>
-            ))}
+            {availableKeys.map(() => undefined)}
           </SelectContent>
         </Select>

[NoCoverage] MethodExpression
src/components/task/keyboard-shortcuts.tsx:509:18
           <SelectContent>
             {availableKeys.map(key => (
               <SelectItem key={key} value={key}>
-                {key.toUpperCase()}
+                {key.toLowerCase()}
               </SelectItem>
             ))}

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:536:39
         <Button
           size="sm"
           variant="ghost"
-          onClick={() => setIsEditing(false)}
+          onClick={() => setIsEditing(true)}
           className="h-7 w-7 p-0"
         >

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:536:20
         <Button
           size="sm"
           variant="ghost"
-          onClick={() => setIsEditing(false)}
+          onClick={() => undefined}
           className="h-7 w-7 p-0"
         >

[NoCoverage] BooleanLiteral
src/components/task/keyboard-shortcuts.tsx:561:39
           variant="ghost"
           size="sm"
           className="h-6 w-6 p-0 opacity-0 group-hover:opacity-100"
-          onClick={() => setIsEditing(true)}
+          onClick={() => setIsEditing(false)}
         >
           <Edit3 className="h-3 w-3" />

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:561:20
           variant="ghost"
           size="sm"
           className="h-6 w-6 p-0 opacity-0 group-hover:opacity-100"
-          onClick={() => setIsEditing(true)}
+          onClick={() => undefined}
         >
           <Edit3 className="h-3 w-3" />

[NoCoverage] ArrayDeclaration
src/components/task/keyboard-shortcuts.tsx:575:17
   return (
     <div className="grid grid-cols-2 md:grid-cols-3 gap-4 text-sm">
       {[
-        { keys: ['⌘', 'N'], desc: 'New Task' },
+        { keys: [], desc: 'New Task' },
         { keys: ['⌘', '/'], desc: 'Focus Search' },
         { keys: ['⌘', 'K'], desc: 'Command Palette' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:575:35
   return (
     <div className="grid grid-cols-2 md:grid-cols-3 gap-4 text-sm">
       {[
-        { keys: ['⌘', 'N'], desc: 'New Task' },
+        { keys: ['⌘', 'N'], desc: "" },
         { keys: ['⌘', '/'], desc: 'Focus Search' },
         { keys: ['⌘', 'K'], desc: 'Command Palette' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:576:18
     <div className="grid grid-cols-2 md:grid-cols-3 gap-4 text-sm">
       {[
         { keys: ['⌘', 'N'], desc: 'New Task' },
-        { keys: ['⌘', '/'], desc: 'Focus Search' },
+        { keys: ["", '/'], desc: 'Focus Search' },
         { keys: ['⌘', 'K'], desc: 'Command Palette' },
         { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },

[NoCoverage] ArrayDeclaration
src/components/task/keyboard-shortcuts.tsx:576:17
     <div className="grid grid-cols-2 md:grid-cols-3 gap-4 text-sm">
       {[
         { keys: ['⌘', 'N'], desc: 'New Task' },
-        { keys: ['⌘', '/'], desc: 'Focus Search' },
+        { keys: [], desc: 'Focus Search' },
         { keys: ['⌘', 'K'], desc: 'Command Palette' },
         { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:577:18
       {[
         { keys: ['⌘', 'N'], desc: 'New Task' },
         { keys: ['⌘', '/'], desc: 'Focus Search' },
-        { keys: ['⌘', 'K'], desc: 'Command Palette' },
+        { keys: ["", 'K'], desc: 'Command Palette' },
         { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },
         { keys: ['1'], desc: 'Today (⌘+1)' },

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:577:9
       {[
         { keys: ['⌘', 'N'], desc: 'New Task' },
         { keys: ['⌘', '/'], desc: 'Focus Search' },
-        { keys: ['⌘', 'K'], desc: 'Command Palette' },
+        {},
         { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },
         { keys: ['1'], desc: 'Today (⌘+1)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:578:23
         { keys: ['⌘', 'N'], desc: 'New Task' },
         { keys: ['⌘', '/'], desc: 'Focus Search' },
         { keys: ['⌘', 'K'], desc: 'Command Palette' },
-        { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },
+        { keys: ['⌘', "", '?'], desc: 'Show Shortcuts' },
         { keys: ['1'], desc: 'Today (⌘+1)' },
         { keys: ['2'], desc: 'Kanban (⌘+2)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:578:44
         { keys: ['⌘', 'N'], desc: 'New Task' },
         { keys: ['⌘', '/'], desc: 'Focus Search' },
         { keys: ['⌘', 'K'], desc: 'Command Palette' },
-        { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },
+        { keys: ['⌘', 'Shift', '?'], desc: "" },
         { keys: ['1'], desc: 'Today (⌘+1)' },
         { keys: ['2'], desc: 'Kanban (⌘+2)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:579:18
         { keys: ['⌘', '/'], desc: 'Focus Search' },
         { keys: ['⌘', 'K'], desc: 'Command Palette' },
         { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },
-        { keys: ['1'], desc: 'Today (⌘+1)' },
+        { keys: [""], desc: 'Today (⌘+1)' },
         { keys: ['2'], desc: 'Kanban (⌘+2)' },
         { keys: ['3'], desc: 'Analytics (⌘+3)' },

[NoCoverage] ArrayDeclaration
src/components/task/keyboard-shortcuts.tsx:580:17
         { keys: ['⌘', 'K'], desc: 'Command Palette' },
         { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },
         { keys: ['1'], desc: 'Today (⌘+1)' },
-        { keys: ['2'], desc: 'Kanban (⌘+2)' },
+        { keys: [], desc: 'Kanban (⌘+2)' },
         { keys: ['3'], desc: 'Analytics (⌘+3)' },
         { keys: ['C'], desc: 'Calendar (⌘+C)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:580:18
         { keys: ['⌘', 'K'], desc: 'Command Palette' },
         { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },
         { keys: ['1'], desc: 'Today (⌘+1)' },
-        { keys: ['2'], desc: 'Kanban (⌘+2)' },
+        { keys: [""], desc: 'Kanban (⌘+2)' },
         { keys: ['3'], desc: 'Analytics (⌘+3)' },
         { keys: ['C'], desc: 'Calendar (⌘+C)' },

[NoCoverage] ArrayDeclaration
src/components/task/keyboard-shortcuts.tsx:581:17
         { keys: ['⌘', 'Shift', '?'], desc: 'Show Shortcuts' },
         { keys: ['1'], desc: 'Today (⌘+1)' },
         { keys: ['2'], desc: 'Kanban (⌘+2)' },
-        { keys: ['3'], desc: 'Analytics (⌘+3)' },
+        { keys: [], desc: 'Analytics (⌘+3)' },
         { keys: ['C'], desc: 'Calendar (⌘+C)' },
         { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },

[NoCoverage] ArrayDeclaration
src/components/task/keyboard-shortcuts.tsx:582:17
         { keys: ['1'], desc: 'Today (⌘+1)' },
         { keys: ['2'], desc: 'Kanban (⌘+2)' },
         { keys: ['3'], desc: 'Analytics (⌘+3)' },
-        { keys: ['C'], desc: 'Calendar (⌘+C)' },
+        { keys: [], desc: 'Calendar (⌘+C)' },
         { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },
         { keys: ['M'], desc: 'Matrix (⌘+Shift+M)' },

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:583:9
         { keys: ['2'], desc: 'Kanban (⌘+2)' },
         { keys: ['3'], desc: 'Analytics (⌘+3)' },
         { keys: ['C'], desc: 'Calendar (⌘+C)' },
-        { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },
+        {},
         { keys: ['M'], desc: 'Matrix (⌘+Shift+M)' },
         { keys: ['A'], desc: 'AI Assistant (⌘+A)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:583:30
         { keys: ['2'], desc: 'Kanban (⌘+2)' },
         { keys: ['3'], desc: 'Analytics (⌘+3)' },
         { keys: ['C'], desc: 'Calendar (⌘+C)' },
-        { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },
+        { keys: ['G'], desc: "" },
         { keys: ['M'], desc: 'Matrix (⌘+Shift+M)' },
         { keys: ['A'], desc: 'AI Assistant (⌘+A)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:584:30
         { keys: ['3'], desc: 'Analytics (⌘+3)' },
         { keys: ['C'], desc: 'Calendar (⌘+C)' },
         { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },
-        { keys: ['M'], desc: 'Matrix (⌘+Shift+M)' },
+        { keys: ['M'], desc: "" },
         { keys: ['A'], desc: 'AI Assistant (⌘+A)' },
         { keys: ['F'], desc: 'Focus Mode (⌘+Shift+F)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:585:18
         { keys: ['C'], desc: 'Calendar (⌘+C)' },
         { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },
         { keys: ['M'], desc: 'Matrix (⌘+Shift+M)' },
-        { keys: ['A'], desc: 'AI Assistant (⌘+A)' },
+        { keys: [""], desc: 'AI Assistant (⌘+A)' },
         { keys: ['F'], desc: 'Focus Mode (⌘+Shift+F)' },
         // Task list shortcuts

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:585:30
         { keys: ['C'], desc: 'Calendar (⌘+C)' },
         { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },
         { keys: ['M'], desc: 'Matrix (⌘+Shift+M)' },
-        { keys: ['A'], desc: 'AI Assistant (⌘+A)' },
+        { keys: ['A'], desc: "" },
         { keys: ['F'], desc: 'Focus Mode (⌘+Shift+F)' },
         // Task list shortcuts

[NoCoverage] ArrayDeclaration
src/components/task/keyboard-shortcuts.tsx:586:17
         { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },
         { keys: ['M'], desc: 'Matrix (⌘+Shift+M)' },
         { keys: ['A'], desc: 'AI Assistant (⌘+A)' },
-        { keys: ['F'], desc: 'Focus Mode (⌘+Shift+F)' },
+        { keys: [], desc: 'Focus Mode (⌘+Shift+F)' },
         // Task list shortcuts
         { keys: ['Enter'], desc: 'Edit Task' },

[NoCoverage] ObjectLiteral
src/components/task/keyboard-shortcuts.tsx:586:9
         { keys: ['G'], desc: 'Gantt (⌘+Shift+G)' },
         { keys: ['M'], desc: 'Matrix (⌘+Shift+M)' },
         { keys: ['A'], desc: 'AI Assistant (⌘+A)' },
-        { keys: ['F'], desc: 'Focus Mode (⌘+Shift+F)' },
+        {},
         // Task list shortcuts
         { keys: ['Enter'], desc: 'Edit Task' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:588:18
         { keys: ['A'], desc: 'AI Assistant (⌘+A)' },
         { keys: ['F'], desc: 'Focus Mode (⌘+Shift+F)' },
         // Task list shortcuts
-        { keys: ['Enter'], desc: 'Edit Task' },
+        { keys: [""], desc: 'Edit Task' },
         { keys: [' '], desc: 'Complete/Incomplete' },
         { keys: ['Delete'], desc: 'Delete Task' },

[NoCoverage] ArrayDeclaration
src/components/task/keyboard-shortcuts.tsx:589:17
         { keys: ['F'], desc: 'Focus Mode (⌘+Shift+F)' },
         // Task list shortcuts
         { keys: ['Enter'], desc: 'Edit Task' },
-        { keys: [' '], desc: 'Complete/Incomplete' },
+        { keys: [], desc: 'Complete/Incomplete' },
         { keys: ['Delete'], desc: 'Delete Task' },
         { keys: ['c'], desc: 'Complete Focused Task' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:590:18
         // Task list shortcuts
         { keys: ['Enter'], desc: 'Edit Task' },
         { keys: [' '], desc: 'Complete/Incomplete' },
-        { keys: ['Delete'], desc: 'Delete Task' },
+        { keys: [""], desc: 'Delete Task' },
         { keys: ['c'], desc: 'Complete Focused Task' },
         { keys: ['r'], desc: 'Refresh (⌘+R)' },

[NoCoverage] ArrayDeclaration
src/components/task/keyboard-shortcuts.tsx:590:17
         // Task list shortcuts
         { keys: ['Enter'], desc: 'Edit Task' },
         { keys: [' '], desc: 'Complete/Incomplete' },
-        { keys: ['Delete'], desc: 'Delete Task' },
+        { keys: [], desc: 'Delete Task' },
         { keys: ['c'], desc: 'Complete Focused Task' },
         { keys: ['r'], desc: 'Refresh (⌘+R)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:591:30
         { keys: ['Enter'], desc: 'Edit Task' },
         { keys: [' '], desc: 'Complete/Incomplete' },
         { keys: ['Delete'], desc: 'Delete Task' },
-        { keys: ['c'], desc: 'Complete Focused Task' },
+        { keys: ['c'], desc: "" },
         { keys: ['r'], desc: 'Refresh (⌘+R)' },
         { keys: ['g'], desc: 'Scroll Top (⌘+G)' },

[NoCoverage] StringLiteral
src/components/task/keyboard-shortcuts.tsx:594:30
         { keys: ['c'], desc: 'Complete Focused Task' },
         { keys: ['r'], desc: 'Refresh (⌘+R)' },
         { keys: ['g'], desc: 'Scroll Top (⌘+G)' },
-        { keys: ['t'], desc: 'Scroll Bottom (⌘+T)' },
+        { keys: ['t'], desc: "" },
       ].map((item, i) => (
         <div key={i} className="flex items-center gap-2">

[NoCoverage] ArrowFunction
src/components/task/keyboard-shortcuts.tsx:595:13
         { keys: ['r'], desc: 'Refresh (⌘+R)' },
         { keys: ['g'], desc: 'Scroll Top (⌘+G)' },
         { keys: ['t'], desc: 'Scroll Bottom (⌘+T)' },
-      ].map((item, i) => (
-        <div key={i} className="flex items-center gap-2">
-          <kbd className="kbd">{item.keys.join('+')}</kbd>
-          <span className="text-muted-foreground">{item.desc}</span>
-        </div>
-      ))}
+      ].map(() => undefined)}
     </div>
   );
