[Survived] ObjectLiteral
src/lib/actions/tasks.ts:672:7
     await broadcastTaskUpdate(
       taskId,
       userId,
-      {
-        id: task.id,
-        name: task.name,
-        description: task.description,
-        list_id: task.list_id,
-        date: task.date,
-        deadline: task.deadline,
-        priority: task.priority,
-        completed: task.completed,
-        assignee_id: task.assignee_id,
-        archived: task.archived,
-      },
+      {},
       'created'
     );

[Survived] StringLiteral
src/lib/actions/tasks.ts:684:7
         assignee_id: task.assignee_id,
         archived: task.archived,
       },
-      'created'
+      ""
     );
   }

[Killed] OptionalChaining
src/lib/actions/tasks.ts:700:20
 ): Promise<TaskWithRelations> {
   const db = getDb();
   const user = await getCurrentUser();
-  const existing = user?.id
+  const existing = user.id
     ? (db
         .prepare('SELECT * FROM tasks WHERE id = ? AND user_id = ?')
killedBy: Reminder Actions getDueReminders should not return reminders for completed tasks
statusReason: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:706:7
         .get(id, user.id) as Task | undefined)
     : (db.prepare('SELECT * FROM tasks WHERE id = ?').get(id) as
         Task | undefined);
-  if (!existing) throw new Error('Task not found or access denied');
+  if (true) throw new Error('Task not found or access denied');
 
   const fields: string[] = [];
killedBy: Reminder Actions getDueReminders should not return reminders for completed tasks
statusReason: Task not found or access denied

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:706:7
         .get(id, user.id) as Task | undefined)
     : (db.prepare('SELECT * FROM tasks WHERE id = ?').get(id) as
         Task | undefined);
-  if (!existing) throw new Error('Task not found or access denied');
+  if (existing) throw new Error('Task not found or access denied');
 
   const fields: string[] = [];
killedBy: Reminder Actions getDueReminders should not return reminders for completed tasks
statusReason: Task not found or access denied

[Killed] ArrayDeclaration
src/lib/actions/tasks.ts:709:29
   if (!existing) throw new Error('Task not found or access denied');
 
   const fields: string[] = [];
-  const values: unknown[] = [];
+  const values: unknown[] = ["Stryker was here"];
 
   if (input.name !== undefined) {
killedBy: Task Actions Tasks should update a task
statusReason: expected 'Original' to be 'Updated' // Object.is equality

[Killed] EqualityOperator
src/lib/actions/tasks.ts:711:7
   const fields: string[] = [];
   const values: unknown[] = [];
 
-  if (input.name !== undefined) {
+  if (input.name === undefined) {
     const sanitizedName = sanitizeString(input.name) ?? input.name;
     fields.push('name = ?');
killedBy: Task Actions Tasks should update a task
statusReason: expected 'Original' to be 'Updated' // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:711:33
   const fields: string[] = [];
   const values: unknown[] = [];
 
-  if (input.name !== undefined) {
-    const sanitizedName = sanitizeString(input.name) ?? input.name;
-    fields.push('name = ?');
-    values.push(sanitizedName);
-    if (sanitizedName !== existing.name) {
-      logTaskAction(id, 'updated', `Name changed`);
-    }
-  }
+  if (input.name !== undefined) {}
   if (input.description !== undefined) {
     fields.push('description = ?');
killedBy: Task Actions Tasks should update a task
statusReason: expected 'Original' to be 'Updated' // Object.is equality

[Killed] LogicalOperator
src/lib/actions/tasks.ts:712:27
   const values: unknown[] = [];
 
   if (input.name !== undefined) {
-    const sanitizedName = sanitizeString(input.name) ?? input.name;
+    const sanitizedName = sanitizeString(input.name) && input.name;
     fields.push('name = ?');
     values.push(sanitizedName);
killedBy: Task Actions Additional Coverage should handle updateTask with empty string name
statusReason: expected null to be '' // Object.is equality

[Killed] StringLiteral
src/lib/actions/tasks.ts:713:17
 
   if (input.name !== undefined) {
     const sanitizedName = sanitizeString(input.name) ?? input.name;
-    fields.push('name = ?');
+    fields.push("");
     values.push(sanitizedName);
     if (sanitizedName !== existing.name) {
killedBy: Task Actions Tasks should update a task
statusReason: expected 'Original' to be 'Updated' // Object.is equality

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:715:9
     const sanitizedName = sanitizeString(input.name) ?? input.name;
     fields.push('name = ?');
     values.push(sanitizedName);
-    if (sanitizedName !== existing.name) {
+    if (false) {
       logTaskAction(id, 'updated', `Name changed`);
     }

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:715:9
     const sanitizedName = sanitizeString(input.name) ?? input.name;
     fields.push('name = ?');
     values.push(sanitizedName);
-    if (sanitizedName !== existing.name) {
+    if (true) {
       logTaskAction(id, 'updated', `Name changed`);
     }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:719:7
       logTaskAction(id, 'updated', `Name changed`);
     }
   }
-  if (input.description !== undefined) {
+  if (false) {
     fields.push('description = ?');
     values.push(sanitizeString(input.description) || null);
killedBy: Task Actions Additional Coverage should handle null values in updateTask
statusReason: expected 'Original' to be null

[Killed] BlockStatement
src/lib/actions/tasks.ts:719:40
       logTaskAction(id, 'updated', `Name changed`);
     }
   }
-  if (input.description !== undefined) {
-    fields.push('description = ?');
-    values.push(sanitizeString(input.description) || null);
-  }
+  if (input.description !== undefined) {}
   if (input.list_id !== undefined) {
     fields.push('list_id = ?');
killedBy: Task Actions Additional Coverage should handle null values in updateTask
statusReason: expected 'Original' to be null

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:721:17
   }
   if (input.description !== undefined) {
     fields.push('description = ?');
-    values.push(sanitizeString(input.description) || null);
+    values.push(false);
   }
   if (input.list_id !== undefined) {
killedBy: Task Actions Additional Coverage should handle null values in updateTask
statusReason: expected false to be null

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:721:17
   }
   if (input.description !== undefined) {
     fields.push('description = ?');
-    values.push(sanitizeString(input.description) || null);
+    values.push(true);
   }
   if (input.list_id !== undefined) {
killedBy: Task Actions Additional Coverage should handle null values in updateTask
statusReason: expected true to be null

[Survived] BlockStatement
src/lib/actions/tasks.ts:723:36
     fields.push('description = ?');
     values.push(sanitizeString(input.description) || null);
   }
-  if (input.list_id !== undefined) {
-    fields.push('list_id = ?');
-    values.push(input.list_id);
-  }
+  if (input.list_id !== undefined) {}
   if (input.date !== undefined) {
     fields.push('date = ?');

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:723:7
     fields.push('description = ?');
     values.push(sanitizeString(input.description) || null);
   }
-  if (input.list_id !== undefined) {
+  if (false) {
     fields.push('list_id = ?');
     values.push(input.list_id);

[Killed] EqualityOperator
src/lib/actions/tasks.ts:727:7
     fields.push('list_id = ?');
     values.push(input.list_id);
   }
-  if (input.date !== undefined) {
+  if (input.date === undefined) {
     fields.push('date = ?');
     values.push(input.date || null);
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle date string update
statusReason: expected '2024-01-01' to be '2024-12-31' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:727:7
     fields.push('list_id = ?');
     values.push(input.list_id);
   }
-  if (input.date !== undefined) {
+  if (false) {
     fields.push('date = ?');
     values.push(input.date || null);
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle date string update
statusReason: expected '2024-01-01' to be '2024-12-31' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:729:17
   }
   if (input.date !== undefined) {
     fields.push('date = ?');
-    values.push(input.date || null);
+    values.push(false);
   }
   if (input.deadline !== undefined) {
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle date string update
statusReason: expected false to be '2024-12-31' // Object.is equality

[Killed] LogicalOperator
src/lib/actions/tasks.ts:729:17
   }
   if (input.date !== undefined) {
     fields.push('date = ?');
-    values.push(input.date || null);
+    values.push(input.date && null);
   }
   if (input.deadline !== undefined) {
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle date string update
statusReason: expected null to be '2024-12-31' // Object.is equality

[Survived] EqualityOperator
src/lib/actions/tasks.ts:731:7
     fields.push('date = ?');
     values.push(input.date || null);
   }
-  if (input.deadline !== undefined) {
+  if (input.deadline === undefined) {
     fields.push('deadline = ?');
     values.push(input.deadline || null);

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:731:7
     fields.push('date = ?');
     values.push(input.date || null);
   }
-  if (input.deadline !== undefined) {
+  if (false) {
     fields.push('deadline = ?');
     values.push(input.deadline || null);

[Survived] LogicalOperator
src/lib/actions/tasks.ts:733:17
   }
   if (input.deadline !== undefined) {
     fields.push('deadline = ?');
-    values.push(input.deadline || null);
+    values.push(input.deadline && null);
   }
   if (input.estimate !== undefined) {

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:733:17
   }
   if (input.deadline !== undefined) {
     fields.push('deadline = ?');
-    values.push(input.deadline || null);
+    values.push(true);
   }
   if (input.estimate !== undefined) {

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:735:7
     fields.push('deadline = ?');
     values.push(input.deadline || null);
   }
-  if (input.estimate !== undefined) {
+  if (true) {
     fields.push('estimate = ?');
     values.push(input.estimate || null);

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:735:7
     fields.push('deadline = ?');
     values.push(input.deadline || null);
   }
-  if (input.estimate !== undefined) {
+  if (false) {
     fields.push('estimate = ?');
     values.push(input.estimate || null);

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:736:17
     values.push(input.deadline || null);
   }
   if (input.estimate !== undefined) {
-    fields.push('estimate = ?');
+    fields.push("");
     values.push(input.estimate || null);
   }

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:737:17
   }
   if (input.estimate !== undefined) {
     fields.push('estimate = ?');
-    values.push(input.estimate || null);
+    values.push(true);
   }
   if (input.actual_time !== undefined) {

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:737:17
   }
   if (input.estimate !== undefined) {
     fields.push('estimate = ?');
-    values.push(input.estimate || null);
+    values.push(false);
   }
   if (input.actual_time !== undefined) {

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:739:40
     fields.push('estimate = ?');
     values.push(input.estimate || null);
   }
-  if (input.actual_time !== undefined) {
-    fields.push('actual_time = ?');
-    values.push(input.actual_time || null);
-  }
+  if (input.actual_time !== undefined) {}
   if (input.priority !== undefined) {
     fields.push('priority = ?');

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:739:7
     fields.push('estimate = ?');
     values.push(input.estimate || null);
   }
-  if (input.actual_time !== undefined) {
+  if (false) {
     fields.push('actual_time = ?');
     values.push(input.actual_time || null);

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:740:17
     values.push(input.estimate || null);
   }
   if (input.actual_time !== undefined) {
-    fields.push('actual_time = ?');
+    fields.push("");
     values.push(input.actual_time || null);
   }

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:741:17
   }
   if (input.actual_time !== undefined) {
     fields.push('actual_time = ?');
-    values.push(input.actual_time || null);
+    values.push(input.actual_time && null);
   }
   if (input.priority !== undefined) {

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:741:17
   }
   if (input.actual_time !== undefined) {
     fields.push('actual_time = ?');
-    values.push(input.actual_time || null);
+    values.push(false);
   }
   if (input.priority !== undefined) {

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:743:7
     fields.push('actual_time = ?');
     values.push(input.actual_time || null);
   }
-  if (input.priority !== undefined) {
+  if (false) {
     fields.push('priority = ?');
     values.push(input.priority);
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle priority update with valid priority
statusReason: expected 'low' to be 'critical' // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:743:37
     fields.push('actual_time = ?');
     values.push(input.actual_time || null);
   }
-  if (input.priority !== undefined) {
-    fields.push('priority = ?');
-    values.push(input.priority);
-  }
+  if (input.priority !== undefined) {}
   if (input.recurring !== undefined) {
     fields.push('recurring = ?');
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle priority update with valid priority
statusReason: expected 'low' to be 'critical' // Object.is equality

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:747:38
     fields.push('priority = ?');
     values.push(input.priority);
   }
-  if (input.recurring !== undefined) {
-    fields.push('recurring = ?');
-    values.push(input.recurring);
-  }
+  if (input.recurring !== undefined) {}
   if (input.recurring_config !== undefined) {
     fields.push('recurring_config = ?');

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:747:7
     fields.push('priority = ?');
     values.push(input.priority);
   }
-  if (input.recurring !== undefined) {
+  if (false) {
     fields.push('recurring = ?');
     values.push(input.recurring);

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:748:17
     values.push(input.priority);
   }
   if (input.recurring !== undefined) {
-    fields.push('recurring = ?');
+    fields.push("");
     values.push(input.recurring);
   }

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:751:7
     fields.push('recurring = ?');
     values.push(input.recurring);
   }
-  if (input.recurring_config !== undefined) {
+  if (true) {
     fields.push('recurring_config = ?');
     values.push(input.recurring_config || null);

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:751:45
     fields.push('recurring = ?');
     values.push(input.recurring);
   }
-  if (input.recurring_config !== undefined) {
-    fields.push('recurring_config = ?');
-    values.push(input.recurring_config || null);
-  }
+  if (input.recurring_config !== undefined) {}
   if (input.completed !== undefined) {
     fields.push('completed = ?, completed_at = ?');

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:753:17
   }
   if (input.recurring_config !== undefined) {
     fields.push('recurring_config = ?');
-    values.push(input.recurring_config || null);
+    values.push(input.recurring_config && null);
   }
   if (input.completed !== undefined) {

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:753:17
   }
   if (input.recurring_config !== undefined) {
     fields.push('recurring_config = ?');
-    values.push(input.recurring_config || null);
+    values.push(true);
   }
   if (input.completed !== undefined) {

[Killed] BlockStatement
src/lib/actions/tasks.ts:755:38
     fields.push('recurring_config = ?');
     values.push(input.recurring_config || null);
   }
-  if (input.completed !== undefined) {
-    fields.push('completed = ?, completed_at = ?');
-    values.push(
-      input.completed ? 1 : 0,
-      input.completed ? new Date().toISOString() : null
-    );
-    if (input.completed !== Boolean(existing.completed)) {
-      logTaskAction(
-        id,
-        input.completed ? 'completed' : 'uncompleted',
-        `Task status updated`
-      );
-    }
-  }
+  if (input.completed !== undefined) {}
   if (input.ai_provider !== undefined) {
     fields.push('ai_provider = ?');
killedBy: Task Actions Additional Coverage should handle updating only completed status
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/actions/tasks.ts:755:7
     fields.push('recurring_config = ?');
     values.push(input.recurring_config || null);
   }
-  if (input.completed !== undefined) {
+  if (input.completed === undefined) {
     fields.push('completed = ?, completed_at = ?');
     values.push(
killedBy: Task Actions Additional Coverage should handle updating only completed status
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:761:58
       input.completed ? 1 : 0,
       input.completed ? new Date().toISOString() : null
     );
-    if (input.completed !== Boolean(existing.completed)) {
-      logTaskAction(
-        id,
-        input.completed ? 'completed' : 'uncompleted',
-        `Task status updated`
-      );
-    }
+    if (input.completed !== Boolean(existing.completed)) {}
   }
   if (input.ai_provider !== undefined) {

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:761:9
       input.completed ? 1 : 0,
       input.completed ? new Date().toISOString() : null
     );
-    if (input.completed !== Boolean(existing.completed)) {
+    if (false) {
       logTaskAction(
         id,

[Survived] EqualityOperator
src/lib/actions/tasks.ts:769:7
       );
     }
   }
-  if (input.ai_provider !== undefined) {
+  if (input.ai_provider === undefined) {
     fields.push('ai_provider = ?');
     values.push(input.ai_provider);

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:769:7
       );
     }
   }
-  if (input.ai_provider !== undefined) {
+  if (true) {
     fields.push('ai_provider = ?');
     values.push(input.ai_provider);

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:773:45
     fields.push('ai_provider = ?');
     values.push(input.ai_provider);
   }
-  if (input.confidence_score !== undefined) {
-    fields.push('confidence_score = ?');
-    values.push(input.confidence_score);
-  }
+  if (input.confidence_score !== undefined) {}
 
   if (fields.length > 0) {

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:773:7
     fields.push('ai_provider = ?');
     values.push(input.ai_provider);
   }
-  if (input.confidence_score !== undefined) {
+  if (false) {
     fields.push('confidence_score = ?');
     values.push(input.confidence_score);

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:774:17
     values.push(input.ai_provider);
   }
   if (input.confidence_score !== undefined) {
-    fields.push('confidence_score = ?');
+    fields.push("");
     values.push(input.confidence_score);
   }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:778:7
     values.push(input.confidence_score);
   }
 
-  if (fields.length > 0) {
+  if (false) {
     fields.push('updated_at = CURRENT_TIMESTAMP');
     values.push(id);
killedBy: Task Actions Tasks should update a task
statusReason: expected 'Original' to be 'Updated' // Object.is equality

[Killed] EqualityOperator
src/lib/actions/tasks.ts:778:7
     values.push(input.confidence_score);
   }
 
-  if (fields.length > 0) {
+  if (fields.length <= 0) {
     fields.push('updated_at = CURRENT_TIMESTAMP');
     values.push(id);
killedBy: Task Actions Tasks should update a task
statusReason: expected 'Original' to be 'Updated' // Object.is equality

[Killed] StringLiteral
src/lib/actions/tasks.ts:781:48
   if (fields.length > 0) {
     fields.push('updated_at = CURRENT_TIMESTAMP');
     values.push(id);
-    db.prepare(`UPDATE tasks SET ${fields.join(', ')} WHERE id = ?`).run(
+    db.prepare(`UPDATE tasks SET ${fields.join("")} WHERE id = ?`).run(
       ...values
     );
killedBy: Task Actions Tasks should update a task
statusReason: expected 'Original' to be 'Updated' // Object.is equality

[Killed] EqualityOperator
src/lib/actions/tasks.ts:786:7
     );
   }
 
-  if (input.label_ids !== undefined) {
+  if (input.label_ids === undefined) {
     db.prepare('DELETE FROM task_labels WHERE task_id = ?').run(id);
     if (input.label_ids.length) {
killedBy: Task Actions Tasks should update a task
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:786:7
     );
   }
 
-  if (input.label_ids !== undefined) {
+  if (true) {
     db.prepare('DELETE FROM task_labels WHERE task_id = ?').run(id);
     if (input.label_ids.length) {
killedBy: Task Actions Tasks should update a task
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:787:16
   }
 
   if (input.label_ids !== undefined) {
-    db.prepare('DELETE FROM task_labels WHERE task_id = ?').run(id);
+    db.prepare("").run(id);
     if (input.label_ids.length) {
       const stmt = db.prepare(

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:788:33
 
   if (input.label_ids !== undefined) {
     db.prepare('DELETE FROM task_labels WHERE task_id = ?').run(id);
-    if (input.label_ids.length) {
-      const stmt = db.prepare(
-        'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'
-      );
-      for (const labelId of input.label_ids) {
-        stmt.run(id, labelId);
-      }
-    }
+    if (input.label_ids.length) {}
   }
 

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:788:9
 
   if (input.label_ids !== undefined) {
     db.prepare('DELETE FROM task_labels WHERE task_id = ?').run(id);
-    if (input.label_ids.length) {
+    if (true) {
       const stmt = db.prepare(
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:790:9
     db.prepare('DELETE FROM task_labels WHERE task_id = ?').run(id);
     if (input.label_ids.length) {
       const stmt = db.prepare(
-        'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'
+        ""
       );
       for (const labelId of input.label_ids) {

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:792:46
       const stmt = db.prepare(
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'
       );
-      for (const labelId of input.label_ids) {
-        stmt.run(id, labelId);
-      }
+      for (const labelId of input.label_ids) {}
     }
   }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:798:7
     }
   }
 
-  if (input.subtasks !== undefined) {
+  if (true) {
     db.prepare('DELETE FROM subtasks WHERE task_id = ?').run(id);
     if (input.subtasks.length) {
killedBy: Task Actions Tasks should update a task
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/lib/actions/tasks.ts:798:7
     }
   }
 
-  if (input.subtasks !== undefined) {
+  if (input.subtasks === undefined) {
     db.prepare('DELETE FROM subtasks WHERE task_id = ?').run(id);
     if (input.subtasks.length) {
killedBy: Task Actions Tasks should update a task
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:800:32
 
   if (input.subtasks !== undefined) {
     db.prepare('DELETE FROM subtasks WHERE task_id = ?').run(id);
-    if (input.subtasks.length) {
-      const stmt = db.prepare(
-        'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'
-      );
-      for (const name of input.subtasks) {
-        stmt.run(id, sanitizeString(name) ?? name);
-      }
-    }
+    if (input.subtasks.length) {}
   }
 

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:800:9
 
   if (input.subtasks !== undefined) {
     db.prepare('DELETE FROM subtasks WHERE task_id = ?').run(id);
-    if (input.subtasks.length) {
+    if (false) {
       const stmt = db.prepare(
         'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:802:9
     db.prepare('DELETE FROM subtasks WHERE task_id = ?').run(id);
     if (input.subtasks.length) {
       const stmt = db.prepare(
-        'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'
+        ""
       );
       for (const name of input.subtasks) {

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:804:42
       const stmt = db.prepare(
         'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'
       );
-      for (const name of input.subtasks) {
-        stmt.run(id, sanitizeString(name) ?? name);
-      }
+      for (const name of input.subtasks) {}
     }
   }

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:805:22
         'INSERT INTO subtasks (task_id, name) VALUES (?, ?)'
       );
       for (const name of input.subtasks) {
-        stmt.run(id, sanitizeString(name) ?? name);
+        stmt.run(id, sanitizeString(name) && name);
       }
     }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:810:7
     }
   }
 
-  if (input.reminders !== undefined) {
+  if (true) {
     db.prepare('DELETE FROM reminders WHERE task_id = ?').run(id);
     if (input.reminders.length) {
killedBy: Task Actions Tasks should update a task
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/lib/actions/tasks.ts:810:7
     }
   }
 
-  if (input.reminders !== undefined) {
+  if (input.reminders === undefined) {
     db.prepare('DELETE FROM reminders WHERE task_id = ?').run(id);
     if (input.reminders.length) {
killedBy: Task Actions Tasks should update a task
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:811:16
   }
 
   if (input.reminders !== undefined) {
-    db.prepare('DELETE FROM reminders WHERE task_id = ?').run(id);
+    db.prepare("").run(id);
     if (input.reminders.length) {
       const stmt = db.prepare(

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:812:33
 
   if (input.reminders !== undefined) {
     db.prepare('DELETE FROM reminders WHERE task_id = ?').run(id);
-    if (input.reminders.length) {
-      const stmt = db.prepare(
-        'INSERT INTO reminders (task_id, remind_at) VALUES (?, ?)'
-      );
-      for (const remindAt of input.reminders) {
-        stmt.run(id, remindAt);
-      }
-    }
+    if (input.reminders.length) {}
   }
 

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:812:9
 
   if (input.reminders !== undefined) {
     db.prepare('DELETE FROM reminders WHERE task_id = ?').run(id);
-    if (input.reminders.length) {
+    if (false) {
       const stmt = db.prepare(
         'INSERT INTO reminders (task_id, remind_at) VALUES (?, ?)'

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:816:47
       const stmt = db.prepare(
         'INSERT INTO reminders (task_id, remind_at) VALUES (?, ?)'
       );
-      for (const remindAt of input.reminders) {
-        stmt.run(id, remindAt);
-      }
+      for (const remindAt of input.reminders) {}
     }
   }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:823:7
   }
 
   // Handle task dependencies (blockers)
-  if (input.blocker_ids !== undefined) {
+  if (true) {
     db.prepare('DELETE FROM task_dependencies WHERE task_id = ?').run(id);
     if (input.blocker_ids.length) {
killedBy: Task Actions Tasks should update a task
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/lib/actions/tasks.ts:823:7
   }
 
   // Handle task dependencies (blockers)
-  if (input.blocker_ids !== undefined) {
+  if (input.blocker_ids === undefined) {
     db.prepare('DELETE FROM task_dependencies WHERE task_id = ?').run(id);
     if (input.blocker_ids.length) {
killedBy: Task Actions Tasks should update a task
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:824:16
 
   // Handle task dependencies (blockers)
   if (input.blocker_ids !== undefined) {
-    db.prepare('DELETE FROM task_dependencies WHERE task_id = ?').run(id);
+    db.prepare("").run(id);
     if (input.blocker_ids.length) {
       const stmt = db.prepare(

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:825:9
   // Handle task dependencies (blockers)
   if (input.blocker_ids !== undefined) {
     db.prepare('DELETE FROM task_dependencies WHERE task_id = ?').run(id);
-    if (input.blocker_ids.length) {
+    if (true) {
       const stmt = db.prepare(
         'INSERT INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:825:35
   // Handle task dependencies (blockers)
   if (input.blocker_ids !== undefined) {
     db.prepare('DELETE FROM task_dependencies WHERE task_id = ?').run(id);
-    if (input.blocker_ids.length) {
-      const stmt = db.prepare(
-        'INSERT INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'
-      );
-      for (const blockingTaskId of input.blocker_ids) {
-        stmt.run(id, blockingTaskId);
-      }
-    }
+    if (input.blocker_ids.length) {}
   }
 
