[Killed] StringLiteral
src/hooks/use-tasks.ts:70:58
   const [tasks, setTasks] = useState<TaskWithRelations[]>(initialTasks);
   const [lists, setLists] = useState<List[]>(initialLists);
   const [labels, setLabels] = useState<Label[]>(initialLabels);
-  const [currentView, setCurrentView] = useState<string>('today');
+  const [currentView, setCurrentView] = useState<string>("");
   const [currentListId, setCurrentListId] = useState<number | undefined>();
   const [searchQuery, setSearchQuery] = useState('');
killedBy: useTasks initial state should have default currentView of 'today'
statusReason: expected '' to be 'today' // Object.is equality

[Killed] StringLiteral
src/hooks/use-tasks.ts:76:51
   const [currentFilterPreset, setCurrentFilterPreset] = useState<
     FilterPreset | undefined
   >();
-  const [sortBy, setSortBy] = useState<SortField>('date');
+  const [sortBy, setSortBy] = useState<SortField>("");
   const [sortDirection, setSortDirection] = useState<SortDirection>('asc');
   const [filterListId, setFilterListId] = useState<number | undefined>();
killedBy: useTasks initial state should have default sortBy of 'date'
statusReason: expected '' to be 'date' // Object.is equality

[Killed] StringLiteral
src/hooks/use-tasks.ts:77:69
     FilterPreset | undefined
   >();
   const [sortBy, setSortBy] = useState<SortField>('date');
-  const [sortDirection, setSortDirection] = useState<SortDirection>('asc');
+  const [sortDirection, setSortDirection] = useState<SortDirection>("");
   const [filterListId, setFilterListId] = useState<number | undefined>();
   const [filterLabelIds, setFilterLabelIds] = useState<number[]>([]);
killedBy: useTasks initial state should have default sortDirection of 'asc'
statusReason: expected '' to be 'asc' // Object.is equality

[Survived] ArrayDeclaration
src/hooks/use-tasks.ts:84:64
   const searchInputRef = useRef<HTMLInputElement>(null);
 
   // Search history from localStorage
-  const [searchHistory, setSearchHistory] = useState<string[]>([]);
+  const [searchHistory, setSearchHistory] = useState<string[]>(["Stryker was here"]);
 
   // Cache the Fuse instance to avoid recreating it on every render

[Survived] BlockStatement
src/hooks/use-tasks.ts:89:38
   // Cache the Fuse instance to avoid recreating it on every render
   // Use dynamic import for SSR compatibility
   // Note: We only create the instance once and update its collection separately
-  const fuseInstance = useMemo(() => {
-    if (typeof window === 'undefined') return null;
-    try {
-      // Dynamic import for Fuse.js (SSR-safe)
-      // eslint-disable-next-line @typescript-eslint/no-require-imports
-      const FuseModule = require('fuse.js');
-      const Fuse = FuseModule.default || FuseModule;
-      return new Fuse([], {
-        keys: ['name', 'description', 'notes'],
-        threshold: 0.4,
-        minMatchCharLength: 2,
-        shouldSort: true,
-      });
-    } catch {
-      // Fuse.js not available, will fall back to simple filtering
-      return null;
-    }
-  }, []); // Empty deps - only create once
+  const fuseInstance = useMemo(() => {}, []); // Empty deps - only create once
 
   // Calculate visible tasks with optimized filtering

[Survived] EqualityOperator
src/hooks/use-tasks.ts:90:9
   // Use dynamic import for SSR compatibility
   // Note: We only create the instance once and update its collection separately
   const fuseInstance = useMemo(() => {
-    if (typeof window === 'undefined') return null;
+    if (typeof window !== 'undefined') return null;
     try {
       // Dynamic import for Fuse.js (SSR-safe)

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:90:9
   // Use dynamic import for SSR compatibility
   // Note: We only create the instance once and update its collection separately
   const fuseInstance = useMemo(() => {
-    if (typeof window === 'undefined') return null;
+    if (true) return null;
     try {
       // Dynamic import for Fuse.js (SSR-safe)

[Survived] BlockStatement
src/hooks/use-tasks.ts:91:9
   // Note: We only create the instance once and update its collection separately
   const fuseInstance = useMemo(() => {
     if (typeof window === 'undefined') return null;
-    try {
-      // Dynamic import for Fuse.js (SSR-safe)
-      // eslint-disable-next-line @typescript-eslint/no-require-imports
-      const FuseModule = require('fuse.js');
-      const Fuse = FuseModule.default || FuseModule;
-      return new Fuse([], {
-        keys: ['name', 'description', 'notes'],
-        threshold: 0.4,
-        minMatchCharLength: 2,
-        shouldSort: true,
-      });
-    } catch {
+    try {} catch {
       // Fuse.js not available, will fall back to simple filtering
       return null;

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:95:20
       // Dynamic import for Fuse.js (SSR-safe)
       // eslint-disable-next-line @typescript-eslint/no-require-imports
       const FuseModule = require('fuse.js');
-      const Fuse = FuseModule.default || FuseModule;
+      const Fuse = false;
       return new Fuse([], {
         keys: ['name', 'description', 'notes'],

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:95:20
       // Dynamic import for Fuse.js (SSR-safe)
       // eslint-disable-next-line @typescript-eslint/no-require-imports
       const FuseModule = require('fuse.js');
-      const Fuse = FuseModule.default || FuseModule;
+      const Fuse = true;
       return new Fuse([], {
         keys: ['name', 'description', 'notes'],

[Survived] StringLiteral
src/hooks/use-tasks.ts:97:39
       const FuseModule = require('fuse.js');
       const Fuse = FuseModule.default || FuseModule;
       return new Fuse([], {
-        keys: ['name', 'description', 'notes'],
+        keys: ['name', 'description', ""],
         threshold: 0.4,
         minMatchCharLength: 2,

[Survived] BooleanLiteral
src/hooks/use-tasks.ts:100:21
         keys: ['name', 'description', 'notes'],
         threshold: 0.4,
         minMatchCharLength: 2,
-        shouldSort: true,
+        shouldSort: false,
       });
     } catch {

[NoCoverage] BlockStatement
src/hooks/use-tasks.ts:102:13
         minMatchCharLength: 2,
         shouldSort: true,
       });
-    } catch {
-      // Fuse.js not available, will fall back to simple filtering
-      return null;
-    }
+    } catch {}
   }, []); // Empty deps - only create once
 

[Survived] ArrayDeclaration
src/hooks/use-tasks.ts:106:6
       // Fuse.js not available, will fall back to simple filtering
       return null;
     }
-  }, []); // Empty deps - only create once
+  }, ["Stryker was here"]); // Empty deps - only create once
 
   // Calculate visible tasks with optimized filtering

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:113:9
     let result = tasks;
 
     // Apply search query (fuzzy search)
-    if (searchQuery && fuseInstance) {
+    if (true) {
       // Update the fuse instance with current tasks before searching
       fuseInstance.setCollection(tasks);
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle tasks with null dates gracefully
statusReason: expected [ { id: 2, …(26) }, { id: 1, …(26) } ] to deeply equal []

[Killed] LogicalOperator
src/hooks/use-tasks.ts:113:9
     let result = tasks;
 
     // Apply search query (fuzzy search)
-    if (searchQuery && fuseInstance) {
+    if (searchQuery || fuseInstance) {
       // Update the fuse instance with current tasks before searching
       fuseInstance.setCollection(tasks);
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle tasks with null dates gracefully
statusReason: expected [ { id: 2, …(26) }, { id: 1, …(26) } ] to deeply equal []

[Killed] ArrowFunction
src/hooks/use-tasks.ts:118:14
       fuseInstance.setCollection(tasks);
       result = fuseInstance
         .search(searchQuery)
-        .map((r: { item: TaskWithRelations }) => r.item);
+        .map(() => undefined);
     } else if (!currentFilterPreset && !searchQuery) {
       const now = new Date();
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle search query with special characters
statusReason: Cannot read properties of undefined (reading 'completed')

[Killed] BlockStatement
src/hooks/use-tasks.ts:119:54
       result = fuseInstance
         .search(searchQuery)
         .map((r: { item: TaskWithRelations }) => r.item);
-    } else if (!currentFilterPreset && !searchQuery) {
-      const now = new Date();
-      const today = now.toISOString().split('T')[0];
-      const nextWeek = new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000)
-        .toISOString()
-        .split('T')[0];
-
-      if (currentView === 'today') {
-        result = tasks.filter(t => t.date === today);
-      } else if (currentView === 'next7') {
-        result = tasks.filter(
-          t => t.date && t.date >= today && t.date <= nextWeek
-        );
-      } else if (currentView === 'upcoming') {
-        result = tasks.filter(t => t.date && t.date >= today);
-      } else if (currentView === 'blocked') {
-        result = tasks.filter(t => t.blocked_by && t.blocked_by.length > 0);
-      }
-    }
+    } else if (!currentFilterPreset && !searchQuery) {}
 
     // Filter out completed tasks
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle tasks with null dates gracefully
statusReason: expected [ { id: 2, …(26) }, { id: 1, …(26) } ] to deeply equal []

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:119:16
       result = fuseInstance
         .search(searchQuery)
         .map((r: { item: TaskWithRelations }) => r.item);
-    } else if (!currentFilterPreset && !searchQuery) {
+    } else if (false) {
       const now = new Date();
       const today = now.toISOString().split('T')[0];
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle tasks with null dates gracefully
statusReason: expected [ { id: 2, …(26) }, { id: 1, …(26) } ] to deeply equal []

[Survived] ArithmeticOperator
src/hooks/use-tasks.ts:122:49
     } else if (!currentFilterPreset && !searchQuery) {
       const now = new Date();
       const today = now.toISOString().split('T')[0];
-      const nextWeek = new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000)
+      const nextWeek = new Date(now.getTime() + 7 * 24 / 60 * 60 * 1000)
         .toISOString()
         .split('T')[0];

[Survived] ArithmeticOperator
src/hooks/use-tasks.ts:122:49
     } else if (!currentFilterPreset && !searchQuery) {
       const now = new Date();
       const today = now.toISOString().split('T')[0];
-      const nextWeek = new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000)
+      const nextWeek = new Date(now.getTime() + 7 * 24 * 60 * 60 / 1000)
         .toISOString()
         .split('T')[0];

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:126:11
         .toISOString()
         .split('T')[0];
 
-      if (currentView === 'today') {
+      if (false) {
         result = tasks.filter(t => t.date === today);
       } else if (currentView === 'next7') {
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle tasks with null dates gracefully
statusReason: expected [ { id: 2, …(26) }, { id: 1, …(26) } ] to deeply equal []

[Killed] EqualityOperator
src/hooks/use-tasks.ts:126:11
         .toISOString()
         .split('T')[0];
 
-      if (currentView === 'today') {
+      if (currentView !== 'today') {
         result = tasks.filter(t => t.date === today);
       } else if (currentView === 'next7') {
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle tasks with null dates gracefully
statusReason: expected [ { id: 2, …(26) }, { id: 1, …(26) } ] to deeply equal []

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:127:36
         .split('T')[0];
 
       if (currentView === 'today') {
-        result = tasks.filter(t => t.date === today);
+        result = tasks.filter(t => true);
       } else if (currentView === 'next7') {
         result = tasks.filter(
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle tasks with null dates gracefully
statusReason: expected [ { id: 2, …(26) }, { id: 1, …(26) } ] to deeply equal []

[Killed] MethodExpression
src/hooks/use-tasks.ts:127:18
         .split('T')[0];
 
       if (currentView === 'today') {
-        result = tasks.filter(t => t.date === today);
+        result = tasks;
       } else if (currentView === 'next7') {
         result = tasks.filter(
killedBy: useTasks hook - Edge Cases View filters property-based testing should handle tasks with null dates gracefully
statusReason: expected [ { id: 2, …(26) }, { id: 1, …(26) } ] to deeply equal []

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:128:18
 
       if (currentView === 'today') {
         result = tasks.filter(t => t.date === today);
-      } else if (currentView === 'next7') {
+      } else if (true) {
         result = tasks.filter(
           t => t.date && t.date >= today && t.date <= nextWeek
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/hooks/use-tasks.ts:128:18
 
       if (currentView === 'today') {
         result = tasks.filter(t => t.date === today);
-      } else if (currentView === 'next7') {
+      } else if (currentView !== 'next7') {
         result = tasks.filter(
           t => t.date && t.date >= today && t.date <= nextWeek
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] MethodExpression
src/hooks/use-tasks.ts:129:18
       if (currentView === 'today') {
         result = tasks.filter(t => t.date === today);
       } else if (currentView === 'next7') {
-        result = tasks.filter(
-          t => t.date && t.date >= today && t.date <= nextWeek
-        );
+        result = tasks;
       } else if (currentView === 'upcoming') {
         result = tasks.filter(t => t.date && t.date >= today);

[NoCoverage] EqualityOperator
src/hooks/use-tasks.ts:130:26
         result = tasks.filter(t => t.date === today);
       } else if (currentView === 'next7') {
         result = tasks.filter(
-          t => t.date && t.date >= today && t.date <= nextWeek
+          t => t.date && t.date > today && t.date <= nextWeek
         );
       } else if (currentView === 'upcoming') {

[NoCoverage] LogicalOperator
src/hooks/use-tasks.ts:130:16
         result = tasks.filter(t => t.date === today);
       } else if (currentView === 'next7') {
         result = tasks.filter(
-          t => t.date && t.date >= today && t.date <= nextWeek
+          t => t.date && t.date >= today || t.date <= nextWeek
         );
       } else if (currentView === 'upcoming') {

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:132:18
         result = tasks.filter(
           t => t.date && t.date >= today && t.date <= nextWeek
         );
-      } else if (currentView === 'upcoming') {
+      } else if (true) {
         result = tasks.filter(t => t.date && t.date >= today);
       } else if (currentView === 'blocked') {
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/hooks/use-tasks.ts:132:18
         result = tasks.filter(
           t => t.date && t.date >= today && t.date <= nextWeek
         );
-      } else if (currentView === 'upcoming') {
+      } else if (currentView !== 'upcoming') {
         result = tasks.filter(t => t.date && t.date >= today);
       } else if (currentView === 'blocked') {
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] EqualityOperator
src/hooks/use-tasks.ts:133:46
           t => t.date && t.date >= today && t.date <= nextWeek
         );
       } else if (currentView === 'upcoming') {
-        result = tasks.filter(t => t.date && t.date >= today);
+        result = tasks.filter(t => t.date && t.date < today);
       } else if (currentView === 'blocked') {
         result = tasks.filter(t => t.blocked_by && t.blocked_by.length > 0);

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:133:36
           t => t.date && t.date >= today && t.date <= nextWeek
         );
       } else if (currentView === 'upcoming') {
-        result = tasks.filter(t => t.date && t.date >= today);
+        result = tasks.filter(t => true);
       } else if (currentView === 'blocked') {
         result = tasks.filter(t => t.blocked_by && t.blocked_by.length > 0);

[Killed] EqualityOperator
src/hooks/use-tasks.ts:134:18
         );
       } else if (currentView === 'upcoming') {
         result = tasks.filter(t => t.date && t.date >= today);
-      } else if (currentView === 'blocked') {
+      } else if (currentView !== 'blocked') {
         result = tasks.filter(t => t.blocked_by && t.blocked_by.length > 0);
       }
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:134:18
         );
       } else if (currentView === 'upcoming') {
         result = tasks.filter(t => t.date && t.date >= today);
-      } else if (currentView === 'blocked') {
+      } else if (true) {
         result = tasks.filter(t => t.blocked_by && t.blocked_by.length > 0);
       }
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ArrowFunction
src/hooks/use-tasks.ts:135:31
       } else if (currentView === 'upcoming') {
         result = tasks.filter(t => t.date && t.date >= today);
       } else if (currentView === 'blocked') {
-        result = tasks.filter(t => t.blocked_by && t.blocked_by.length > 0);
+        result = tasks.filter(() => undefined);
       }
     }

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:135:36
       } else if (currentView === 'upcoming') {
         result = tasks.filter(t => t.date && t.date >= today);
       } else if (currentView === 'blocked') {
-        result = tasks.filter(t => t.blocked_by && t.blocked_by.length > 0);
+        result = tasks.filter(t => false);
       }
     }

[Killed] ArrowFunction
src/hooks/use-tasks.ts:140:28
     }
 
     // Filter out completed tasks
-    result = result.filter(t => !t.completed);
+    result = result.filter(() => undefined);
 
     // Apply additional filters
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[Killed] MethodExpression
src/hooks/use-tasks.ts:140:14
     }
 
     // Filter out completed tasks
-    result = result.filter(t => !t.completed);
+    result = result;
 
     // Apply additional filters
killedBy: useTasks visibleTasks should filter completed tasks
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:143:9
     result = result.filter(t => !t.completed);
 
     // Apply additional filters
-    if (filterListId !== undefined) {
+    if (true) {
       result = result.filter(t => t.list_id === filterListId);
     }
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/hooks/use-tasks.ts:143:9
     result = result.filter(t => !t.completed);
 
     // Apply additional filters
-    if (filterListId !== undefined) {
+    if (filterListId === undefined) {
       result = result.filter(t => t.list_id === filterListId);
     }
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] EqualityOperator
src/hooks/use-tasks.ts:144:35
 
     // Apply additional filters
     if (filterListId !== undefined) {
-      result = result.filter(t => t.list_id === filterListId);
+      result = result.filter(t => t.list_id !== filterListId);
     }
     if (filterLabelIds.length > 0) {

[Survived] MethodExpression
src/hooks/use-tasks.ts:144:16
 
     // Apply additional filters
     if (filterListId !== undefined) {
-      result = result.filter(t => t.list_id === filterListId);
+      result = result;
     }
     if (filterLabelIds.length > 0) {

[Survived] EqualityOperator
src/hooks/use-tasks.ts:146:9
     if (filterListId !== undefined) {
       result = result.filter(t => t.list_id === filterListId);
     }
-    if (filterLabelIds.length > 0) {
+    if (filterLabelIds.length <= 0) {
       result = result.filter(t =>
         filterLabelIds.every(id => t.labels?.some(l => l.id === id))

[Survived] EqualityOperator
src/hooks/use-tasks.ts:146:9
     if (filterListId !== undefined) {
       result = result.filter(t => t.list_id === filterListId);
     }
-    if (filterLabelIds.length > 0) {
+    if (filterLabelIds.length >= 0) {
       result = result.filter(t =>
         filterLabelIds.every(id => t.labels?.some(l => l.id === id))

[Survived] ArrowFunction
src/hooks/use-tasks.ts:147:30
       result = result.filter(t => t.list_id === filterListId);
     }
     if (filterLabelIds.length > 0) {
-      result = result.filter(t =>
-        filterLabelIds.every(id => t.labels?.some(l => l.id === id))
+      result = result.filter(() => undefined
       );
     }

[Survived] MethodExpression
src/hooks/use-tasks.ts:147:16
       result = result.filter(t => t.list_id === filterListId);
     }
     if (filterLabelIds.length > 0) {
-      result = result.filter(t =>
-        filterLabelIds.every(id => t.labels?.some(l => l.id === id))
-      );
+      result = result;
     }
     if (filterPriority !== undefined && filterPriority !== 'none') {

[NoCoverage] OptionalChaining
src/hooks/use-tasks.ts:148:36
     }
     if (filterLabelIds.length > 0) {
       result = result.filter(t =>
-        filterLabelIds.every(id => t.labels?.some(l => l.id === id))
+        filterLabelIds.every(id => t.labels.some(l => l.id === id))
       );
     }

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:148:56
     }
     if (filterLabelIds.length > 0) {
       result = result.filter(t =>
-        filterLabelIds.every(id => t.labels?.some(l => l.id === id))
+        filterLabelIds.every(id => t.labels?.some(l => false))
       );
     }

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:151:9
         filterLabelIds.every(id => t.labels?.some(l => l.id === id))
       );
     }
-    if (filterPriority !== undefined && filterPriority !== 'none') {
+    if (true) {
       result = result.filter(t => t.priority === filterPriority);
     }
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:151:9
         filterLabelIds.every(id => t.labels?.some(l => l.id === id))
       );
     }
-    if (filterPriority !== undefined && filterPriority !== 'none') {
+    if (true && filterPriority !== 'none') {
       result = result.filter(t => t.priority === filterPriority);
     }
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:152:35
       );
     }
     if (filterPriority !== undefined && filterPriority !== 'none') {
-      result = result.filter(t => t.priority === filterPriority);
+      result = result.filter(t => false);
     }
 

[NoCoverage] EqualityOperator
src/hooks/use-tasks.ts:152:35
       );
     }
     if (filterPriority !== undefined && filterPriority !== 'none') {
-      result = result.filter(t => t.priority === filterPriority);
+      result = result.filter(t => t.priority !== filterPriority);
     }
 

[Killed] ArrayDeclaration
src/hooks/use-tasks.ts:156:20
     }
 
     // Apply sorting with stable sort
-    const sorted = [...result].sort((a, b) => {
+    const sorted = [].sort((a, b) => {
       let aValue: string | number, bValue: string | number;
 
killedBy: useTasks visibleTasks should return all tasks when view is 'all'
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:160:9
       let aValue: string | number, bValue: string | number;
 
       switch (sortBy) {
-        case 'name':
-          aValue = a.name.toLowerCase();
-          bValue = b.name.toLowerCase();
-          break;
+        case 'name':
         case 'date':
           aValue = a.date || 'zzz';

[Survived] StringLiteral
src/hooks/use-tasks.ts:160:14
       let aValue: string | number, bValue: string | number;
 
       switch (sortBy) {
-        case 'name':
+        case "":
           aValue = a.name.toLowerCase();
           bValue = b.name.toLowerCase();

[NoCoverage] MethodExpression
src/hooks/use-tasks.ts:161:20
 
       switch (sortBy) {
         case 'name':
-          aValue = a.name.toLowerCase();
+          aValue = a.name.toUpperCase();
           bValue = b.name.toLowerCase();
           break;

[NoCoverage] MethodExpression
src/hooks/use-tasks.ts:162:20
       switch (sortBy) {
         case 'name':
           aValue = a.name.toLowerCase();
-          bValue = b.name.toLowerCase();
+          bValue = b.name.toUpperCase();
           break;
         case 'date':

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:164:9
           aValue = a.name.toLowerCase();
           bValue = b.name.toLowerCase();
           break;
-        case 'date':
-          aValue = a.date || 'zzz';
-          bValue = b.date || 'zzz';
-          break;
+        case 'date':
         case 'deadline':
           aValue = a.deadline || 'zzz';

[Survived] StringLiteral
src/hooks/use-tasks.ts:164:14
           aValue = a.name.toLowerCase();
           bValue = b.name.toLowerCase();
           break;
-        case 'date':
+        case "":
           aValue = a.date || 'zzz';
           bValue = b.date || 'zzz';

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:165:20
           bValue = b.name.toLowerCase();
           break;
         case 'date':
-          aValue = a.date || 'zzz';
+          aValue = false;
           bValue = b.date || 'zzz';
           break;

[Survived] LogicalOperator
src/hooks/use-tasks.ts:165:20
           bValue = b.name.toLowerCase();
           break;
         case 'date':
-          aValue = a.date || 'zzz';
+          aValue = a.date && 'zzz';
           bValue = b.date || 'zzz';
           break;

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:166:20
           break;
         case 'date':
           aValue = a.date || 'zzz';
-          bValue = b.date || 'zzz';
+          bValue = true;
           break;
         case 'deadline':

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:166:20
           break;
         case 'date':
           aValue = a.date || 'zzz';
-          bValue = b.date || 'zzz';
+          bValue = false;
           break;
         case 'deadline':

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:168:9
           aValue = a.date || 'zzz';
           bValue = b.date || 'zzz';
           break;
-        case 'deadline':
-          aValue = a.deadline || 'zzz';
-          bValue = b.deadline || 'zzz';
-          break;
+        case 'deadline':
         case 'priority':
           aValue = PRIORITY_ORDER[a.priority];

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:169:20
           bValue = b.date || 'zzz';
           break;
         case 'deadline':
-          aValue = a.deadline || 'zzz';
+          aValue = true;
           bValue = b.deadline || 'zzz';
           break;

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:169:20
           bValue = b.date || 'zzz';
           break;
         case 'deadline':
-          aValue = a.deadline || 'zzz';
+          aValue = false;
           bValue = b.deadline || 'zzz';
           break;

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:170:20
           break;
         case 'deadline':
           aValue = a.deadline || 'zzz';
-          bValue = b.deadline || 'zzz';
+          bValue = true;
           break;
         case 'priority':

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:170:20
           break;
         case 'deadline':
           aValue = a.deadline || 'zzz';
-          bValue = b.deadline || 'zzz';
+          bValue = false;
           break;
         case 'priority':

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:172:9
           aValue = a.deadline || 'zzz';
           bValue = b.deadline || 'zzz';
           break;
-        case 'priority':
-          aValue = PRIORITY_ORDER[a.priority];
-          bValue = PRIORITY_ORDER[b.priority];
-          break;
+        case 'priority':
         case 'created_at':
           aValue = a.created_at;

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:176:9
           aValue = PRIORITY_ORDER[a.priority];
           bValue = PRIORITY_ORDER[b.priority];
           break;
-        case 'created_at':
-          aValue = a.created_at;
-          bValue = b.created_at;
-          break;
+        case 'created_at':
         case 'updated_at':
           aValue = a.updated_at;

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:180:9
           aValue = a.created_at;
           bValue = b.created_at;
           break;
-        case 'updated_at':
-          aValue = a.updated_at;
-          bValue = b.updated_at;
-          break;
+        case 'updated_at':
         default:
           aValue = a.date || 'zzz';
