[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:829:55
       const stmt = db.prepare(
         'INSERT INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'
       );
-      for (const blockingTaskId of input.blocker_ids) {
-        stmt.run(id, blockingTaskId);
-      }
+      for (const blockingTaskId of input.blocker_ids) {}
     }
   }

[Killed] OptionalChaining
src/lib/actions/tasks.ts:841:7
     // Broadcast task update for real-time updates
     await broadcastTaskUpdate(
       id,
-      user?.id ?? 0,
+      user.id ?? 0,
       {
         id: task.id,
killedBy: Reminder Actions getDueReminders should not return reminders for completed tasks
statusReason: Cannot read properties of null (reading 'id')

[Survived] LogicalOperator
src/lib/actions/tasks.ts:841:7
     // Broadcast task update for real-time updates
     await broadcastTaskUpdate(
       id,
-      user?.id ?? 0,
+      user?.id && 0,
       {
         id: task.id,

[Survived] ObjectLiteral
src/lib/actions/tasks.ts:842:7
     await broadcastTaskUpdate(
       id,
       user?.id ?? 0,
-      {
-        id: task.id,
-        name: task.name,
-        description: task.description,
-        list_id: task.list_id,
-        date: task.date,
-        deadline: task.deadline,
-        priority: task.priority,
-        completed: task.completed,
-        assignee_id: task.assignee_id,
-        archived: task.archived,
-      },
+      {},
       'updated'
     );

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:859:21
   }
 
   if (!task) {
-    throw new Error('Task not found');
+    throw new Error("");
   }
   return task;

[Survived] BooleanLiteral
src/lib/actions/tasks.ts:870:19
   const userId = user?.id ?? 0;
 
   // Verify user ownership before deleting
-  let hasAccess = false;
+  let hasAccess = true;
   if (user?.id) {
     const existing = db

[Killed] BlockStatement
src/lib/actions/tasks.ts:871:17
 
   // Verify user ownership before deleting
   let hasAccess = false;
-  if (user?.id) {
-    const existing = db
-      .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
-      .get(id, user.id);
-    hasAccess = !!existing;
-  } else {
+  if (user?.id) {} else {
     hasAccess = true;
   }
killedBy: Task Actions Tasks should delete a task
statusReason: Task not found or access denied

[Survived] OptionalChaining
src/lib/actions/tasks.ts:871:7
 
   // Verify user ownership before deleting
   let hasAccess = false;
-  if (user?.id) {
+  if (user.id) {
     const existing = db
       .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')

[Killed] StringLiteral
src/lib/actions/tasks.ts:873:16
   let hasAccess = false;
   if (user?.id) {
     const existing = db
-      .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
+      .prepare("")
       .get(id, user.id);
     hasAccess = !!existing;
killedBy: Task Actions Tasks should delete a task
statusReason: Task not found or access denied

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:875:18
     const existing = db
       .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
       .get(id, user.id);
-    hasAccess = !!existing;
+    hasAccess = !existing;
   } else {
     hasAccess = true;
killedBy: Task Actions Tasks should delete a task
statusReason: Task not found or access denied

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:876:10
       .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
       .get(id, user.id);
     hasAccess = !!existing;
-  } else {
-    hasAccess = true;
-  }
+  } else {}
 
   if (!hasAccess) {

[NoCoverage] BooleanLiteral
src/lib/actions/tasks.ts:877:17
       .get(id, user.id);
     hasAccess = !!existing;
   } else {
-    hasAccess = true;
+    hasAccess = false;
   }
 

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:880:7
     hasAccess = true;
   }
 
-  if (!hasAccess) {
+  if (hasAccess) {
     throw new Error('Task not found or access denied');
   }
killedBy: Task Actions Tasks should delete a task
statusReason: Task not found or access denied

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:880:7
     hasAccess = true;
   }
 
-  if (!hasAccess) {
+  if (true) {
     throw new Error('Task not found or access denied');
   }
killedBy: Task Actions Tasks should delete a task
statusReason: Task not found or access denied

[Survived] ObjectLiteral
src/lib/actions/tasks.ts:890:5
   await broadcastTaskUpdate(
     id,
     userId,
-    {
-      id,
-      deleted: true,
-    },
+    {},
     'deleted'
   );

[Survived] BooleanLiteral
src/lib/actions/tasks.ts:892:16
     userId,
     {
       id,
-      deleted: true,
+      deleted: false,
     },
     'deleted'

[Killed] EqualityOperator
src/lib/actions/tasks.ts:911:7
   const db = getDb();
   const user = await getCurrentUser();
 
-  if (taskIds.length === 0) return;
+  if (taskIds.length !== 0) return;
 
   const placeholders = taskIds.map(() => '?').join(',');
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: expected 'low' to be 'high' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:911:7
   const db = getDb();
   const user = await getCurrentUser();
 
-  if (taskIds.length === 0) return;
+  if (true) return;
 
   const placeholders = taskIds.map(() => '?').join(',');
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: expected 'low' to be 'high' // Object.is equality

[Survived] ArrowFunction
src/lib/actions/tasks.ts:913:36
 
   if (taskIds.length === 0) return;
 
-  const placeholders = taskIds.map(() => '?').join(',');
+  const placeholders = taskIds.map(() => undefined).join(',');
 
   // Build UPDATE SET clause

[Survived] StringLiteral
src/lib/actions/tasks.ts:913:42
 
   if (taskIds.length === 0) return;
 
-  const placeholders = taskIds.map(() => '?').join(',');
+  const placeholders = taskIds.map(() => "").join(',');
 
   // Build UPDATE SET clause

[Survived] ArrayDeclaration
src/lib/actions/tasks.ts:916:28
   const placeholders = taskIds.map(() => '?').join(',');
 
   // Build UPDATE SET clause
-  const fields: string[] = [];
+  const fields: string[] = ["Stryker was here"];
   const values: unknown[] = [];
 

[Survived] EqualityOperator
src/lib/actions/tasks.ts:919:7
   const fields: string[] = [];
   const values: unknown[] = [];
 
-  if (updates.list_id !== undefined) {
+  if (updates.list_id === undefined) {
     fields.push('list_id = ?');
     values.push(updates.list_id);

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:919:38
   const fields: string[] = [];
   const values: unknown[] = [];
 
-  if (updates.list_id !== undefined) {
-    fields.push('list_id = ?');
-    values.push(updates.list_id);
-  }
+  if (updates.list_id !== undefined) {}
   if (updates.priority !== undefined) {
     fields.push('priority = ?');

[Killed] EqualityOperator
src/lib/actions/tasks.ts:923:7
     fields.push('list_id = ?');
     values.push(updates.list_id);
   }
-  if (updates.priority !== undefined) {
+  if (updates.priority === undefined) {
     fields.push('priority = ?');
     values.push(updates.priority);
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: expected 'low' to be 'high' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:923:7
     fields.push('list_id = ?');
     values.push(updates.list_id);
   }
-  if (updates.priority !== undefined) {
+  if (false) {
     fields.push('priority = ?');
     values.push(updates.priority);
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: expected 'low' to be 'high' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:927:7
     fields.push('priority = ?');
     values.push(updates.priority);
   }
-  if (updates.completed !== undefined) {
+  if (false) {
     fields.push('completed = ?, completed_at = ?');
     values.push(
killedBy: Task Actions Bulk Operations should bulk complete tasks
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:927:40
     fields.push('priority = ?');
     values.push(updates.priority);
   }
-  if (updates.completed !== undefined) {
-    fields.push('completed = ?, completed_at = ?');
-    values.push(
-      updates.completed ? 1 : 0,
-      updates.completed ? new Date().toISOString() : null
-    );
-  }
+  if (updates.completed !== undefined) {}
   if (updates.archived !== undefined) {
     fields.push('archived = ?');
killedBy: Task Actions Bulk Operations should bulk complete tasks
statusReason: expected +0 to be 1 // Object.is equality

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:934:39
       updates.completed ? new Date().toISOString() : null
     );
   }
-  if (updates.archived !== undefined) {
-    fields.push('archived = ?');
-    values.push(updates.archived ? 1 : 0);
-  }
+  if (updates.archived !== undefined) {}
 
   if (fields.length > 0) {

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:934:7
       updates.completed ? new Date().toISOString() : null
     );
   }
-  if (updates.archived !== undefined) {
+  if (false) {
     fields.push('archived = ?');
     values.push(updates.archived ? 1 : 0);

[Killed] BlockStatement
src/lib/actions/tasks.ts:939:26
     values.push(updates.archived ? 1 : 0);
   }
 
-  if (fields.length > 0) {
-    fields.push('updated_at = CURRENT_TIMESTAMP');
-
-    // Batch update all tasks at once
-    const allValues = [...values, ...taskIds];
-    if (user?.id) {
-      // Filter to only update tasks owned by user
-      db.prepare(
-        `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders}) AND user_id = ?`
-      ).run(...allValues, user.id);
-    } else {
-      db.prepare(
-        `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders})`
-      ).run(...allValues);
-    }
-
-    // Log completion for completed tasks
-    if (updates.completed) {
-      const ownedTaskIds = taskIds;
-      for (const taskId of ownedTaskIds) {
-        logTaskAction(taskId, 'completed', 'Task marked as completed (bulk)');
-      }
-    }
-  }
+  if (fields.length > 0) {}
 
   // Handle label updates in batch
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: expected 'low' to be 'high' // Object.is equality

[Killed] ArrayDeclaration
src/lib/actions/tasks.ts:943:23
     fields.push('updated_at = CURRENT_TIMESTAMP');
 
     // Batch update all tasks at once
-    const allValues = [...values, ...taskIds];
+    const allValues = [];
     if (user?.id) {
       // Filter to only update tasks owned by user
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: expected 1 to be 'high' // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:944:19
 
     // Batch update all tasks at once
     const allValues = [...values, ...taskIds];
-    if (user?.id) {
-      // Filter to only update tasks owned by user
-      db.prepare(
-        `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders}) AND user_id = ?`
-      ).run(...allValues, user.id);
-    } else {
+    if (user?.id) {} else {
       db.prepare(
         `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders})`
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: expected 'low' to be 'high' // Object.is equality

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:944:9
 
     // Batch update all tasks at once
     const allValues = [...values, ...taskIds];
-    if (user?.id) {
+    if (false) {
       // Filter to only update tasks owned by user
       db.prepare(

[Killed] StringLiteral
src/lib/actions/tasks.ts:947:41
     if (user?.id) {
       // Filter to only update tasks owned by user
       db.prepare(
-        `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders}) AND user_id = ?`
+        `UPDATE tasks SET ${fields.join("")} WHERE id IN (${placeholders}) AND user_id = ?`
       ).run(...allValues, user.id);
     } else {
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: expected 'low' to be 'high' // Object.is equality

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:949:12
       db.prepare(
         `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders}) AND user_id = ?`
       ).run(...allValues, user.id);
-    } else {
-      db.prepare(
-        `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders})`
-      ).run(...allValues);
-    }
+    } else {}
 
     // Log completion for completed tasks

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:951:9
       ).run(...allValues, user.id);
     } else {
       db.prepare(
-        `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders})`
+        ``
       ).run(...allValues);
     }

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:951:41
       ).run(...allValues, user.id);
     } else {
       db.prepare(
-        `UPDATE tasks SET ${fields.join(', ')} WHERE id IN (${placeholders})`
+        `UPDATE tasks SET ${fields.join("")} WHERE id IN (${placeholders})`
       ).run(...allValues);
     }

[Survived] BlockStatement
src/lib/actions/tasks.ts:956:28
     }
 
     // Log completion for completed tasks
-    if (updates.completed) {
-      const ownedTaskIds = taskIds;
-      for (const taskId of ownedTaskIds) {
-        logTaskAction(taskId, 'completed', 'Task marked as completed (bulk)');
-      }
-    }
+    if (updates.completed) {}
   }
 

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:956:9
     }
 
     // Log completion for completed tasks
-    if (updates.completed) {
+    if (true) {
       const ownedTaskIds = taskIds;
       for (const taskId of ownedTaskIds) {

[Survived] BlockStatement
src/lib/actions/tasks.ts:958:42
     // Log completion for completed tasks
     if (updates.completed) {
       const ownedTaskIds = taskIds;
-      for (const taskId of ownedTaskIds) {
-        logTaskAction(taskId, 'completed', 'Task marked as completed (bulk)');
-      }
+      for (const taskId of ownedTaskIds) {}
     }
   }

[Survived] StringLiteral
src/lib/actions/tasks.ts:959:31
     if (updates.completed) {
       const ownedTaskIds = taskIds;
       for (const taskId of ownedTaskIds) {
-        logTaskAction(taskId, 'completed', 'Task marked as completed (bulk)');
+        logTaskAction(taskId, "", 'Task marked as completed (bulk)');
       }
     }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:965:7
   }
 
   // Handle label updates in batch
-  if (updates.label_ids !== undefined) {
+  if (true) {
     // Delete all existing labels for the affected tasks
     if (user?.id) {
killedBy: Task Actions Bulk Operations should bulk update task priorities
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/lib/actions/tasks.ts:965:7
   }
 
   // Handle label updates in batch
-  if (updates.label_ids !== undefined) {
+  if (updates.label_ids === undefined) {
     // Delete all existing labels for the affected tasks
     if (user?.id) {
killedBy: Task Actions - Comprehensive Tests Task Operations bulkUpdateTasks should update multiple tasks
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] OptionalChaining
src/lib/actions/tasks.ts:967:9
   // Handle label updates in batch
   if (updates.label_ids !== undefined) {
     // Delete all existing labels for the affected tasks
-    if (user?.id) {
+    if (user.id) {
       db.prepare(
         `DELETE FROM task_labels WHERE task_id IN (${placeholders}) AND task_id IN (SELECT id FROM tasks WHERE user_id = ?)`

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:967:19
   // Handle label updates in batch
   if (updates.label_ids !== undefined) {
     // Delete all existing labels for the affected tasks
-    if (user?.id) {
-      db.prepare(
-        `DELETE FROM task_labels WHERE task_id IN (${placeholders}) AND task_id IN (SELECT id FROM tasks WHERE user_id = ?)`
-      ).run(...taskIds, user.id);
-    } else {
+    if (user?.id) {} else {
       db.prepare(
         `DELETE FROM task_labels WHERE task_id IN (${placeholders})`

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:971:12
       db.prepare(
         `DELETE FROM task_labels WHERE task_id IN (${placeholders}) AND task_id IN (SELECT id FROM tasks WHERE user_id = ?)`
       ).run(...taskIds, user.id);
-    } else {
-      db.prepare(
-        `DELETE FROM task_labels WHERE task_id IN (${placeholders})`
-      ).run(...taskIds);
-    }
+    } else {}
 
     // Insert new labels

[NoCoverage] EqualityOperator
src/lib/actions/tasks.ts:978:9
     }
 
     // Insert new labels
-    if (updates.label_ids.length > 0) {
+    if (updates.label_ids.length <= 0) {
       const stmt = db.prepare(
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'

[NoCoverage] EqualityOperator
src/lib/actions/tasks.ts:978:9
     }
 
     // Insert new labels
-    if (updates.label_ids.length > 0) {
+    if (updates.label_ids.length >= 0) {
       const stmt = db.prepare(
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:982:37
       const stmt = db.prepare(
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'
       );
-      for (const taskId of taskIds) {
-        for (const labelId of updates.label_ids) {
-          stmt.run(taskId, labelId);
-        }
-      }
+      for (const taskId of taskIds) {}
     }
   }

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:983:50
         'INSERT INTO task_labels (task_id, label_id) VALUES (?, ?)'
       );
       for (const taskId of taskIds) {
-        for (const labelId of updates.label_ids) {
-          stmt.run(taskId, labelId);
-        }
+        for (const labelId of updates.label_ids) {}
       }
     }

[Killed] OptionalChaining
src/lib/actions/tasks.ts:997:18
 
   if (taskIds.length === 0) return;
 
-  const userId = user?.id ?? 0;
+  const userId = user.id ?? 0;
 
   // Batch delete using IN clause for better performance
killedBy: Task Actions - Archive/Recurring Functions bulkDeleteTasks should work without authenticated user in test environment
statusReason: Cannot read properties of null (reading 'id')

[Survived] LogicalOperator
src/lib/actions/tasks.ts:997:18
 
   if (taskIds.length === 0) return;
 
-  const userId = user?.id ?? 0;
+  const userId = user?.id && 0;
 
   // Batch delete using IN clause for better performance

[Survived] ArrowFunction
src/lib/actions/tasks.ts:1000:36
   const userId = user?.id ?? 0;
 
   // Batch delete using IN clause for better performance
-  const placeholders = taskIds.map(() => '?').join(',');
+  const placeholders = taskIds.map(() => undefined).join(',');
 
   if (user?.id) {

[Survived] StringLiteral
src/lib/actions/tasks.ts:1000:52
   const userId = user?.id ?? 0;
 
   // Batch delete using IN clause for better performance
-  const placeholders = taskIds.map(() => '?').join(',');
+  const placeholders = taskIds.map(() => '?').join("");
 
   if (user?.id) {

[Killed] BlockStatement
src/lib/actions/tasks.ts:1002:17
   // Batch delete using IN clause for better performance
   const placeholders = taskIds.map(() => '?').join(',');
 
-  if (user?.id) {
-    // Only delete tasks owned by user
-    db.prepare(
-      `DELETE FROM tasks WHERE id IN (${placeholders}) AND user_id = ?`
-    ).run(...taskIds, user.id);
-  } else {
+  if (user?.id) {} else {
     db.prepare(`DELETE FROM tasks WHERE id IN (${placeholders})`).run(
       ...taskIds
killedBy: Task Actions - Archive/Recurring Functions bulkDeleteTasks should delete multiple tasks
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1002:7
   // Batch delete using IN clause for better performance
   const placeholders = taskIds.map(() => '?').join(',');
 
-  if (user?.id) {
+  if (true) {
     // Only delete tasks owned by user
     db.prepare(
killedBy: Task Actions - Archive/Recurring Functions bulkDeleteTasks should work without authenticated user in test environment
statusReason: Cannot read properties of null (reading 'id')

[Killed] BlockStatement
src/lib/actions/tasks.ts:1007:10
     db.prepare(
       `DELETE FROM tasks WHERE id IN (${placeholders}) AND user_id = ?`
     ).run(...taskIds, user.id);
-  } else {
-    db.prepare(`DELETE FROM tasks WHERE id IN (${placeholders})`).run(
-      ...taskIds
-    );
-  }
+  } else {}
 
   // Broadcast task deletions for real-time updates
killedBy: Task Actions - Archive/Recurring Functions bulkDeleteTasks should work without authenticated user in test environment
statusReason: expected 1 to be +0 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1014:33
   }
 
   // Broadcast task deletions for real-time updates
-  for (const taskId of taskIds) {
-    await broadcastTaskUpdate(
-      taskId,
-      userId,
-      {
-        id: taskId,
-        deleted: true,
-      },
-      'deleted'
-    );
-  }
+  for (const taskId of taskIds) {}
 }
 

[Survived] BooleanLiteral
src/lib/actions/tasks.ts:1020:18
       userId,
       {
         id: taskId,
-        deleted: true,
+        deleted: false,
       },
       'deleted'

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1062:7
 ): Promise<BatchOperationResult> {
   const user = await getCurrentUser();
 
-  if (!user?.id && process.env.NODE_ENV !== 'test') {
+  if (true) {
     return {
       success: false,
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - add-dependencies should add dependencies using batch operation
statusReason: expected false to be true // Object.is equality

[NoCoverage] EqualityOperator
src/lib/actions/tasks.ts:1062:20
 ): Promise<BatchOperationResult> {
   const user = await getCurrentUser();
 
-  if (!user?.id && process.env.NODE_ENV !== 'test') {
+  if (!user?.id && process.env.NODE_ENV === 'test') {
     return {
       success: false,

[Survived] LogicalOperator
src/lib/actions/tasks.ts:1071:18
   }
 
   // In test mode, user might be null, so use 0 as fallback
-  const userId = user?.id ?? 0;
+  const userId = user?.id && 0;
 
   let affectedCount = 0;

[Survived] OptionalChaining
src/lib/actions/tasks.ts:1071:18
   }
 
   // In test mode, user might be null, so use 0 as fallback
-  const userId = user?.id ?? 0;
+  const userId = user.id ?? 0;
 
   let affectedCount = 0;

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1077:7
 
   try {
     switch (operation.type) {
-      case 'complete': {
-        affectedCount = await completeTasks(operation.ids, userId);
-        // Broadcast completion for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              completed: true,
-            },
-            'completed'
-          );
-        }
-        break;
-      }
+      case 'complete':
       case 'uncomplete': {
         affectedCount = await uncompleteTasks(operation.ids, userId);

[Survived] BlockStatement
src/lib/actions/tasks.ts:1077:24
 
   try {
     switch (operation.type) {
-      case 'complete': {
-        affectedCount = await completeTasks(operation.ids, userId);
-        // Broadcast completion for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              completed: true,
-            },
-            'completed'
-          );
-        }
-        break;
-      }
+      case 'complete': {}
       case 'uncomplete': {
         affectedCount = await uncompleteTasks(operation.ids, userId);

[Survived] BlockStatement
src/lib/actions/tasks.ts:1080:41
       case 'complete': {
         affectedCount = await completeTasks(operation.ids, userId);
         // Broadcast completion for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              completed: true,
-            },
-            'completed'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[Survived] BooleanLiteral
src/lib/actions/tasks.ts:1086:26
             userId,
             {
               id,
-              completed: true,
+              completed: false,
             },
             'completed'

[Survived] StringLiteral
src/lib/actions/tasks.ts:1088:13
               id,
               completed: true,
             },
-            'completed'
+            ""
           );
         }

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:1093:7
         }
         break;
       }
-      case 'uncomplete': {
-        affectedCount = await uncompleteTasks(operation.ids, userId);
-        // Broadcast uncompletion for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              completed: false,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'uncomplete':
       case 'delete': {
         affectedCount = await deleteTasks(operation.ids, userId);

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1093:26
         }
         break;
       }
-      case 'uncomplete': {
-        affectedCount = await uncompleteTasks(operation.ids, userId);
-        // Broadcast uncompletion for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              completed: false,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'uncomplete': {}
       case 'delete': {
         affectedCount = await deleteTasks(operation.ids, userId);

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1096:41
       case 'uncomplete': {
         affectedCount = await uncompleteTasks(operation.ids, userId);
         // Broadcast uncompletion for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              completed: false,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[NoCoverage] BooleanLiteral
src/lib/actions/tasks.ts:1102:26
             userId,
             {
               id,
-              completed: false,
+              completed: true,
             },
             'updated'

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:1104:13
               id,
               completed: false,
             },
-            'updated'
+            ""
           );
         }

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:1109:7
         }
         break;
       }
-      case 'delete': {
-        affectedCount = await deleteTasks(operation.ids, userId);
-        // Broadcast deletions for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              deleted: true,
-            },
-            'deleted'
-          );
-        }
-        break;
-      }
+      case 'delete':
       case 'archive': {
         affectedCount = await archiveTasks(operation.ids, userId);

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1109:22
         }
         break;
       }
-      case 'delete': {
-        affectedCount = await deleteTasks(operation.ids, userId);
-        // Broadcast deletions for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              deleted: true,
-            },
-            'deleted'
-          );
-        }
-        break;
-      }
+      case 'delete': {}
       case 'archive': {
         affectedCount = await archiveTasks(operation.ids, userId);

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1112:41
       case 'delete': {
         affectedCount = await deleteTasks(operation.ids, userId);
         // Broadcast deletions for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              deleted: true,
-            },
-            'deleted'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:1125:7
         }
         break;
       }
-      case 'archive': {
-        affectedCount = await archiveTasks(operation.ids, userId);
-        // Broadcast archiving for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              archived: true,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'archive':
       case 'unarchive': {
         affectedCount = await unarchiveTasks(operation.ids, userId);
