[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:184:9
           aValue = a.updated_at;
           bValue = b.updated_at;
           break;
-        default:
-          aValue = a.date || 'zzz';
-          bValue = b.date || 'zzz';
+        default:
       }
 

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:185:20
           bValue = b.updated_at;
           break;
         default:
-          aValue = a.date || 'zzz';
+          aValue = true;
           bValue = b.date || 'zzz';
       }

[NoCoverage] LogicalOperator
src/hooks/use-tasks.ts:185:20
           bValue = b.updated_at;
           break;
         default:
-          aValue = a.date || 'zzz';
+          aValue = a.date && 'zzz';
           bValue = b.date || 'zzz';
       }

[NoCoverage] LogicalOperator
src/hooks/use-tasks.ts:186:20
           break;
         default:
           aValue = a.date || 'zzz';
-          bValue = b.date || 'zzz';
+          bValue = b.date && 'zzz';
       }
 

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:189:11
           bValue = b.date || 'zzz';
       }
 
-      if (aValue < bValue) return sortDirection === 'asc' ? -1 : 1;
+      if (true) return sortDirection === 'asc' ? -1 : 1;
       if (aValue > bValue) return sortDirection === 'asc' ? 1 : -1;
       return 0;

[NoCoverage] ConditionalExpression
src/hooks/use-tasks.ts:189:35
           bValue = b.date || 'zzz';
       }
 
-      if (aValue < bValue) return sortDirection === 'asc' ? -1 : 1;
+      if (aValue < bValue) return false ? -1 : 1;
       if (aValue > bValue) return sortDirection === 'asc' ? 1 : -1;
       return 0;

[Survived] EqualityOperator
src/hooks/use-tasks.ts:190:11
       }
 
       if (aValue < bValue) return sortDirection === 'asc' ? -1 : 1;
-      if (aValue > bValue) return sortDirection === 'asc' ? 1 : -1;
+      if (aValue <= bValue) return sortDirection === 'asc' ? 1 : -1;
       return 0;
     });

[NoCoverage] UnaryOperator
src/hooks/use-tasks.ts:190:65
       }
 
       if (aValue < bValue) return sortDirection === 'asc' ? -1 : 1;
-      if (aValue > bValue) return sortDirection === 'asc' ? 1 : -1;
+      if (aValue > bValue) return sortDirection === 'asc' ? 1 : +1;
       return 0;
     });

[Killed] BlockStatement
src/hooks/use-tasks.ts:209:38
   ]); // priorityOrder is a stable constant (no deps)
 
   // Calculate overdue count
-  const overdueCount = useMemo(() => {
-    return tasks.filter(
-      t =>
-        !t.completed &&
-        t.date &&
-        new Date(t.date) < new Date() &&
-        new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
-    ).length;
-  }, [tasks]);
+  const overdueCount = useMemo(() => {}, [tasks]);
 
   // Load search history from localStorage on mount
killedBy: useTasks overdueCount should count overdue tasks
statusReason: actual value must be number or bigint, received "undefined"

[Killed] MethodExpression
src/hooks/use-tasks.ts:210:12
 
   // Calculate overdue count
   const overdueCount = useMemo(() => {
-    return tasks.filter(
-      t =>
-        !t.completed &&
-        t.date &&
-        new Date(t.date) < new Date() &&
-        new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
-    ).length;
+    return tasks.length;
   }, [tasks]);
 
killedBy: useTasks overdueCount should not count completed tasks as overdue
statusReason: expected 1 to be +0 // Object.is equality

[Survived] ArrowFunction
src/hooks/use-tasks.ts:211:7
   // Calculate overdue count
   const overdueCount = useMemo(() => {
     return tasks.filter(
-      t =>
-        !t.completed &&
-        t.date &&
-        new Date(t.date) < new Date() &&
-        new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
+      () => undefined
     ).length;
   }, [tasks]);

[Killed] LogicalOperator
src/hooks/use-tasks.ts:212:9
   const overdueCount = useMemo(() => {
     return tasks.filter(
       t =>
-        !t.completed &&
-        t.date &&
-        new Date(t.date) < new Date() &&
+        !t.completed && t.date || new Date(t.date) < new Date() &&
         new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
     ).length;
killedBy: useTasks overdueCount should not count completed tasks as overdue
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/hooks/use-tasks.ts:212:9
   const overdueCount = useMemo(() => {
     return tasks.filter(
       t =>
-        !t.completed &&
+        t.completed &&
         t.date &&
         new Date(t.date) < new Date() &&
killedBy: useTasks overdueCount should not count completed tasks as overdue
statusReason: expected 1 to be +0 // Object.is equality

[Survived] EqualityOperator
src/hooks/use-tasks.ts:214:9
       t =>
         !t.completed &&
         t.date &&
-        new Date(t.date) < new Date() &&
+        new Date(t.date) <= new Date() &&
         new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
     ).length;

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:214:9
       t =>
         !t.completed &&
         t.date &&
-        new Date(t.date) < new Date() &&
+        true &&
         new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
     ).length;

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:215:9
         !t.completed &&
         t.date &&
         new Date(t.date) < new Date() &&
-        new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
+        true
     ).length;
   }, [tasks]);

[Survived] EqualityOperator
src/hooks/use-tasks.ts:215:9
         !t.completed &&
         t.date &&
         new Date(t.date) < new Date() &&
-        new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
+        new Date(t.date) >= new Date(new Date().setHours(23, 59, 59, 999))
     ).length;
   }, [tasks]);

[Survived] ArrayDeclaration
src/hooks/use-tasks.ts:217:6
         new Date(t.date) < new Date() &&
         new Date(t.date) < new Date(new Date().setHours(23, 59, 59, 999))
     ).length;
-  }, [tasks]);
+  }, []);
 
   // Load search history from localStorage on mount

[Survived] BlockStatement
src/hooks/use-tasks.ts:220:19
   }, [tasks]);
 
   // Load search history from localStorage on mount
-  useEffect(() => {
-    if (typeof window !== 'undefined') {
-      const saved = localStorage.getItem('taskSearchHistory');
-      if (saved) {
-        try {
-          setSearchHistory(JSON.parse(saved));
-        } catch {
-          // Ignore parse errors
-        }
-      }
-    }
-  }, []);
+  useEffect(() => {}, []);
 
   const handleViewChange = useCallback((view: string, listId?: number) => {

[Survived] StringLiteral
src/hooks/use-tasks.ts:222:42
   // Load search history from localStorage on mount
   useEffect(() => {
     if (typeof window !== 'undefined') {
-      const saved = localStorage.getItem('taskSearchHistory');
+      const saved = localStorage.getItem("");
       if (saved) {
         try {

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:223:11
   useEffect(() => {
     if (typeof window !== 'undefined') {
       const saved = localStorage.getItem('taskSearchHistory');
-      if (saved) {
+      if (true) {
         try {
           setSearchHistory(JSON.parse(saved));
killedBy: useTasks handleSearch should set search query
statusReason: Cannot read properties of null (reading 'filter')

[Survived] BlockStatement
src/hooks/use-tasks.ts:223:18
   useEffect(() => {
     if (typeof window !== 'undefined') {
       const saved = localStorage.getItem('taskSearchHistory');
-      if (saved) {
-        try {
-          setSearchHistory(JSON.parse(saved));
-        } catch {
-          // Ignore parse errors
-        }
-      }
+      if (saved) {}
     }
   }, []);

[Survived] BlockStatement
src/hooks/use-tasks.ts:224:13
     if (typeof window !== 'undefined') {
       const saved = localStorage.getItem('taskSearchHistory');
       if (saved) {
-        try {
-          setSearchHistory(JSON.parse(saved));
-        } catch {
+        try {} catch {
           // Ignore parse errors
         }

[Killed] BlockStatement
src/hooks/use-tasks.ts:233:75
     }
   }, []);
 
-  const handleViewChange = useCallback((view: string, listId?: number) => {
-    setCurrentView(view);
-    setCurrentListId(listId);
-    setSearchQuery('');
-    setCurrentFilterPreset(undefined);
-  }, []);
+  const handleViewChange = useCallback((view: string, listId?: number) => {}, []);
 
   const handleSearch = useCallback((query: string) => {
killedBy: useTasks handleViewChange should change view without listId
statusReason: expected 'today' to be 'upcoming' // Object.is equality

[Survived] ArrayDeclaration
src/hooks/use-tasks.ts:238:6
     setCurrentListId(listId);
     setSearchQuery('');
     setCurrentFilterPreset(undefined);
-  }, []);
+  }, ["Stryker was here"]);
 
   const handleSearch = useCallback((query: string) => {

[Killed] BlockStatement
src/hooks/use-tasks.ts:240:55
     setCurrentFilterPreset(undefined);
   }, []);
 
-  const handleSearch = useCallback((query: string) => {
-    setSearchQuery(query);
-
-    // Save to history
-    if (query.trim()) {
-      const newHistory = [
-        query.trim(),
-        ...searchHistory.filter(s => s !== query.trim()),
-      ].slice(0, 10); // Keep last 10 searches
-      setSearchHistory(newHistory);
-      // Persist to localStorage
-      if (typeof window !== 'undefined') {
-        localStorage.setItem('taskSearchHistory', JSON.stringify(newHistory));
-      }
-    }
-
-    if (query) {
-      setCurrentView('search');
-    } else {
-      setCurrentView('today');
-    }
-  }, [searchHistory]);
+  const handleSearch = useCallback((query: string) => {}, [searchHistory]);
 
   const handleFilterPresetChange = useCallback((preset?: FilterPreset) => {
killedBy: useTasks handleSearch should set search query
statusReason: expected '' to be 'test query' // Object.is equality

[Survived] MethodExpression
src/hooks/use-tasks.ts:244:9
     setSearchQuery(query);
 
     // Save to history
-    if (query.trim()) {
+    if (query) {
       const newHistory = [
         query.trim(),

[Survived] BlockStatement
src/hooks/use-tasks.ts:244:23
     setSearchQuery(query);
 
     // Save to history
-    if (query.trim()) {
-      const newHistory = [
-        query.trim(),
-        ...searchHistory.filter(s => s !== query.trim()),
-      ].slice(0, 10); // Keep last 10 searches
-      setSearchHistory(newHistory);
-      // Persist to localStorage
-      if (typeof window !== 'undefined') {
-        localStorage.setItem('taskSearchHistory', JSON.stringify(newHistory));
-      }
-    }
+    if (query.trim()) {}
 
     if (query) {

[Survived] MethodExpression
src/hooks/use-tasks.ts:245:26
 
     // Save to history
     if (query.trim()) {
-      const newHistory = [
-        query.trim(),
-        ...searchHistory.filter(s => s !== query.trim()),
-      ].slice(0, 10); // Keep last 10 searches
+      const newHistory = [query.trim(), ...searchHistory.filter(s => s !== query.trim())]; // Keep last 10 searches
       setSearchHistory(newHistory);
       // Persist to localStorage

[Survived] MethodExpression
src/hooks/use-tasks.ts:246:9
     // Save to history
     if (query.trim()) {
       const newHistory = [
-        query.trim(),
+        query,
         ...searchHistory.filter(s => s !== query.trim()),
       ].slice(0, 10); // Keep last 10 searches

[Survived] ConditionalExpression
src/hooks/use-tasks.ts:247:38
     if (query.trim()) {
       const newHistory = [
         query.trim(),
-        ...searchHistory.filter(s => s !== query.trim()),
+        ...searchHistory.filter(s => false),
       ].slice(0, 10); // Keep last 10 searches
       setSearchHistory(newHistory);

[Survived] ArrowFunction
src/hooks/use-tasks.ts:247:33
     if (query.trim()) {
       const newHistory = [
         query.trim(),
-        ...searchHistory.filter(s => s !== query.trim()),
+        ...searchHistory.filter(() => undefined),
       ].slice(0, 10); // Keep last 10 searches
       setSearchHistory(newHistory);

[Survived] EqualityOperator
src/hooks/use-tasks.ts:251:11
       ].slice(0, 10); // Keep last 10 searches
       setSearchHistory(newHistory);
       // Persist to localStorage
-      if (typeof window !== 'undefined') {
+      if (typeof window === 'undefined') {
         localStorage.setItem('taskSearchHistory', JSON.stringify(newHistory));
       }

[Survived] BlockStatement
src/hooks/use-tasks.ts:251:42
       ].slice(0, 10); // Keep last 10 searches
       setSearchHistory(newHistory);
       // Persist to localStorage
-      if (typeof window !== 'undefined') {
-        localStorage.setItem('taskSearchHistory', JSON.stringify(newHistory));
-      }
+      if (typeof window !== 'undefined') {}
     }
 

[Survived] StringLiteral
src/hooks/use-tasks.ts:252:30
       setSearchHistory(newHistory);
       // Persist to localStorage
       if (typeof window !== 'undefined') {
-        localStorage.setItem('taskSearchHistory', JSON.stringify(newHistory));
+        localStorage.setItem("", JSON.stringify(newHistory));
       }
     }

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:256:9
       }
     }
 
-    if (query) {
+    if (true) {
       setCurrentView('search');
     } else {
killedBy: useTasks handleSearch should change view to today when query is empty
statusReason: expected 'search' to be 'today' // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:256:9
       }
     }
 
-    if (query) {
+    if (false) {
       setCurrentView('search');
     } else {
killedBy: useTasks handleSearch should change view to search when query provided
statusReason: expected 'today' to be 'search' // Object.is equality

[Killed] BlockStatement
src/hooks/use-tasks.ts:258:12
 
     if (query) {
       setCurrentView('search');
-    } else {
-      setCurrentView('today');
-    }
+    } else {}
   }, [searchHistory]);
 
killedBy: useTasks handleSearch should change view to today when query is empty
statusReason: expected 'upcoming' to be 'today' // Object.is equality

[Killed] StringLiteral
src/hooks/use-tasks.ts:259:22
     if (query) {
       setCurrentView('search');
     } else {
-      setCurrentView('today');
+      setCurrentView("");
     }
   }, [searchHistory]);
killedBy: useTasks handleSearch should change view to today when query is empty
statusReason: expected '' to be 'today' // Object.is equality

[Survived] ArrayDeclaration
src/hooks/use-tasks.ts:261:6
     } else {
       setCurrentView('today');
     }
-  }, [searchHistory]);
+  }, []);
 
   const handleFilterPresetChange = useCallback((preset?: FilterPreset) => {

[Killed] BlockStatement
src/hooks/use-tasks.ts:263:75
     }
   }, [searchHistory]);
 
-  const handleFilterPresetChange = useCallback((preset?: FilterPreset) => {
-    setCurrentFilterPreset(preset);
-    if (preset) {
-      setCurrentView('all');
-    }
-  }, []);
+  const handleFilterPresetChange = useCallback((preset?: FilterPreset) => {}, []);
 
   const handleSort = useCallback((field: SortField) => {
killedBy: useTasks handleFilterPresetChange should set filter preset
statusReason: expected undefined to be 'needs_attention' // Object.is equality

[Killed] BlockStatement
src/hooks/use-tasks.ts:265:17
 
   const handleFilterPresetChange = useCallback((preset?: FilterPreset) => {
     setCurrentFilterPreset(preset);
-    if (preset) {
-      setCurrentView('all');
-    }
+    if (preset) {}
   }, []);
 
killedBy: useTasks handleFilterPresetChange should set view to 'all' when preset is set
statusReason: expected 'today' to be 'all' // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:265:9
 
   const handleFilterPresetChange = useCallback((preset?: FilterPreset) => {
     setCurrentFilterPreset(preset);
-    if (preset) {
+    if (false) {
       setCurrentView('all');
     }
killedBy: useTasks handleFilterPresetChange should set view to 'all' when preset is set
statusReason: expected 'today' to be 'all' // Object.is equality

[Killed] StringLiteral
src/hooks/use-tasks.ts:266:22
   const handleFilterPresetChange = useCallback((preset?: FilterPreset) => {
     setCurrentFilterPreset(preset);
     if (preset) {
-      setCurrentView('all');
+      setCurrentView("");
     }
   }, []);
killedBy: useTasks handleFilterPresetChange should set view to 'all' when preset is set
statusReason: expected '' to be 'all' // Object.is equality

[Killed] BlockStatement
src/hooks/use-tasks.ts:270:56
     }
   }, []);
 
-  const handleSort = useCallback((field: SortField) => {
-    setSortBy(field);
-    // Toggle direction if clicking the same field, otherwise default to asc
-    setSortDirection(prev => (prev === 'asc' ? 'desc' : 'asc'));
-  }, []);
+  const handleSort = useCallback((field: SortField) => {}, []);
 
   const handleFilterList = useCallback((listId: number | undefined) => {
killedBy: useTasks handleSort should change sort field
statusReason: expected 'date' to be 'name' // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:273:31
   const handleSort = useCallback((field: SortField) => {
     setSortBy(field);
     // Toggle direction if clicking the same field, otherwise default to asc
-    setSortDirection(prev => (prev === 'asc' ? 'desc' : 'asc'));
+    setSortDirection(prev => (true ? 'desc' : 'asc'));
   }, []);
 
killedBy: useTasks handleSort should toggle sort direction
statusReason: expected 'desc' to be 'asc' // Object.is equality

[Killed] EqualityOperator
src/hooks/use-tasks.ts:273:31
   const handleSort = useCallback((field: SortField) => {
     setSortBy(field);
     // Toggle direction if clicking the same field, otherwise default to asc
-    setSortDirection(prev => (prev === 'asc' ? 'desc' : 'asc'));
+    setSortDirection(prev => (prev !== 'asc' ? 'desc' : 'asc'));
   }, []);
 
killedBy: useTasks handleSort should toggle sort direction
statusReason: expected 'asc' to be 'desc' // Object.is equality

[Killed] BlockStatement
src/hooks/use-tasks.ts:276:72
     setSortDirection(prev => (prev === 'asc' ? 'desc' : 'asc'));
   }, []);
 
-  const handleFilterList = useCallback((listId: number | undefined) => {
-    setFilterListId(listId);
-  }, []);
+  const handleFilterList = useCallback((listId: number | undefined) => {}, []);
 
   const handleFilterLabel = useCallback((labelId: number) => {
killedBy: useTasks handleFilterList should set filter list id
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
src/hooks/use-tasks.ts:280:62
     setFilterListId(listId);
   }, []);
 
-  const handleFilterLabel = useCallback((labelId: number) => {
-    setFilterLabelIds(prev => {
-      const next = new Set(prev);
-      if (next.has(labelId)) {
-        next.delete(labelId);
-      } else {
-        next.add(labelId);
-      }
-      return Array.from(next);
-    });
-  }, []);
+  const handleFilterLabel = useCallback((labelId: number) => {}, []);
 
   const handleFilterPriority = useCallback((priority: Priority | undefined) => {
killedBy: useTasks handleFilterLabel should add label to filter
statusReason: expected [] to include 1

[Killed] BlockStatement
src/hooks/use-tasks.ts:281:31
   }, []);
 
   const handleFilterLabel = useCallback((labelId: number) => {
-    setFilterLabelIds(prev => {
-      const next = new Set(prev);
-      if (next.has(labelId)) {
-        next.delete(labelId);
-      } else {
-        next.add(labelId);
-      }
-      return Array.from(next);
-    });
+    setFilterLabelIds(prev => {});
   }, []);
 
killedBy: useTasks handleFilterLabel should add label to filter
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/hooks/use-tasks.ts:283:11
   const handleFilterLabel = useCallback((labelId: number) => {
     setFilterLabelIds(prev => {
       const next = new Set(prev);
-      if (next.has(labelId)) {
+      if (true) {
         next.delete(labelId);
       } else {
killedBy: useTasks handleFilterLabel should add label to filter
statusReason: expected [] to include 1

[Killed] BlockStatement
src/hooks/use-tasks.ts:283:30
   const handleFilterLabel = useCallback((labelId: number) => {
     setFilterLabelIds(prev => {
       const next = new Set(prev);
-      if (next.has(labelId)) {
-        next.delete(labelId);
-      } else {
+      if (next.has(labelId)) {} else {
         next.add(labelId);
       }
killedBy: useTasks handleFilterLabel should toggle label in filter
statusReason: expected [ 1 ] to not include 1

[Killed] BlockStatement
src/hooks/use-tasks.ts:285:14
       const next = new Set(prev);
       if (next.has(labelId)) {
         next.delete(labelId);
-      } else {
-        next.add(labelId);
-      }
+      } else {}
       return Array.from(next);
     });
killedBy: useTasks handleFilterLabel should add label to filter
statusReason: expected [] to include 1

[Killed] BlockStatement
src/hooks/use-tasks.ts:292:80
     });
   }, []);
 
-  const handleFilterPriority = useCallback((priority: Priority | undefined) => {
-    setFilterPriority(priority);
-  }, []);
+  const handleFilterPriority = useCallback((priority: Priority | undefined) => {}, []);
 
   const clearFilters = useCallback(() => {
killedBy: useTasks handleFilterPriority should set priority filter
statusReason: expected undefined to be 'high' // Object.is equality

[Killed] BlockStatement
src/hooks/use-tasks.ts:296:42
     setFilterPriority(priority);
   }, []);
 
-  const clearFilters = useCallback(() => {
-    setFilterListId(undefined);
-    setFilterLabelIds([]);
-    setFilterPriority(undefined);
-  }, []);
+  const clearFilters = useCallback(() => {}, []);
 
   return {
killedBy: useTasks clearFilters should clear all filters
statusReason: expected 5 to be undefined

[Survived] ArrayDeclaration
src/hooks/use-tasks.ts:300:6
     setFilterListId(undefined);
     setFilterLabelIds([]);
     setFilterPriority(undefined);
-  }, []);
+  }, ["Stryker was here"]);
 
   return {
