[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1125:23
         }
         break;
       }
-      case 'archive': {
-        affectedCount = await archiveTasks(operation.ids, userId);
-        // Broadcast archiving for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              archived: true,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'archive': {}
       case 'unarchive': {
         affectedCount = await unarchiveTasks(operation.ids, userId);

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1128:41
       case 'archive': {
         affectedCount = await archiveTasks(operation.ids, userId);
         // Broadcast archiving for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              archived: true,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[NoCoverage] ObjectLiteral
src/lib/actions/tasks.ts:1132:13
           await broadcastTaskUpdate(
             id,
             userId,
-            {
-              id,
-              archived: true,
-            },
+            {},
             'updated'
           );

[NoCoverage] BooleanLiteral
src/lib/actions/tasks.ts:1134:25
             userId,
             {
               id,
-              archived: true,
+              archived: false,
             },
             'updated'

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1141:25
         }
         break;
       }
-      case 'unarchive': {
-        affectedCount = await unarchiveTasks(operation.ids, userId);
-        // Broadcast unarchiving for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              archived: false,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'unarchive': {}
       case 'move': {
         affectedCount = await moveTasks(

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:1141:7
         }
         break;
       }
-      case 'unarchive': {
-        affectedCount = await unarchiveTasks(operation.ids, userId);
-        // Broadcast unarchiving for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              archived: false,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'unarchive':
       case 'move': {
         affectedCount = await moveTasks(

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1144:41
       case 'unarchive': {
         affectedCount = await unarchiveTasks(operation.ids, userId);
         // Broadcast unarchiving for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              archived: false,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[NoCoverage] ObjectLiteral
src/lib/actions/tasks.ts:1148:13
           await broadcastTaskUpdate(
             id,
             userId,
-            {
-              id,
-              archived: false,
-            },
+            {},
             'updated'
           );

[NoCoverage] BooleanLiteral
src/lib/actions/tasks.ts:1150:25
             userId,
             {
               id,
-              archived: false,
+              archived: true,
             },
             'updated'

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1157:20
         }
         break;
       }
-      case 'move': {
-        affectedCount = await moveTasks(
-          operation.ids,
-          operation.listId,
-          userId
-        );
-        // Broadcast move for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              list_id: operation.listId,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'move': {}
       case 'set-priority': {
         affectedCount = await setTaskPriorities(

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:1157:7
         }
         break;
       }
-      case 'move': {
-        affectedCount = await moveTasks(
-          operation.ids,
-          operation.listId,
-          userId
-        );
-        // Broadcast move for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              list_id: operation.listId,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'move':
       case 'set-priority': {
         affectedCount = await setTaskPriorities(

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1164:41
           userId
         );
         // Broadcast move for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              list_id: operation.listId,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[NoCoverage] ObjectLiteral
src/lib/actions/tasks.ts:1168:13
           await broadcastTaskUpdate(
             id,
             userId,
-            {
-              id,
-              list_id: operation.listId,
-            },
+            {},
             'updated'
           );

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1177:7
         }
         break;
       }
-      case 'set-priority': {
-        affectedCount = await setTaskPriorities(
-          operation.ids,
-          operation.priority,
-          userId
-        );
-        // Broadcast priority change for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              priority: operation.priority,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'set-priority':
       case 'add-labels': {
         affectedCount = await addLabelsToTasks(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - set-priority should set priority using batch operation
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1177:28
         }
         break;
       }
-      case 'set-priority': {
-        affectedCount = await setTaskPriorities(
-          operation.ids,
-          operation.priority,
-          userId
-        );
-        // Broadcast priority change for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              priority: operation.priority,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'set-priority': {}
       case 'add-labels': {
         affectedCount = await addLabelsToTasks(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - set-priority should set priority using batch operation
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1184:41
           userId
         );
         // Broadcast priority change for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              priority: operation.priority,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[Killed] BlockStatement
src/lib/actions/tasks.ts:1197:26
         }
         break;
       }
-      case 'add-labels': {
-        affectedCount = await addLabelsToTasks(
-          operation.ids,
-          operation.labelIds,
-          userId
-        );
-        // Broadcast label addition for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              label_ids: operation.labelIds,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'add-labels': {}
       case 'remove-labels': {
         affectedCount = await removeLabelsFromTasks(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - remove-labels should remove labels using batch operation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1197:7
         }
         break;
       }
-      case 'add-labels': {
-        affectedCount = await addLabelsToTasks(
-          operation.ids,
-          operation.labelIds,
-          userId
-        );
-        // Broadcast label addition for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              label_ids: operation.labelIds,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'add-labels':
       case 'remove-labels': {
         affectedCount = await removeLabelsFromTasks(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - remove-labels should remove labels using batch operation
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1204:41
           userId
         );
         // Broadcast label addition for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              label_ids: operation.labelIds,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[Survived] ObjectLiteral
src/lib/actions/tasks.ts:1208:13
           await broadcastTaskUpdate(
             id,
             userId,
-            {
-              id,
-              label_ids: operation.labelIds,
-            },
+            {},
             'updated'
           );

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1217:7
         }
         break;
       }
-      case 'remove-labels': {
-        affectedCount = await removeLabelsFromTasks(
-          operation.ids,
-          operation.labelIds,
-          userId
-        );
-        // Broadcast label removal for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              label_ids: operation.labelIds,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'remove-labels':
       case 'assign': {
         affectedCount = await assignTasks(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - remove-labels should remove labels using batch operation
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1217:29
         }
         break;
       }
-      case 'remove-labels': {
-        affectedCount = await removeLabelsFromTasks(
-          operation.ids,
-          operation.labelIds,
-          userId
-        );
-        // Broadcast label removal for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              label_ids: operation.labelIds,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'remove-labels': {}
       case 'assign': {
         affectedCount = await assignTasks(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - remove-labels should remove labels using batch operation
statusReason: expected 1 to be +0 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1224:41
           userId
         );
         // Broadcast label removal for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              label_ids: operation.labelIds,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[Killed] BlockStatement
src/lib/actions/tasks.ts:1237:22
         }
         break;
       }
-      case 'assign': {
-        affectedCount = await assignTasks(
-          operation.ids,
-          operation.assigneeId,
-          userId
-        );
-        // Broadcast assignment for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              assignee_id: operation.assigneeId,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'assign': {}
       case 'add-dependencies': {
         affectedCount = await addTaskDependencies(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - assign should assign tasks using batch operation
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1237:7
         }
         break;
       }
-      case 'assign': {
-        affectedCount = await assignTasks(
-          operation.ids,
-          operation.assigneeId,
-          userId
-        );
-        // Broadcast assignment for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              assignee_id: operation.assigneeId,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'assign':
       case 'add-dependencies': {
         affectedCount = await addTaskDependencies(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - assign should assign tasks using batch operation
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1244:41
           userId
         );
         // Broadcast assignment for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              assignee_id: operation.assigneeId,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1257:7
         }
         break;
       }
-      case 'add-dependencies': {
-        affectedCount = await addTaskDependencies(
-          operation.ids,
-          operation.dependsOnIds,
-          userId
-        );
-        // Broadcast dependency addition for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              depends_on_task_ids: operation.dependsOnIds,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'add-dependencies':
       case 'set-dates': {
         affectedCount = await setTaskDates(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - add-dependencies should add dependencies using batch operation
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1257:32
         }
         break;
       }
-      case 'add-dependencies': {
-        affectedCount = await addTaskDependencies(
-          operation.ids,
-          operation.dependsOnIds,
-          userId
-        );
-        // Broadcast dependency addition for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              depends_on_task_ids: operation.dependsOnIds,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'add-dependencies': {}
       case 'set-dates': {
         affectedCount = await setTaskDates(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - add-dependencies should add dependencies using batch operation
statusReason: expected 2 to be 1 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1264:41
           userId
         );
         // Broadcast dependency addition for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              depends_on_task_ids: operation.dependsOnIds,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1277:7
         }
         break;
       }
-      case 'set-dates': {
-        affectedCount = await setTaskDates(
-          operation.ids,
-          operation.date,
-          userId
-        );
-        // Broadcast date change for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              date: operation.date,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'set-dates':
       case 'reorder': {
         affectedCount = await reorderTasks(operation.orders, userId);
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - set-dates should set dates using batch operation
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1277:25
         }
         break;
       }
-      case 'set-dates': {
-        affectedCount = await setTaskDates(
-          operation.ids,
-          operation.date,
-          userId
-        );
-        // Broadcast date change for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              date: operation.date,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'set-dates': {}
       case 'reorder': {
         affectedCount = await reorderTasks(operation.orders, userId);
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - set-dates should set dates using batch operation
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1284:41
           userId
         );
         // Broadcast date change for realtime updates
-        for (const id of operation.ids) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              date: operation.date,
-            },
-            'updated'
-          );
-        }
+        for (const id of operation.ids) {}
         break;
       }

[Survived] ObjectLiteral
src/lib/actions/tasks.ts:1288:13
           await broadcastTaskUpdate(
             id,
             userId,
-            {
-              id,
-              date: operation.date,
-            },
+            {},
             'updated'
           );

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1297:7
         }
         break;
       }
-      case 'reorder': {
-        affectedCount = await reorderTasks(operation.orders, userId);
-        // Broadcast reorder for realtime updates
-        for (const { id, sort_order } of operation.orders) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              sort_order,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'reorder':
       default:
         return {
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - reorder should reorder tasks using batch operation
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1297:23
         }
         break;
       }
-      case 'reorder': {
-        affectedCount = await reorderTasks(operation.orders, userId);
-        // Broadcast reorder for realtime updates
-        for (const { id, sort_order } of operation.orders) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              sort_order,
-            },
-            'updated'
-          );
-        }
-        break;
-      }
+      case 'reorder': {}
       default:
         return {
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - reorder should reorder tasks using batch operation
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1300:60
       case 'reorder': {
         affectedCount = await reorderTasks(operation.orders, userId);
         // Broadcast reorder for realtime updates
-        for (const { id, sort_order } of operation.orders) {
-          await broadcastTaskUpdate(
-            id,
-            userId,
-            {
-              id,
-              sort_order,
-            },
-            'updated'
-          );
-        }
+        for (const { id, sort_order } of operation.orders) {}
         break;
       }

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:1313:7
         }
         break;
       }
-      default:
-        return {
-          success: false,
-          affectedCount: 0,
-          message: 'Unknown operation type',
-        };
+      default:
     }
 

[NoCoverage] ObjectLiteral
src/lib/actions/tasks.ts:1314:16
         break;
       }
       default:
-        return {
-          success: false,
-          affectedCount: 0,
-          message: 'Unknown operation type',
-        };
+        return {};
     }
 

[NoCoverage] BlockStatement
src/lib/actions/tasks.ts:1326:19
       affectedCount,
       message: `Successfully processed ${affectedCount} tasks`,
     };
-  } catch (error) {
-    return {
-      success: false,
-      affectedCount,
-      errors: [
-        {
-          taskId: 0,
-          error: error instanceof Error ? error.message : 'Unknown error',
-        },
-      ],
-      message: 'Operation failed',
-    };
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
src/lib/actions/tasks.ts:1327:12
       message: `Successfully processed ${affectedCount} tasks`,
     };
   } catch (error) {
-    return {
-      success: false,
-      affectedCount,
-      errors: [
-        {
-          taskId: 0,
-          error: error instanceof Error ? error.message : 'Unknown error',
-        },
-      ],
-      message: 'Operation failed',
-    };
+    return {};
   }
 }

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:1330:15
     return {
       success: false,
       affectedCount,
-      errors: [
-        {
-          taskId: 0,
-          error: error instanceof Error ? error.message : 'Unknown error',
-        },
-      ],
+      errors: [],
       message: 'Operation failed',
     };

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:1336:16
           error: error instanceof Error ? error.message : 'Unknown error',
         },
       ],
-      message: 'Operation failed',
+      message: "",
     };
   }

[Survived] ArrowFunction
src/lib/actions/tasks.ts:1348:32
   userId: number | null
 ): Promise<number> {
   const db = getDb();
-  const placeholders = ids.map(() => '?').join(',');
+  const placeholders = ids.map(() => undefined).join(',');
   const now = new Date().toISOString();
 

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1351:7
   const placeholders = ids.map(() => '?').join(',');
   const now = new Date().toISOString();
 
-  if (userId) {
+  if (true) {
     const result = db
       .prepare(

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1351:7
   const placeholders = ids.map(() => '?').join(',');
   const now = new Date().toISOString();
 
-  if (userId) {
+  if (false) {
     const result = db
       .prepare(

[Killed] StringLiteral
src/lib/actions/tasks.ts:1354:9
   if (userId) {
     const result = db
       .prepare(
-        `UPDATE tasks SET completed = 1, completed_at = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
+        ``
       )
       .run(...ids, now, userId);
killedBy: Task Actions - Archive/Recurring Functions completeTasks - user filters (lines 1071-1073) should complete tasks with userId filter
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1357:19
         `UPDATE tasks SET completed = 1, completed_at = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
       )
       .run(...ids, now, userId);
-    const count = result.changes || 0;
+    const count = true;
     for (const id of ids) {
       logTaskAction(id, 'completed', 'Batch completed');
killedBy: Task Actions - Archive/Recurring Functions completeTasks - user filters (lines 1071-1073) should complete tasks with userId filter
statusReason: expected true to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1357:19
         `UPDATE tasks SET completed = 1, completed_at = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
       )
       .run(...ids, now, userId);
-    const count = result.changes || 0;
+    const count = false;
     for (const id of ids) {
       logTaskAction(id, 'completed', 'Batch completed');
killedBy: Task Actions - Archive/Recurring Functions completeTasks - user filters (lines 1071-1073) should complete tasks with userId filter
statusReason: expected false to be 1 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1358:27
       )
       .run(...ids, now, userId);
     const count = result.changes || 0;
-    for (const id of ids) {
-      logTaskAction(id, 'completed', 'Batch completed');
-      // Trigger skill extraction for completed task
-      await extractSkillsFromCompletedTask(id, userId);
-    }
+    for (const id of ids) {}
     return count;
   }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1366:5
     return count;
   }
   return (
-    db
-      .prepare(
-        `UPDATE tasks SET completed = 1, completed_at = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
-      )
-      .run(...ids, now).changes || 0
+    false
   );
 }
killedBy: Task Actions - Archive/Recurring Functions completeTasks - user filters (lines 1071-1073) should complete tasks without userId filter (admin override) - line 1073
statusReason: expected false to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1366:5
     return count;
   }
   return (
-    db
-      .prepare(
-        `UPDATE tasks SET completed = 1, completed_at = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
-      )
-      .run(...ids, now).changes || 0
+    true
   );
 }
killedBy: Task Actions - Archive/Recurring Functions completeTasks - user filters (lines 1071-1073) should complete tasks without userId filter (admin override) - line 1073
statusReason: expected true to be 1 // Object.is equality

[Killed] StringLiteral
src/lib/actions/tasks.ts:1368:9
   return (
     db
       .prepare(
-        `UPDATE tasks SET completed = 1, completed_at = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
+        ``
       )
       .run(...ids, now).changes || 0
killedBy: Task Actions - Archive/Recurring Functions completeTasks - user filters (lines 1071-1073) should complete tasks without userId filter (admin override) - line 1073
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1381:18
 async function extractSkillsFromCompletedTask(
   taskId: number,
   userId: number | null
-): Promise<void> {
-  if (!userId) return;
-
-  try {
-    // Import the skills extraction function dynamically to avoid circular dependencies
-    const { extractSkillsFromTask } = await import('@/lib/actions/skills-action');
-    await extractSkillsFromTask(taskId, userId);
-  } catch (error) {
-    // Log but don't fail the completion if skill extraction fails
-    console.error('Failed to extract skills from completed task:', error);
-  }
-}
+): Promise<void> {}
 
 export async function uncompleteTasks(

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1382:7
   taskId: number,
   userId: number | null
 ): Promise<void> {
-  if (!userId) return;
+  if (false) return;
 
   try {

[Survived] BooleanLiteral
src/lib/actions/tasks.ts:1382:7
   taskId: number,
   userId: number | null
 ): Promise<void> {
-  if (!userId) return;
+  if (userId) return;
 
   try {
