[Killed] BlockStatement
src/lib/db/driver.ts:33:31
 /**
  * Check if running in browser environment
  */
-function isBrowser(): boolean {
-  return typeof window !== 'undefined';
-}
+function isBrowser(): boolean {}
 
 /**
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/db/driver.ts:34:10
  * Check if running in browser environment
  */
 function isBrowser(): boolean {
-  return typeof window !== 'undefined';
+  return false;
 }
 
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Killed] EqualityOperator
src/lib/db/driver.ts:34:10
  * Check if running in browser environment
  */
 function isBrowser(): boolean {
-  return typeof window !== 'undefined';
+  return typeof window === 'undefined';
 }
 
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/lib/db/driver.ts:43:20
  */
 export function createDatabase(): Database {
   // In browser, return a no-op database
-  if (isBrowser()) {
-    return createNoOpDatabase();
-  }
+  if (isBrowser()) {}
 
   // Dynamic import config to avoid issues in edge cases
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/db/driver.ts:43:7
  */
 export function createDatabase(): Database {
   // In browser, return a no-op database
-  if (isBrowser()) {
+  if (false) {
     return createNoOpDatabase();
   }
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[NoCoverage] BlockStatement
src/lib/db/driver.ts:49:7
 
   // Dynamic import config to avoid issues in edge cases
   let config: { database: { url: string }; isProduction: boolean };
-  try {
-    // eslint-disable-next-line @typescript-eslint/no-require-imports
-    config = require('@/lib/config').config;
-  } catch {
+  try {} catch {
     config = { database: { url: './prisma/dev.db' }, isProduction: false };
   }

[NoCoverage] BlockStatement
src/lib/db/driver.ts:52:11
   try {
     // eslint-disable-next-line @typescript-eslint/no-require-imports
     config = require('@/lib/config').config;
-  } catch {
-    config = { database: { url: './prisma/dev.db' }, isProduction: false };
-  }
+  } catch {}
 
   const dbUrl = config.database.url;

[NoCoverage] BooleanLiteral
src/lib/db/driver.ts:53:68
     // eslint-disable-next-line @typescript-eslint/no-require-imports
     config = require('@/lib/config').config;
   } catch {
-    config = { database: { url: './prisma/dev.db' }, isProduction: false };
+    config = { database: { url: './prisma/dev.db' }, isProduction: true };
   }
 

[NoCoverage] ObjectLiteral
src/lib/db/driver.ts:53:26
     // eslint-disable-next-line @typescript-eslint/no-require-imports
     config = require('@/lib/config').config;
   } catch {
-    config = { database: { url: './prisma/dev.db' }, isProduction: false };
+    config = { database: {}, isProduction: false };
   }
 

[NoCoverage] ConditionalExpression
src/lib/db/driver.ts:60:5
 
   // Check if this is a PostgreSQL URL
   if (
-    dbUrl.startsWith('postgresql://') ||
-    dbUrl.startsWith('postgres://') ||
-    config.isProduction
+    false
   ) {
     return createPostgreSQLDatabase(dbUrl);

[NoCoverage] ConditionalExpression
src/lib/db/driver.ts:60:5
 
   // Check if this is a PostgreSQL URL
   if (
-    dbUrl.startsWith('postgresql://') ||
-    dbUrl.startsWith('postgres://') ||
+    false ||
     config.isProduction
   ) {

[NoCoverage] MethodExpression
src/lib/db/driver.ts:61:5
   // Check if this is a PostgreSQL URL
   if (
     dbUrl.startsWith('postgresql://') ||
-    dbUrl.startsWith('postgres://') ||
+    dbUrl.endsWith('postgres://') ||
     config.isProduction
   ) {

[NoCoverage] StringLiteral
src/lib/db/driver.ts:61:22
   // Check if this is a PostgreSQL URL
   if (
     dbUrl.startsWith('postgresql://') ||
-    dbUrl.startsWith('postgres://') ||
+    dbUrl.startsWith("") ||
     config.isProduction
   ) {

[NoCoverage] BlockStatement
src/lib/db/driver.ts:63:5
     dbUrl.startsWith('postgresql://') ||
     dbUrl.startsWith('postgres://') ||
     config.isProduction
-  ) {
-    return createPostgreSQLDatabase(dbUrl);
-  }
+  ) {}
 
   // Default to SQLite

[NoCoverage] BlockStatement
src/lib/db/driver.ts:72:7
 }
 
 function createSQLiteDatabase(path: string): Database {
-  try {
-    // Node.js runtime
-    // eslint-disable-next-line @typescript-eslint/no-require-imports
-    const BetterSqlite3 = require('better-sqlite3');
-    const db = new BetterSqlite3(path);
-
-    // Wrap the transaction method to properly handle BEGIN/COMMIT/ROLLBACK
-    const originalTransaction = db.transaction.bind(db);
-    db.transaction = <T>(fn: () => T): T => {
-      const result = originalTransaction(fn);
-      // For synchronous functions, the transaction is already complete
-      // better-sqlite3 handles this automatically when the function returns
-      return result;
-    };
-
-    return db;
-  } catch {
+  try {} catch {
     try {
       // Bun runtime

[NoCoverage] BlockStatement
src/lib/db/driver.ts:80:45
 
     // Wrap the transaction method to properly handle BEGIN/COMMIT/ROLLBACK
     const originalTransaction = db.transaction.bind(db);
-    db.transaction = <T>(fn: () => T): T => {
-      const result = originalTransaction(fn);
-      // For synchronous functions, the transaction is already complete
-      // better-sqlite3 handles this automatically when the function returns
-      return result;
-    };
+    db.transaction = <T>(fn: () => T): T => {};
 
     return db;

[NoCoverage] BlockStatement
src/lib/db/driver.ts:89:9
 
     return db;
   } catch {
-    try {
-      // Bun runtime
-      // eslint-disable-next-line @typescript-eslint/no-require-imports
-      const { Database: BunDatabase } = require('bun:sqlite');
-      const db = new BunDatabase(path);
-      return {
-        prepare: (sql: string) => db.query(sql),
-        exec: (sql: string) => db.run(sql),
-        close: () => db.close(),
-        transaction: <T>(fn: () => T): T => {
-          const tx = db.transaction();
-          tx.start();
-          try {
-            const result = fn();
-            tx.commit();
-            return result;
-          } catch (e) {
-            tx.rollback();
-            throw e;
-          }
-        },
-      };
-    } catch {
+    try {} catch {
       throw new Error(
         'No SQLite driver available. Install better-sqlite3 for Node.js or use Bun for bun:sqlite.'

[NoCoverage] ObjectLiteral
src/lib/db/driver.ts:94:14
       // eslint-disable-next-line @typescript-eslint/no-require-imports
       const { Database: BunDatabase } = require('bun:sqlite');
       const db = new BunDatabase(path);
-      return {
-        prepare: (sql: string) => db.query(sql),
-        exec: (sql: string) => db.run(sql),
-        close: () => db.close(),
-        transaction: <T>(fn: () => T): T => {
-          const tx = db.transaction();
-          tx.start();
-          try {
-            const result = fn();
-            tx.commit();
-            return result;
-          } catch (e) {
-            tx.rollback();
-            throw e;
-          }
-        },
-      };
+      return {};
     } catch {
       throw new Error(

[NoCoverage] ArrowFunction
src/lib/db/driver.ts:95:18
       const { Database: BunDatabase } = require('bun:sqlite');
       const db = new BunDatabase(path);
       return {
-        prepare: (sql: string) => db.query(sql),
+        prepare: () => undefined,
         exec: (sql: string) => db.run(sql),
         close: () => db.close(),

[NoCoverage] ArrowFunction
src/lib/db/driver.ts:96:15
       const db = new BunDatabase(path);
       return {
         prepare: (sql: string) => db.query(sql),
-        exec: (sql: string) => db.run(sql),
+        exec: () => undefined,
         close: () => db.close(),
         transaction: <T>(fn: () => T): T => {

[NoCoverage] ArrowFunction
src/lib/db/driver.ts:97:16
       return {
         prepare: (sql: string) => db.query(sql),
         exec: (sql: string) => db.run(sql),
-        close: () => db.close(),
+        close: () => undefined,
         transaction: <T>(fn: () => T): T => {
           const tx = db.transaction();

[NoCoverage] BlockStatement
src/lib/db/driver.ts:98:45
         prepare: (sql: string) => db.query(sql),
         exec: (sql: string) => db.run(sql),
         close: () => db.close(),
-        transaction: <T>(fn: () => T): T => {
-          const tx = db.transaction();
-          tx.start();
-          try {
-            const result = fn();
-            tx.commit();
-            return result;
-          } catch (e) {
-            tx.rollback();
-            throw e;
-          }
-        },
+        transaction: <T>(fn: () => T): T => {},
       };
     } catch {

[NoCoverage] BlockStatement
src/lib/db/driver.ts:101:15
         transaction: <T>(fn: () => T): T => {
           const tx = db.transaction();
           tx.start();
-          try {
-            const result = fn();
-            tx.commit();
-            return result;
-          } catch (e) {
+          try {} catch (e) {
             tx.rollback();
             throw e;

[NoCoverage] BlockStatement
src/lib/db/driver.ts:105:23
             const result = fn();
             tx.commit();
             return result;
-          } catch (e) {
-            tx.rollback();
-            throw e;
-          }
+          } catch (e) {}
         },
       };

[NoCoverage] BlockStatement
src/lib/db/driver.ts:111:13
           }
         },
       };
-    } catch {
-      throw new Error(
-        'No SQLite driver available. Install better-sqlite3 for Node.js or use Bun for bun:sqlite.'
-      );
-    }
+    } catch {}
   }
 }

[NoCoverage] StringLiteral
src/lib/db/driver.ts:113:9
       };
     } catch {
       throw new Error(
-        'No SQLite driver available. Install better-sqlite3 for Node.js or use Bun for bun:sqlite.'
+        ""
       );
     }

[NoCoverage] ObjectLiteral
src/lib/db/driver.ts:122:25
 function createPostgreSQLDatabase(url: string): Database {
   // eslint-disable-next-line @typescript-eslint/no-require-imports
   const { Pool } = require('pg');
-  const pool = new Pool({
-    connectionString: url,
-  });
+  const pool = new Pool({});
 
   // For PostgreSQL, return async-compatible statement wrappers

[NoCoverage] ArrowFunction
src/lib/db/driver.ts:129:14
   // For PostgreSQL, return async-compatible statement wrappers
   // Note: This requires callers to handle promises when using PostgreSQL
   return {
-    prepare: (sql: string): Statement => ({
-      run: (...params: unknown[]) => {
-        // For INSERT ... RETURNING, we need to get the returned id
-        // Note: This async handling is simplified - PostgreSQL support is experimental
-        void pool.query(sql, params);
-        return {
-          lastInsertRowid: 0,
-          changes: 0,
-        };
-      },
-
-      get: (...params: unknown[]) =>
-        pool.query(sql, params).then((r: any) => r.rows[0]),
-
-      all: (...params: unknown[]) =>
-        pool.query(sql, params).then((r: any) => r.rows),
-    }),
+    prepare: () => undefined,
     exec: (sql: string) => {
       pool.query(sql);

[NoCoverage] BlockStatement
src/lib/db/driver.ts:130:38
   // Note: This requires callers to handle promises when using PostgreSQL
   return {
     prepare: (sql: string): Statement => ({
-      run: (...params: unknown[]) => {
-        // For INSERT ... RETURNING, we need to get the returned id
-        // Note: This async handling is simplified - PostgreSQL support is experimental
-        void pool.query(sql, params);
-        return {
-          lastInsertRowid: 0,
-          changes: 0,
-        };
-      },
+      run: (...params: unknown[]) => {},
 
       get: (...params: unknown[]) =>

[NoCoverage] ObjectLiteral
src/lib/db/driver.ts:134:16
         // For INSERT ... RETURNING, we need to get the returned id
         // Note: This async handling is simplified - PostgreSQL support is experimental
         void pool.query(sql, params);
-        return {
-          lastInsertRowid: 0,
-          changes: 0,
-        };
+        return {};
       },
 

[NoCoverage] ArrowFunction
src/lib/db/driver.ts:140:12
         };
       },
 
-      get: (...params: unknown[]) =>
-        pool.query(sql, params).then((r: any) => r.rows[0]),
+      get: () => undefined,
 
       all: (...params: unknown[]) =>

[NoCoverage] ArrowFunction
src/lib/db/driver.ts:141:38
       },
 
       get: (...params: unknown[]) =>
-        pool.query(sql, params).then((r: any) => r.rows[0]),
+        pool.query(sql, params).then(() => undefined),
 
       all: (...params: unknown[]) =>

[NoCoverage] ArrowFunction
src/lib/db/driver.ts:143:12
       get: (...params: unknown[]) =>
         pool.query(sql, params).then((r: any) => r.rows[0]),
 
-      all: (...params: unknown[]) =>
-        pool.query(sql, params).then((r: any) => r.rows),
+      all: () => undefined,
     }),
     exec: (sql: string) => {

[NoCoverage] ArrowFunction
src/lib/db/driver.ts:144:38
         pool.query(sql, params).then((r: any) => r.rows[0]),
 
       all: (...params: unknown[]) =>
-        pool.query(sql, params).then((r: any) => r.rows),
+        pool.query(sql, params).then(() => undefined),
     }),
     exec: (sql: string) => {

[NoCoverage] BlockStatement
src/lib/db/driver.ts:146:28
       all: (...params: unknown[]) =>
         pool.query(sql, params).then((r: any) => r.rows),
     }),
-    exec: (sql: string) => {
-      pool.query(sql);
-    },
+    exec: (sql: string) => {},
     close: () => {
       pool.end();

[NoCoverage] BlockStatement
src/lib/db/driver.ts:149:18
     exec: (sql: string) => {
       pool.query(sql);
     },
-    close: () => {
-      pool.end();
-    },
+    close: () => {},
     transaction: async <T>(fn: () => T | Promise<T>): Promise<T> => {
       const client = await pool.connect();

[NoCoverage] BlockStatement
src/lib/db/driver.ts:152:69
     close: () => {
       pool.end();
     },
-    transaction: async <T>(fn: () => T | Promise<T>): Promise<T> => {
-      const client = await pool.connect();
-      try {
-        await client.query('BEGIN');
-        const result = await fn();
-        await client.query('COMMIT');
-        return result;
-      } catch (error) {
-        await client.query('ROLLBACK');
-        throw error;
-      } finally {
-        client.release();
-      }
-    },
+    transaction: async <T>(fn: () => T | Promise<T>): Promise<T> => {},
   };
 }

[NoCoverage] BlockStatement
src/lib/db/driver.ts:154:11
     },
     transaction: async <T>(fn: () => T | Promise<T>): Promise<T> => {
       const client = await pool.connect();
-      try {
-        await client.query('BEGIN');
-        const result = await fn();
-        await client.query('COMMIT');
-        return result;
-      } catch (error) {
+      try {} catch (error) {
         await client.query('ROLLBACK');
         throw error;

[NoCoverage] BlockStatement
src/lib/db/driver.ts:159:23
         const result = await fn();
         await client.query('COMMIT');
         return result;
-      } catch (error) {
-        await client.query('ROLLBACK');
-        throw error;
-      } finally {
+      } catch (error) {} finally {
         client.release();
       }

[Killed] BlockStatement
src/lib/db/driver.ts:173:41
  * Create a no-op database for browser environments
  * This prevents native module loading in the browser
  */
-function createNoOpDatabase(): Database {
-  return {
-    prepare: () => ({
-      run: () => ({ lastInsertRowid: 0, changes: 0 }),
-      get: () => undefined,
-      all: () => [],
-    }),
-    exec: () => {
-      void 0;
-    },
-    close: () => {
-      void 0;
-    },
-    transaction: <T>(fn: () => T): T => fn(),
-  };
-}
+function createNoOpDatabase(): Database {}
 
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/lib/db/driver.ts:174:10
  * This prevents native module loading in the browser
  */
 function createNoOpDatabase(): Database {
-  return {
-    prepare: () => ({
-      run: () => ({ lastInsertRowid: 0, changes: 0 }),
-      get: () => undefined,
-      all: () => [],
-    }),
-    exec: () => {
-      void 0;
-    },
-    close: () => {
-      void 0;
-    },
-    transaction: <T>(fn: () => T): T => fn(),
-  };
+  return {};
 }
 
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ArrowFunction
src/lib/db/driver.ts:175:14
  */
 function createNoOpDatabase(): Database {
   return {
-    prepare: () => ({
-      run: () => ({ lastInsertRowid: 0, changes: 0 }),
-      get: () => undefined,
-      all: () => [],
-    }),
+    prepare: () => undefined,
     exec: () => {
       void 0;
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/lib/db/driver.ts:175:21
  */
 function createNoOpDatabase(): Database {
   return {
-    prepare: () => ({
-      run: () => ({ lastInsertRowid: 0, changes: 0 }),
-      get: () => undefined,
-      all: () => [],
-    }),
+    prepare: () => ({}),
     exec: () => {
       void 0;
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Survived] ArrowFunction
src/lib/db/driver.ts:176:12
 function createNoOpDatabase(): Database {
   return {
     prepare: () => ({
-      run: () => ({ lastInsertRowid: 0, changes: 0 }),
+      run: () => undefined,
       get: () => undefined,
       all: () => [],

[Killed] ArrowFunction
src/lib/db/driver.ts:178:12
     prepare: () => ({
       run: () => ({ lastInsertRowid: 0, changes: 0 }),
       get: () => undefined,
-      all: () => [],
+      all: () => undefined,
     }),
     exec: () => {
killedBy: Integrations API GET /api/integrations should return integrations array
statusReason: expected 500 to be 200 // Object.is equality

[Survived] BlockStatement
src/lib/db/driver.ts:180:17
       get: () => undefined,
       all: () => [],
     }),
-    exec: () => {
-      void 0;
-    },
+    exec: () => {},
     close: () => {
       void 0;

[NoCoverage] BlockStatement
src/lib/db/driver.ts:183:18
     exec: () => {
       void 0;
     },
-    close: () => {
-      void 0;
-    },
+    close: () => {},
     transaction: <T>(fn: () => T): T => fn(),
   };

[Survived] ArrowFunction
src/lib/db/driver.ts:186:18
     close: () => {
       void 0;
     },
-    transaction: <T>(fn: () => T): T => fn(),
+    transaction: () => undefined,
   };
 }
