[Killed] BlockStatement
src/lib/actions/tasks.ts:1577:37
     }
     if (!hasAccess) continue;
 
-    for (const labelId of labelIds) {
-      db.prepare(
-        'DELETE FROM task_labels WHERE task_id = ? AND label_id = ?'
-      ).run(taskId, labelId);
-    }
+    for (const labelId of labelIds) {}
     count++;
   }
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - remove-labels should remove labels using batch operation
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1591:20
   ids: number[],
   assigneeId: number,
   userId: number | null
-): Promise<number> {
-  const db = getDb();
-  const placeholders = ids.map(() => '?').join(',');
-
-  if (userId) {
-    return (
-      db
-        .prepare(
-          `UPDATE tasks SET assignee_id = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
-        )
-        .run(assigneeId, ...ids, userId).changes || 0
-    );
-  }
-  return (
-    db
-      .prepare(
-        `UPDATE tasks SET assignee_id = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
-      )
-      .run(assigneeId, ...ids).changes || 0
-  );
-}
+): Promise<number> {}
 
 async function addTaskDependencies(
killedBy: Task Actions - Archive/Recurring Functions assignTasks - line 1188 should assign tasks with userId filter
statusReason: expected undefined to be 2 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1595:15
   const db = getDb();
   const placeholders = ids.map(() => '?').join(',');
 
-  if (userId) {
-    return (
-      db
-        .prepare(
-          `UPDATE tasks SET assignee_id = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
-        )
-        .run(assigneeId, ...ids, userId).changes || 0
-    );
-  }
+  if (userId) {}
   return (
     db

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1597:7
 
   if (userId) {
     return (
-      db
-        .prepare(
-          `UPDATE tasks SET assignee_id = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
-        )
-        .run(assigneeId, ...ids, userId).changes || 0
+      false
     );
   }
killedBy: Task Actions - Archive/Recurring Functions assignTasks - line 1188 should assign tasks with userId filter
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1597:7
 
   if (userId) {
     return (
-      db
-        .prepare(
-          `UPDATE tasks SET assignee_id = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
-        )
-        .run(assigneeId, ...ids, userId).changes || 0
+      true
     );
   }
killedBy: Task Actions - Archive/Recurring Functions assignTasks - line 1188 should assign tasks with userId filter
statusReason: expected undefined to be 2 // Object.is equality

[Killed] StringLiteral
src/lib/actions/tasks.ts:1599:11
     return (
       db
         .prepare(
-          `UPDATE tasks SET assignee_id = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
+          ``
         )
         .run(assigneeId, ...ids, userId).changes || 0
killedBy: Task Actions - Archive/Recurring Functions assignTasks - line 1188 should assign tasks with userId filter
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1605:5
     );
   }
   return (
-    db
-      .prepare(
-        `UPDATE tasks SET assignee_id = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
-      )
-      .run(assigneeId, ...ids).changes || 0
+    false
   );
 }
killedBy: Task Actions - Archive/Recurring Functions assignTasks - line 1188 should assign tasks without userId filter (admin override) - line 1188
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1605:5
     );
   }
   return (
-    db
-      .prepare(
-        `UPDATE tasks SET assignee_id = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
-      )
-      .run(assigneeId, ...ids).changes || 0
+    true
   );
 }
killedBy: Task Actions - Archive/Recurring Functions assignTasks - line 1188 should assign tasks without userId filter (admin override) - line 1188
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1617:20
   ids: number[],
   dependsOnIds: number[],
   userId: number | null
-): Promise<number> {
-  const db = getDb();
-  let count = 0;
-
-  for (const taskId of ids) {
-    let hasAccess = true;
-    if (userId) {
-      const task = db
-        .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
-        .get(taskId, userId);
-      hasAccess = !!task;
-    }
-    if (!hasAccess) continue;
-
-    for (const dependsOnId of dependsOnIds) {
-      db.prepare(
-        'INSERT OR IGNORE INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'
-      ).run(taskId, dependsOnId);
-    }
-    count++;
-  }
-  return count;
-}
+): Promise<number> {}
 
 export async function setTaskDates(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - add-dependencies should add dependencies using batch operation
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1621:29
   const db = getDb();
   let count = 0;
 
-  for (const taskId of ids) {
-    let hasAccess = true;
-    if (userId) {
-      const task = db
-        .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
-        .get(taskId, userId);
-      hasAccess = !!task;
-    }
-    if (!hasAccess) continue;
-
-    for (const dependsOnId of dependsOnIds) {
-      db.prepare(
-        'INSERT OR IGNORE INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'
-      ).run(taskId, dependsOnId);
-    }
-    count++;
-  }
+  for (const taskId of ids) {}
   return count;
 }
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - add-dependencies should add dependencies using batch operation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/lib/actions/tasks.ts:1625:18
     let hasAccess = true;
     if (userId) {
       const task = db
-        .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
+        .prepare("")
         .get(taskId, userId);
       hasAccess = !!task;
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - add-dependencies should add dependencies using batch operation
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1631:45
     }
     if (!hasAccess) continue;
 
-    for (const dependsOnId of dependsOnIds) {
-      db.prepare(
-        'INSERT OR IGNORE INTO task_dependencies (task_id, depends_on_task_id) VALUES (?, ?)'
-      ).run(taskId, dependsOnId);
-    }
+    for (const dependsOnId of dependsOnIds) {}
     count++;
   }

[Killed] BlockStatement
src/lib/actions/tasks.ts:1645:20
   ids: number[],
   date: string,
   userId: number | null
-): Promise<number> {
-  const db = getDb();
-  const placeholders = ids.map(() => '?').join(',');
-
-  if (userId) {
-    return (
-      db
-        .prepare(
-          `UPDATE tasks SET date = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
-        )
-        .run(date, ...ids, userId).changes || 0
-    );
-  }
-  return (
-    db
-      .prepare(
-        `UPDATE tasks SET date = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
-      )
-      .run(date, ...ids).changes || 0
-  );
-}
+): Promise<number> {}
 
 export async function reorderTasks(
killedBy: Task Actions - Archive/Recurring Functions setTaskDates should update task dates with userId
statusReason: expected undefined to be '2026-08-01' // Object.is equality

[Survived] BlockStatement
src/lib/actions/tasks.ts:1649:15
   const db = getDb();
   const placeholders = ids.map(() => '?').join(',');
 
-  if (userId) {
-    return (
-      db
-        .prepare(
-          `UPDATE tasks SET date = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
-        )
-        .run(date, ...ids, userId).changes || 0
-    );
-  }
+  if (userId) {}
   return (
     db

[Killed] LogicalOperator
src/lib/actions/tasks.ts:1651:7
 
   if (userId) {
     return (
-      db
-        .prepare(
-          `UPDATE tasks SET date = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
-        )
-        .run(date, ...ids, userId).changes || 0
+      db.prepare(`UPDATE tasks SET date = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`).run(date, ...ids, userId).changes && 0
     );
   }
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - set-dates should set dates using batch operation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1651:7
 
   if (userId) {
     return (
-      db
-        .prepare(
-          `UPDATE tasks SET date = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders}) AND user_id = ?`
-        )
-        .run(date, ...ids, userId).changes || 0
+      false
     );
   }
killedBy: Task Actions - Archive/Recurring Functions setTaskDates should update task dates with userId
statusReason: expected undefined to be '2026-08-01' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1659:5
     );
   }
   return (
-    db
-      .prepare(
-        `UPDATE tasks SET date = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
-      )
-      .run(date, ...ids).changes || 0
+    true
   );
 }
killedBy: Task Actions - Archive/Recurring Functions setTaskDates should update task dates without userId (admin override) - line 1218
statusReason: expected undefined to be '2026-08-01' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1659:5
     );
   }
   return (
-    db
-      .prepare(
-        `UPDATE tasks SET date = ?, updated_at = CURRENT_TIMESTAMP WHERE id IN (${placeholders})`
-      )
-      .run(date, ...ids).changes || 0
+    false
   );
 }
killedBy: Task Actions - Archive/Recurring Functions setTaskDates should update task dates without userId (admin override) - line 1218
statusReason: expected undefined to be '2026-08-01' // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1670:20
 export async function reorderTasks(
   taskOrders: { id: number; sort_order: number }[],
   userId: number | null
-): Promise<number> {
-  const db = getDb();
-  let count = 0;
-
-  for (const { id, sort_order } of taskOrders) {
-    if (userId) {
-      db.prepare(
-        'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ? AND user_id = ?'
-      ).run(sort_order, id, userId);
-    } else {
-      db.prepare(
-        'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ?'
-      ).run(sort_order, id);
-    }
-    count++;
-  }
-  return count;
-}
+): Promise<number> {}
 
 export async function getTasksByIds(
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - reorder should reorder tasks using batch operation
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:1674:48
   const db = getDb();
   let count = 0;
 
-  for (const { id, sort_order } of taskOrders) {
-    if (userId) {
-      db.prepare(
-        'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ? AND user_id = ?'
-      ).run(sort_order, id, userId);
-    } else {
-      db.prepare(
-        'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ?'
-      ).run(sort_order, id);
-    }
-    count++;
-  }
+  for (const { id, sort_order } of taskOrders) {}
   return count;
 }
killedBy: Task Actions - Archive/Recurring Functions performBatchOperation - reorder should reorder tasks using batch operation
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1675:9
   let count = 0;
 
   for (const { id, sort_order } of taskOrders) {
-    if (userId) {
+    if (false) {
       db.prepare(
         'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ? AND user_id = ?'

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1675:9
   let count = 0;
 
   for (const { id, sort_order } of taskOrders) {
-    if (userId) {
+    if (true) {
       db.prepare(
         'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ? AND user_id = ?'

[Survived] StringLiteral
src/lib/actions/tasks.ts:1677:9
   for (const { id, sort_order } of taskOrders) {
     if (userId) {
       db.prepare(
-        'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ? AND user_id = ?'
+        ""
       ).run(sort_order, id, userId);
     } else {

[Survived] BlockStatement
src/lib/actions/tasks.ts:1679:12
       db.prepare(
         'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ? AND user_id = ?'
       ).run(sort_order, id, userId);
-    } else {
-      db.prepare(
-        'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ?'
-      ).run(sort_order, id);
-    }
+    } else {}
     count++;
   }

[Survived] StringLiteral
src/lib/actions/tasks.ts:1681:9
       ).run(sort_order, id, userId);
     } else {
       db.prepare(
-        'UPDATE tasks SET sort_order = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ?'
+        ""
       ).run(sort_order, id);
     }

[Killed] EqualityOperator
src/lib/actions/tasks.ts:1692:7
 export async function getTasksByIds(
   ids: number[]
 ): Promise<TaskWithRelations[]> {
-  if (ids.length === 0) return [];
+  if (ids.length !== 0) return [];
 
   const db = getDb();
killedBy: Integration Actions syncTasksToIntegration exports tasks to integration
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1692:7
 export async function getTasksByIds(
   ids: number[]
 ): Promise<TaskWithRelations[]> {
-  if (ids.length === 0) return [];
+  if (true) return [];
 
   const db = getDb();
killedBy: Task Actions - Archive/Recurring Functions getTasksByIds should return tasks for valid IDs
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ArrowFunction
src/lib/actions/tasks.ts:1697:32
   const db = getDb();
 
   // Batch fetch all tasks with their relations in a single query to avoid N+1 problem
-  const placeholders = ids.map(() => '?').join(',');
+  const placeholders = ids.map(() => undefined).join(',');
 
   // Fetch tasks

[Survived] ArrowFunction
src/lib/actions/tasks.ts:1704:29
     .prepare(`SELECT * FROM tasks WHERE id IN (${placeholders})`)
     .all(...ids) as Task[];
 
-  const taskIds = tasks.map(t => t.id);
+  const taskIds = tasks.map(() => undefined);
 
   // Batch fetch all relations using shared utility

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1710:23
   const relationsMap = await getTaskRelations(db, taskIds);
 
   const result: TaskWithRelations[] = tasks.map(task => {
-    const relations = relationsMap[task.id] || {
-      labels: [],
-      subtasks: [],
-      reminders: [],
-      logs: [],
-      comments: [],
-      attachments: [],
-      blockers: [],
-      blocked_by: [],
-      assignee: undefined,
-      time_entries: [],
-      recurring_exceptions: [],
-    };
+    const relations = false;
     return {
       ...task,

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:1712:17
   const result: TaskWithRelations[] = tasks.map(task => {
     const relations = relationsMap[task.id] || {
       labels: [],
-      subtasks: [],
+      subtasks: ["Stryker was here"],
       reminders: [],
       logs: [],

[Killed] BlockStatement
src/lib/actions/tasks.ts:1749:17
   const subtask = db
     .prepare('SELECT * FROM subtasks WHERE id = ?')
     .get(id) as Subtask;
-  if (!subtask) {
-    throw new Error('Subtask not found');
-  }
+  if (!subtask) {}
 
   // Check if user owns the parent task (or in test mode)
killedBy: Task Actions - Archive/Recurring Functions toggleSubtask - Edge Cases should throw error for non-existent subtask
statusReason: expected [Function] to throw error including 'Subtask not found' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:1749:7
   const subtask = db
     .prepare('SELECT * FROM subtasks WHERE id = ?')
     .get(id) as Subtask;
-  if (!subtask) {
+  if (subtask) {
     throw new Error('Subtask not found');
   }
killedBy: Task Actions - Comprehensive Tests Task Operations toggleSubtask should handle toggleSubtask without throwing
statusReason: Subtask not found

[Killed] StringLiteral
src/lib/actions/tasks.ts:1750:21
     .prepare('SELECT * FROM subtasks WHERE id = ?')
     .get(id) as Subtask;
   if (!subtask) {
-    throw new Error('Subtask not found');
+    throw new Error("");
   }
 
killedBy: Task Actions - Archive/Recurring Functions toggleSubtask - Edge Cases should throw error for non-existent subtask
statusReason: expected [Function] to throw error including 'Subtask not found' but got ''

[Survived] OptionalChaining
src/lib/actions/tasks.ts:1755:5
 
   // Check if user owns the parent task (or in test mode)
   const effectiveUserId =
-    user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
+    user.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
   if (effectiveUserId && process.env.NODE_ENV !== 'test') {
     const task = db

[Survived] BlockStatement
src/lib/actions/tasks.ts:1756:59
   // Check if user owns the parent task (or in test mode)
   const effectiveUserId =
     user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-  if (effectiveUserId && process.env.NODE_ENV !== 'test') {
-    const task = db
-      .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
-      .get(subtask.task_id, effectiveUserId);
-    if (!task) {
-      throw new Error('Task not found or access denied');
-    }
-  }
+  if (effectiveUserId && process.env.NODE_ENV !== 'test') {}
 
   db.prepare('UPDATE subtasks SET completed = ? WHERE id = ?').run(

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1756:7
   // Check if user owns the parent task (or in test mode)
   const effectiveUserId =
     user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-  if (effectiveUserId && process.env.NODE_ENV !== 'test') {
+  if (false) {
     const task = db
       .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:1760:9
     const task = db
       .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
       .get(subtask.task_id, effectiveUserId);
-    if (!task) {
+    if (task) {
       throw new Error('Task not found or access denied');
     }
killedBy: Task Actions - Comprehensive Tests Task Operations toggleSubtask should handle access denied in production mode
statusReason: Task not found or access denied

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1760:9
     const task = db
       .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
       .get(subtask.task_id, effectiveUserId);
-    if (!task) {
+    if (true) {
       throw new Error('Task not found or access denied');
     }
killedBy: Task Actions - Comprehensive Tests Task Operations toggleSubtask should handle access denied in production mode
statusReason: Task not found or access denied

[Survived] StringLiteral
src/lib/actions/tasks.ts:1765:14
     }
   }
 
-  db.prepare('UPDATE subtasks SET completed = ? WHERE id = ?').run(
+  db.prepare("").run(
     subtask.completed ? 0 : 1,
     id

[Survived] BooleanLiteral
src/lib/actions/tasks.ts:1769:35
     subtask.completed ? 0 : 1,
     id
   );
-  return { ...subtask, completed: !subtask.completed };
+  return { ...subtask, completed: subtask.completed };
 }
 

[Killed] BlockStatement
src/lib/actions/tasks.ts:1772:58
   return { ...subtask, completed: !subtask.completed };
 }
 
-export async function getOverdueCount(): Promise<number> {
-  const db = getDb();
-  const user = await getCurrentUser();
-
-  // In test mode, use demo user ID; in production require auth
-  const effectiveUserId =
-    user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-  if (!effectiveUserId) {
-    return 0;
-  }
-
-  const today = new Date().toISOString().split('T')[0];
-  const result = db
-    .prepare(
-      'SELECT COUNT(*) as count FROM tasks WHERE date < ? AND completed = 0 AND user_id = ?'
-    )
-    .get(today, effectiveUserId) as { count: number };
-  return result.count;
-}
+export async function getOverdueCount(): Promise<number> {}
 
 /**
killedBy: Task Actions Tasks should get overdue count
statusReason: expected 'undefined' to be 'number' // Object.is equality

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:1779:7
   // In test mode, use demo user ID; in production require auth
   const effectiveUserId =
     user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-  if (!effectiveUserId) {
+  if (effectiveUserId) {
     return 0;
   }
killedBy: Task Actions - Comprehensive Tests Task Operations getOverdueCount should count overdue tasks
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1779:7
   // In test mode, use demo user ID; in production require auth
   const effectiveUserId =
     user?.id ?? (process.env.NODE_ENV === 'test' ? 1 : null);
-  if (!effectiveUserId) {
+  if (true) {
     return 0;
   }
killedBy: Task Actions - Comprehensive Tests Task Operations getOverdueCount should count overdue tasks
statusReason: expected 0 to be greater than or equal to 1

[Survived] BlockStatement
src/lib/actions/tasks.ts:1818:9
       interval?: number;
       unit?: 'days' | 'weeks' | 'months' | 'years';
     } = {};
-    try {
-      config = JSON.parse(task.recurring_config || '{}');
-      if (typeof config !== 'object' || config === null) {
-        config = {};
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.warn(
         `Invalid recurring_config for task ${task.id}, skipping:`,

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1819:27
       unit?: 'days' | 'weeks' | 'months' | 'years';
     } = {};
     try {
-      config = JSON.parse(task.recurring_config || '{}');
+      config = JSON.parse(true);
       if (typeof config !== 'object' || config === null) {
         config = {};

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1819:27
       unit?: 'days' | 'weeks' | 'months' | 'years';
     } = {};
     try {
-      config = JSON.parse(task.recurring_config || '{}');
+      config = JSON.parse(false);
       if (typeof config !== 'object' || config === null) {
         config = {};

[Killed] LogicalOperator
src/lib/actions/tasks.ts:1820:11
     } = {};
     try {
       config = JSON.parse(task.recurring_config || '{}');
-      if (typeof config !== 'object' || config === null) {
+      if (typeof config !== 'object' && config === null) {
         config = {};
       }
killedBy: Task Actions - Archive/Recurring Functions generateRecurringTasks should handle null recurring_config value
statusReason: Cannot read properties of null (reading 'interval')

[Killed] EqualityOperator
src/lib/actions/tasks.ts:1820:41
     } = {};
     try {
       config = JSON.parse(task.recurring_config || '{}');
-      if (typeof config !== 'object' || config === null) {
+      if (typeof config !== 'object' || config !== null) {
         config = {};
       }
killedBy: Task Actions - Archive/Recurring Functions generateRecurringTasks should handle null recurring_config value
statusReason: Cannot read properties of null (reading 'interval')

[Survived] BlockStatement
src/lib/actions/tasks.ts:1823:21
       if (typeof config !== 'object' || config === null) {
         config = {};
       }
-    } catch (error) {
-      console.warn(
-        `Invalid recurring_config for task ${task.id}, skipping:`,
-        error
-      );
-      continue;
-    }
+    } catch (error) {}
     let nextDate: string | null = null;
 

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1833:7
     let nextDate: string | null = null;
 
     switch (task.recurring) {
-      case 'daily':
-        nextDate = new Date(Date.now() + 24 * 60 * 60 * 1000)
-          .toISOString()
-          .split('T')[0];
-        break;
+      case 'daily':
 
       case 'weekly':

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1834:42
 
     switch (task.recurring) {
       case 'daily':
-        nextDate = new Date(Date.now() + 24 * 60 * 60 * 1000)
+        nextDate = new Date(Date.now() + 24 / 60 * 60 * 1000)
           .toISOString()
           .split('T')[0];

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1834:42
 
     switch (task.recurring) {
       case 'daily':
-        nextDate = new Date(Date.now() + 24 * 60 * 60 * 1000)
+        nextDate = new Date(Date.now() + 24 * 60 * 60 / 1000)
           .toISOString()
           .split('T')[0];

[Survived] StringLiteral
src/lib/actions/tasks.ts:1836:18
       case 'daily':
         nextDate = new Date(Date.now() + 24 * 60 * 60 * 1000)
           .toISOString()
-          .split('T')[0];
+          .split("")[0];
         break;
 

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1839:7
           .split('T')[0];
         break;
 
-      case 'weekly':
-        nextDate = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
-          .toISOString()
-          .split('T')[0];
-        break;
+      case 'weekly':
 
       case 'weekdays': {

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1840:42
         break;
 
       case 'weekly':
-        nextDate = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
+        nextDate = new Date(Date.now() + 7 * 24 * 60 * 60 / 1000)
           .toISOString()
           .split('T')[0];

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1840:29
         break;
 
       case 'weekly':
-        nextDate = new Date(Date.now() + 7 * 24 * 60 * 60 * 1000)
+        nextDate = new Date(Date.now() - 7 * 24 * 60 * 60 * 1000)
           .toISOString()
           .split('T')[0];

[Survived] BlockStatement
src/lib/actions/tasks.ts:1845:24
           .split('T')[0];
         break;
 
-      case 'weekdays': {
-        const next = new Date(Date.now() + 24 * 60 * 60 * 1000);
-        let nextDay = next.getDay();
-        // Skip weekends (0 = Sunday, 6 = Saturday)
-        while (nextDay === 0 || nextDay === 6) {
-          next.setDate(next.getDate() + 1);
-          nextDay = next.getDay();
-        }
-        nextDate = next.toISOString().split('T')[0];
-        break;
-      }
+      case 'weekdays': {}
 
       case 'monthly':

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1845:7
           .split('T')[0];
         break;
 
-      case 'weekdays': {
-        const next = new Date(Date.now() + 24 * 60 * 60 * 1000);
-        let nextDay = next.getDay();
-        // Skip weekends (0 = Sunday, 6 = Saturday)
-        while (nextDay === 0 || nextDay === 6) {
-          next.setDate(next.getDate() + 1);
-          nextDay = next.getDay();
-        }
-        nextDate = next.toISOString().split('T')[0];
-        break;
-      }
+      case 'weekdays':
 
       case 'monthly':

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1846:31
         break;
 
       case 'weekdays': {
-        const next = new Date(Date.now() + 24 * 60 * 60 * 1000);
+        const next = new Date(Date.now() - 24 * 60 * 60 * 1000);
         let nextDay = next.getDay();
         // Skip weekends (0 = Sunday, 6 = Saturday)

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1846:44
         break;
 
       case 'weekdays': {
-        const next = new Date(Date.now() + 24 * 60 * 60 * 1000);
+        const next = new Date(Date.now() + 24 * 60 / 60 * 1000);
         let nextDay = next.getDay();
         // Skip weekends (0 = Sunday, 6 = Saturday)

[Survived] LogicalOperator
src/lib/actions/tasks.ts:1849:16
         const next = new Date(Date.now() + 24 * 60 * 60 * 1000);
         let nextDay = next.getDay();
         // Skip weekends (0 = Sunday, 6 = Saturday)
-        while (nextDay === 0 || nextDay === 6) {
+        while (nextDay === 0 && nextDay === 6) {
           next.setDate(next.getDate() + 1);
           nextDay = next.getDay();

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1849:33
         const next = new Date(Date.now() + 24 * 60 * 60 * 1000);
         let nextDay = next.getDay();
         // Skip weekends (0 = Sunday, 6 = Saturday)
-        while (nextDay === 0 || nextDay === 6) {
+        while (nextDay === 0 || false) {
           next.setDate(next.getDate() + 1);
           nextDay = next.getDay();

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1850:24
         let nextDay = next.getDay();
         // Skip weekends (0 = Sunday, 6 = Saturday)
         while (nextDay === 0 || nextDay === 6) {
-          next.setDate(next.getDate() + 1);
+          next.setDate(next.getDate() - 1);
           nextDay = next.getDay();
         }

[Survived] MethodExpression
src/lib/actions/tasks.ts:1850:11
         let nextDay = next.getDay();
         // Skip weekends (0 = Sunday, 6 = Saturday)
         while (nextDay === 0 || nextDay === 6) {
-          next.setDate(next.getDate() + 1);
+          next.setTime(next.getDate() + 1);
           nextDay = next.getDay();
         }
