[Killed] BlockStatement
src/lib/email/index.ts:21:63
  * Validate SMTP configuration to prevent injection attacks
  * @internal Used to validate SMTP config before creating transporter
  */
-export function validateSmtpConfig(config: EmailConfig): void {
-  // Validate host - only allow alphanumeric, dots, and hyphens
-  if (!/^[a-zA-Z0-9]([a-zA-Z0-9.-]*[a-zA-Z0-9])?$/.test(config.host)) {
-    throw new Error(`Invalid SMTP host: ${config.host}`);
-  }
-
-  // Validate port - must be valid TCP port
-  if (
-    !Number.isInteger(config.port) ||
-    config.port < 1 ||
-    config.port > 65535
-  ) {
-    throw new Error(`Invalid SMTP port: ${config.port}`);
-  }
-
-  // Validate port is not 25 to avoid potential issues with non-encrypted SMTP
-  if (config.port === 25 && !config.secure) {
-    console.warn('Warning: Using non-encrypted SMTP on port 25');
-  }
-}
+export function validateSmtpConfig(config: EmailConfig): void {}
 
 /**
killedBy: email validateSmtpConfig should reject host with CRLF injection characters
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/email/index.ts:23:71
  */
 export function validateSmtpConfig(config: EmailConfig): void {
   // Validate host - only allow alphanumeric, dots, and hyphens
-  if (!/^[a-zA-Z0-9]([a-zA-Z0-9.-]*[a-zA-Z0-9])?$/.test(config.host)) {
-    throw new Error(`Invalid SMTP host: ${config.host}`);
-  }
+  if (!/^[a-zA-Z0-9]([a-zA-Z0-9.-]*[a-zA-Z0-9])?$/.test(config.host)) {}
 
   // Validate port - must be valid TCP port
killedBy: email validateSmtpConfig should reject host with CRLF injection characters
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/email/index.ts:23:7
  */
 export function validateSmtpConfig(config: EmailConfig): void {
   // Validate host - only allow alphanumeric, dots, and hyphens
-  if (!/^[a-zA-Z0-9]([a-zA-Z0-9.-]*[a-zA-Z0-9])?$/.test(config.host)) {
+  if (/^[a-zA-Z0-9]([a-zA-Z0-9.-]*[a-zA-Z0-9])?$/.test(config.host)) {
     throw new Error(`Invalid SMTP host: ${config.host}`);
   }
killedBy: email validateSmtpConfig should accept valid SMTP configuration
statusReason: expected [Function] to not throw an error but 'Error: Invalid SMTP host: smtp.exampl…' was thrown

[Killed] StringLiteral
src/lib/email/index.ts:24:21
 export function validateSmtpConfig(config: EmailConfig): void {
   // Validate host - only allow alphanumeric, dots, and hyphens
   if (!/^[a-zA-Z0-9]([a-zA-Z0-9.-]*[a-zA-Z0-9])?$/.test(config.host)) {
-    throw new Error(`Invalid SMTP host: ${config.host}`);
+    throw new Error(``);
   }
 
killedBy: email validateSmtpConfig should reject host with CRLF injection characters
statusReason: expected [Function] to throw error including 'Invalid SMTP host' but got ''

[Killed] LogicalOperator
src/lib/email/index.ts:29:5
 
   // Validate port - must be valid TCP port
   if (
-    !Number.isInteger(config.port) ||
-    config.port < 1 ||
+    !Number.isInteger(config.port) && config.port < 1 ||
     config.port > 65535
   ) {
killedBy: email validateSmtpConfig should reject invalid port (negative)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/email/index.ts:29:5
 
   // Validate port - must be valid TCP port
   if (
-    !Number.isInteger(config.port) ||
-    config.port < 1 ||
-    config.port > 65535
+    true
   ) {
     throw new Error(`Invalid SMTP port: ${config.port}`);
killedBy: email validateSmtpConfig should accept valid SMTP configuration
statusReason: expected [Function] to not throw an error but 'Error: Invalid SMTP port: 587' was thrown

[Killed] ConditionalExpression
src/lib/email/index.ts:30:5
   // Validate port - must be valid TCP port
   if (
     !Number.isInteger(config.port) ||
-    config.port < 1 ||
+    false ||
     config.port > 65535
   ) {
killedBy: email validateSmtpConfig should reject invalid port (negative)
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/email/index.ts:30:5
   // Validate port - must be valid TCP port
   if (
     !Number.isInteger(config.port) ||
-    config.port < 1 ||
+    config.port >= 1 ||
     config.port > 65535
   ) {
killedBy: email validateSmtpConfig should accept valid SMTP configuration
statusReason: expected [Function] to not throw an error but 'Error: Invalid SMTP port: 587' was thrown

[Killed] ConditionalExpression
src/lib/email/index.ts:31:5
   if (
     !Number.isInteger(config.port) ||
     config.port < 1 ||
-    config.port > 65535
+    false
   ) {
     throw new Error(`Invalid SMTP port: ${config.port}`);
killedBy: email validateSmtpConfig should reject invalid port (too high)
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/email/index.ts:31:5
   if (
     !Number.isInteger(config.port) ||
     config.port < 1 ||
-    config.port > 65535
+    config.port <= 65535
   ) {
     throw new Error(`Invalid SMTP port: ${config.port}`);
killedBy: email validateSmtpConfig should accept valid SMTP configuration
statusReason: expected [Function] to not throw an error but 'Error: Invalid SMTP port: 587' was thrown

[Killed] BlockStatement
src/lib/email/index.ts:32:5
     !Number.isInteger(config.port) ||
     config.port < 1 ||
     config.port > 65535
-  ) {
-    throw new Error(`Invalid SMTP port: ${config.port}`);
-  }
+  ) {}
 
   // Validate port is not 25 to avoid potential issues with non-encrypted SMTP
killedBy: email validateSmtpConfig should reject invalid port (negative)
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/email/index.ts:37:45
   }
 
   // Validate port is not 25 to avoid potential issues with non-encrypted SMTP
-  if (config.port === 25 && !config.secure) {
-    console.warn('Warning: Using non-encrypted SMTP on port 25');
-  }
+  if (config.port === 25 && !config.secure) {}
 }
 
killedBy: email validateSmtpConfig should warn about port 25 without secure
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] EqualityOperator
src/lib/email/index.ts:37:7
   }
 
   // Validate port is not 25 to avoid potential issues with non-encrypted SMTP
-  if (config.port === 25 && !config.secure) {
+  if (config.port !== 25 && !config.secure) {
     console.warn('Warning: Using non-encrypted SMTP on port 25');
   }
killedBy: email validateSmtpConfig should warn about port 25 without secure
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/lib/email/index.ts:46:54
  * Sanitize email address to prevent header injection
  * @internal Used to sanitize email addresses before sending
  */
-export function sanitizeEmail(email: string): string {
-  // Remove line breaks and other injection characters
-  return email.replace(/[\r\n<>,;:\\]/g, '');
-}
+export function sanitizeEmail(email: string): string {}
 
 /**
killedBy: email sanitizeEmail should remove carriage return characters
statusReason: expected undefined to be 'test@example.com' // Object.is equality

[Killed] StringLiteral
src/lib/email/index.ts:48:42
  */
 export function sanitizeEmail(email: string): string {
   // Remove line breaks and other injection characters
-  return email.replace(/[\r\n<>,;:\\]/g, '');
+  return email.replace(/[\r\n<>,;:\\]/g, "Stryker was here!");
 }
 
killedBy: email sanitizeEmail should remove carriage return characters
statusReason: expected 'testStryker was here!@example.com' to be 'test@example.com' // Object.is equality

[Killed] BlockStatement
src/lib/email/index.ts:65:7
 // Create transporter with config
 function createTransporter(config?: EmailConfig) {
   // Check if nodemailer is available
-  try {
-    // eslint-disable-next-line @typescript-eslint/no-require-imports
-    const nodemailer = require('nodemailer');
-
-    const smtp = config || {
-      host: process.env.SMTP_HOST || 'smtp.resend.dev',
-      port: parseInt(process.env.SMTP_PORT || '587'),
-      secure: false,
-      auth: {
-        user: process.env.SMTP_USER || 'resend',
-        pass: process.env.SMTP_PASS || '',
-      },
-    };
-
-    // Validate configuration to prevent injection attacks
-    if (config || process.env.SMTP_HOST) {
-      validateSmtpConfig(smtp);
-    }
-
-    return nodemailer.createTransporter(smtp);
-  } catch {
+  try {} catch {
     // Fallback stub for development
     return {
killedBy: email sendTaskReminderEmail should send reminder email and return boolean
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/lib/email/index.ts:69:18
     // eslint-disable-next-line @typescript-eslint/no-require-imports
     const nodemailer = require('nodemailer');
 
-    const smtp = config || {
-      host: process.env.SMTP_HOST || 'smtp.resend.dev',
-      port: parseInt(process.env.SMTP_PORT || '587'),
-      secure: false,
-      auth: {
-        user: process.env.SMTP_USER || 'resend',
-        pass: process.env.SMTP_PASS || '',
-      },
-    };
+    const smtp = true;
 
     // Validate configuration to prevent injection attacks

[Survived] LogicalOperator
src/lib/email/index.ts:69:18
     // eslint-disable-next-line @typescript-eslint/no-require-imports
     const nodemailer = require('nodemailer');
 
-    const smtp = config || {
-      host: process.env.SMTP_HOST || 'smtp.resend.dev',
-      port: parseInt(process.env.SMTP_PORT || '587'),
-      secure: false,
-      auth: {
-        user: process.env.SMTP_USER || 'resend',
-        pass: process.env.SMTP_PASS || '',
-      },
-    };
+    const smtp = config && {
+  host: process.env.SMTP_HOST || 'smtp.resend.dev',
+  port: parseInt(process.env.SMTP_PORT || '587'),
+  secure: false,
+  auth: {
+    user: process.env.SMTP_USER || 'resend',
+    pass: process.env.SMTP_PASS || ''
+  }
+};
 
     // Validate configuration to prevent injection attacks

[Survived] ConditionalExpression
src/lib/email/index.ts:70:13
     const nodemailer = require('nodemailer');
 
     const smtp = config || {
-      host: process.env.SMTP_HOST || 'smtp.resend.dev',
+      host: true,
       port: parseInt(process.env.SMTP_PORT || '587'),
       secure: false,

[Survived] ConditionalExpression
src/lib/email/index.ts:70:13
     const nodemailer = require('nodemailer');
 
     const smtp = config || {
-      host: process.env.SMTP_HOST || 'smtp.resend.dev',
+      host: false,
       port: parseInt(process.env.SMTP_PORT || '587'),
       secure: false,

[Survived] ConditionalExpression
src/lib/email/index.ts:71:22
 
     const smtp = config || {
       host: process.env.SMTP_HOST || 'smtp.resend.dev',
-      port: parseInt(process.env.SMTP_PORT || '587'),
+      port: parseInt(false),
       secure: false,
       auth: {

[Survived] LogicalOperator
src/lib/email/index.ts:71:22
 
     const smtp = config || {
       host: process.env.SMTP_HOST || 'smtp.resend.dev',
-      port: parseInt(process.env.SMTP_PORT || '587'),
+      port: parseInt(process.env.SMTP_PORT && '587'),
       secure: false,
       auth: {

[Survived] BooleanLiteral
src/lib/email/index.ts:72:15
     const smtp = config || {
       host: process.env.SMTP_HOST || 'smtp.resend.dev',
       port: parseInt(process.env.SMTP_PORT || '587'),
-      secure: false,
+      secure: true,
       auth: {
         user: process.env.SMTP_USER || 'resend',

[Survived] LogicalOperator
src/lib/email/index.ts:74:15
       port: parseInt(process.env.SMTP_PORT || '587'),
       secure: false,
       auth: {
-        user: process.env.SMTP_USER || 'resend',
+        user: process.env.SMTP_USER && 'resend',
         pass: process.env.SMTP_PASS || '',
       },

[Survived] ConditionalExpression
src/lib/email/index.ts:74:15
       port: parseInt(process.env.SMTP_PORT || '587'),
       secure: false,
       auth: {
-        user: process.env.SMTP_USER || 'resend',
+        user: false,
         pass: process.env.SMTP_PASS || '',
       },

[Survived] LogicalOperator
src/lib/email/index.ts:75:15
       secure: false,
       auth: {
         user: process.env.SMTP_USER || 'resend',
-        pass: process.env.SMTP_PASS || '',
+        pass: process.env.SMTP_PASS && '',
       },
     };

[Survived] ConditionalExpression
src/lib/email/index.ts:75:15
       secure: false,
       auth: {
         user: process.env.SMTP_USER || 'resend',
-        pass: process.env.SMTP_PASS || '',
+        pass: true,
       },
     };

[Survived] ConditionalExpression
src/lib/email/index.ts:80:9
     };
 
     // Validate configuration to prevent injection attacks
-    if (config || process.env.SMTP_HOST) {
+    if (false) {
       validateSmtpConfig(smtp);
     }

[Survived] LogicalOperator
src/lib/email/index.ts:80:9
     };
 
     // Validate configuration to prevent injection attacks
-    if (config || process.env.SMTP_HOST) {
+    if (config && process.env.SMTP_HOST) {
       validateSmtpConfig(smtp);
     }

[Killed] BlockStatement
src/lib/email/index.ts:85:11
     }
 
     return nodemailer.createTransporter(smtp);
-  } catch {
-    // Fallback stub for development
-    return {
-      sendMail: async () => ({ success: true }),
-    };
-  }
+  } catch {}
 }
 
killedBy: email sendTaskReminderEmail should send reminder email and return boolean
statusReason: expected false to be true // Object.is equality

[Survived] ArrowFunction
src/lib/email/index.ts:88:17
   } catch {
     // Fallback stub for development
     return {
-      sendMail: async () => ({ success: true }),
+      sendMail: () => undefined,
     };
   }

[Survived] BooleanLiteral
src/lib/email/index.ts:88:41
   } catch {
     // Fallback stub for development
     return {
-      sendMail: async () => ({ success: true }),
+      sendMail: async () => ({ success: false }),
     };
   }

[Killed] BlockStatement
src/lib/email/index.ts:103:21
 export async function sendEmail(
   options: EmailOptions,
   config?: EmailConfig
-): Promise<boolean> {
-  try {
-    const transporter = createTransporter(config);
-
-    await transporter.sendMail({
-      from: process.env.EMAIL_FROM || 'TaskFlow <noreply@taskflow.app>',
-      to: options.to,
-      subject: options.subject,
-      html: options.html,
-      text: options.text,
-    });
-
-    return true;
-  } catch (error) {
-    console.error('Failed to send email:', error);
-    return false;
-  }
-}
+): Promise<boolean> {}
 
 export interface EmailTask {
killedBy: email sendTaskReminderEmail should send reminder email and return boolean
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/lib/email/index.ts:104:7
   options: EmailOptions,
   config?: EmailConfig
 ): Promise<boolean> {
-  try {
-    const transporter = createTransporter(config);
-
-    await transporter.sendMail({
-      from: process.env.EMAIL_FROM || 'TaskFlow <noreply@taskflow.app>',
-      to: options.to,
-      subject: options.subject,
-      html: options.html,
-      text: options.text,
-    });
-
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     console.error('Failed to send email:', error);
     return false;
killedBy: email sendTaskReminderEmail should send reminder email and return boolean
statusReason: expected undefined to be true // Object.is equality

[Survived] ObjectLiteral
src/lib/email/index.ts:107:32
   try {
     const transporter = createTransporter(config);
 
-    await transporter.sendMail({
-      from: process.env.EMAIL_FROM || 'TaskFlow <noreply@taskflow.app>',
-      to: options.to,
-      subject: options.subject,
-      html: options.html,
-      text: options.text,
-    });
+    await transporter.sendMail({});
 
     return true;

[Survived] LogicalOperator
src/lib/email/index.ts:108:13
     const transporter = createTransporter(config);
 
     await transporter.sendMail({
-      from: process.env.EMAIL_FROM || 'TaskFlow <noreply@taskflow.app>',
+      from: process.env.EMAIL_FROM && 'TaskFlow <noreply@taskflow.app>',
       to: options.to,
       subject: options.subject,

[Survived] ConditionalExpression
src/lib/email/index.ts:108:13
     const transporter = createTransporter(config);
 
     await transporter.sendMail({
-      from: process.env.EMAIL_FROM || 'TaskFlow <noreply@taskflow.app>',
+      from: true,
       to: options.to,
       subject: options.subject,

[NoCoverage] BlockStatement
src/lib/email/index.ts:116:19
     });
 
     return true;
-  } catch (error) {
-    console.error('Failed to send email:', error);
-    return false;
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/lib/email/index.ts:117:19
 
     return true;
   } catch (error) {
-    console.error('Failed to send email:', error);
+    console.error("", error);
     return false;
   }

[NoCoverage] BooleanLiteral
src/lib/email/index.ts:118:12
     return true;
   } catch (error) {
     console.error('Failed to send email:', error);
-    return false;
+    return true;
   }
 }

[Killed] BlockStatement
src/lib/email/index.ts:133:84
 /**
  * Get notification settings for a user
  */
-export async function getUserNotificationSettings(): Promise<NotificationSettings> {
-  // In a real implementation, this would fetch from the database
-  // For now, return default settings
-  return {
-    enabled: true,
-    reminderMinutes: 60,
-    dueDateReminders: true,
-    overdueReminders: true,
-    dailySummary: false,
-  };
-}
+export async function getUserNotificationSettings(): Promise<NotificationSettings> {}
 
 /**
killedBy: email notification settings should return default notification settings
statusReason: Cannot read properties of undefined (reading 'enabled')

[Killed] ObjectLiteral
src/lib/email/index.ts:136:10
 export async function getUserNotificationSettings(): Promise<NotificationSettings> {
   // In a real implementation, this would fetch from the database
   // For now, return default settings
-  return {
-    enabled: true,
-    reminderMinutes: 60,
-    dueDateReminders: true,
-    overdueReminders: true,
-    dailySummary: false,
-  };
+  return {};
 }
 
killedBy: email notification settings should return default notification settings
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/email/index.ts:139:23
   return {
     enabled: true,
     reminderMinutes: 60,
-    dueDateReminders: true,
+    dueDateReminders: false,
     overdueReminders: true,
     dailySummary: false,
killedBy: email notification settings should return default notification settings
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/email/index.ts:140:23
     enabled: true,
     reminderMinutes: 60,
     dueDateReminders: true,
-    overdueReminders: true,
+    overdueReminders: false,
     dailySummary: false,
   };
killedBy: email notification settings should return default notification settings
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/email/index.ts:141:19
     reminderMinutes: 60,
     dueDateReminders: true,
     overdueReminders: true,
-    dailySummary: false,
+    dailySummary: true,
   };
 }
killedBy: email notification settings should return default notification settings
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/email/index.ts:153:21
   userId: number,
   task: EmailTask,
   type: 'reminder' | 'due_soon' | 'overdue'
-): Promise<boolean> {
-  void userId;
-  const settings = await getUserNotificationSettings();
-
-  if (!settings.enabled) return false;
-
-  switch (type) {
-    case 'reminder':
-      return settings.reminderMinutes > 0;
-    case 'due_soon':
-      return settings.dueDateReminders;
-    case 'overdue':
-      return settings.overdueReminders;
-    default:
-      return false;
-  }
-}
+): Promise<boolean> {}
 
 export async function sendTaskReminderEmail(
killedBy: email notification settings should return true for reminders when enabled
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/email/index.ts:157:7
   void userId;
   const settings = await getUserNotificationSettings();
 
-  if (!settings.enabled) return false;
+  if (settings.enabled) return false;
 
   switch (type) {
killedBy: email notification settings should return true for reminders when enabled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/email/index.ts:157:7
   void userId;
   const settings = await getUserNotificationSettings();
 
-  if (!settings.enabled) return false;
+  if (true) return false;
 
   switch (type) {
killedBy: email notification settings should return true for reminders when enabled
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/lib/email/index.ts:160:5
   if (!settings.enabled) return false;
 
   switch (type) {
-    case 'reminder':
-      return settings.reminderMinutes > 0;
+    case 'reminder':
     case 'due_soon':
       return settings.dueDateReminders;

[Killed] EqualityOperator
src/lib/email/index.ts:161:14
 
   switch (type) {
     case 'reminder':
-      return settings.reminderMinutes > 0;
+      return settings.reminderMinutes <= 0;
     case 'due_soon':
       return settings.dueDateReminders;
killedBy: email notification settings should return true for reminders when enabled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/email/index.ts:161:14
 
   switch (type) {
     case 'reminder':
-      return settings.reminderMinutes > 0;
+      return false;
     case 'due_soon':
       return settings.dueDateReminders;
killedBy: email notification settings should return true for reminders when enabled
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/lib/email/index.ts:162:5
   switch (type) {
     case 'reminder':
       return settings.reminderMinutes > 0;
-    case 'due_soon':
-      return settings.dueDateReminders;
+    case 'due_soon':
     case 'overdue':
       return settings.overdueReminders;

[Killed] ConditionalExpression
src/lib/email/index.ts:164:5
       return settings.reminderMinutes > 0;
     case 'due_soon':
       return settings.dueDateReminders;
-    case 'overdue':
-      return settings.overdueReminders;
+    case 'overdue':
     default:
       return false;
killedBy: email notification settings should return true for overdue when enabled
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/email/index.ts:164:10
       return settings.reminderMinutes > 0;
     case 'due_soon':
       return settings.dueDateReminders;
-    case 'overdue':
+    case "":
       return settings.overdueReminders;
     default:
killedBy: email notification settings should return true for overdue when enabled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/email/index.ts:166:5
       return settings.dueDateReminders;
     case 'overdue':
       return settings.overdueReminders;
-    default:
-      return false;
+    default:
   }
 }
killedBy: email notification settings should return false for unknown notification type
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/lib/email/index.ts:174:21
 export async function sendTaskReminderEmail(
   userEmail: string,
   task: EmailTask
-): Promise<boolean> {
-  const subject = `Task Reminder: ${task.name}`;
-  const html = `
-    <h2>Task Reminder</h2>
-    <p>You have a pending task:</p>
-    <h3>${task.name}</h3>
-    ${task.description ? `<p>${task.description}</p>` : ''}
-    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : ''}
-    <p><a href="${process.env.NEXTAUTH_URL}/tasks/${task.id}">View Task</a></p>
-  `;
-
-  return sendEmail({
-    to: userEmail,
-    subject,
-    html,
-  });
-}
+): Promise<boolean> {}
 
 export async function sendDueSoonEmail(
killedBy: email sendTaskReminderEmail should send reminder email and return boolean
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
src/lib/email/index.ts:181:100
     <p>You have a pending task:</p>
     <h3>${task.name}</h3>
     ${task.description ? `<p>${task.description}</p>` : ''}
-    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : ''}
+    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : "Stryker was here!"}
     <p><a href="${process.env.NEXTAUTH_URL}/tasks/${task.id}">View Task</a></p>
   `;

[Survived] StringLiteral
src/lib/email/index.ts:181:23
     <p>You have a pending task:</p>
     <h3>${task.name}</h3>
     ${task.description ? `<p>${task.description}</p>` : ''}
-    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : ''}
+    ${task.deadline ? `` : ''}
     <p><a href="${process.env.NEXTAUTH_URL}/tasks/${task.id}">View Task</a></p>
   `;

[Survived] ObjectLiteral
src/lib/email/index.ts:185:20
     <p><a href="${process.env.NEXTAUTH_URL}/tasks/${task.id}">View Task</a></p>
   `;
 
-  return sendEmail({
-    to: userEmail,
-    subject,
-    html,
-  });
+  return sendEmail({});
 }
 

[Killed] BlockStatement
src/lib/email/index.ts:195:21
 export async function sendDueSoonEmail(
   userEmail: string,
   task: EmailTask
-): Promise<boolean> {
-  const subject = `Due Soon: ${task.name}`;
-  const html = `
-    <h2>Task Due Soon</h2>
-    <p>The following task is due soon:</p>
-    <h3>${task.name}</h3>
-    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : ''}
-    <p><a href="${process.env.NEXTAUTH_URL}/tasks/${task.id}">View Task</a></p>
-  `;
-
-  return sendEmail({
-    to: userEmail,
-    subject,
-    html,
-  });
-}
+): Promise<boolean> {}
 
 export async function sendTaskSharedEmail(
killedBy: email sendDueSoonEmail should send due soon email and return boolean
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
src/lib/email/index.ts:197:16
   task: EmailTask
 ): Promise<boolean> {
   const subject = `Due Soon: ${task.name}`;
-  const html = `
-    <h2>Task Due Soon</h2>
-    <p>The following task is due soon:</p>
-    <h3>${task.name}</h3>
-    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : ''}
-    <p><a href="${process.env.NEXTAUTH_URL}/tasks/${task.id}">View Task</a></p>
-  `;
+  const html = ``;
 
   return sendEmail({

[Survived] StringLiteral
src/lib/email/index.ts:201:100
     <h2>Task Due Soon</h2>
     <p>The following task is due soon:</p>
     <h3>${task.name}</h3>
-    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : ''}
+    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : "Stryker was here!"}
     <p><a href="${process.env.NEXTAUTH_URL}/tasks/${task.id}">View Task</a></p>
   `;

[Survived] StringLiteral
src/lib/email/index.ts:201:23
     <h2>Task Due Soon</h2>
     <p>The following task is due soon:</p>
     <h3>${task.name}</h3>
-    ${task.deadline ? `<p><strong>Due:</strong> ${new Date(task.deadline).toLocaleString()}</p>` : ''}
+    ${task.deadline ? `` : ''}
     <p><a href="${process.env.NEXTAUTH_URL}/tasks/${task.id}">View Task</a></p>
   `;

[Killed] BlockStatement
src/lib/email/index.ts:217:21
   taskName: string,
   sharerName: string,
   permission: 'view' | 'edit'
-): Promise<boolean> {
-  const subject = `${sharerName} shared a task with you`;
-  const html = `
-    <h2>Task Shared With You</h2>
-    <p>${sharerName} has shared a task with you.</p>
-    <h3>${taskName}</h3>
-    <p><strong>Your permission:</strong> ${permission}</p>
-    <p><a href="${process.env.NEXTAUTH_URL}/tasks">View Tasks</a></p>
-  `;
-
-  return sendEmail({
-    to: userEmail,
-    subject,
-    html,
-  });
-}
+): Promise<boolean> {}
 
 export async function sendWeeklyDigest(
killedBy: email sendTaskSharedEmail should send task shared email and return boolean
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
src/lib/email/index.ts:218:19
   sharerName: string,
   permission: 'view' | 'edit'
 ): Promise<boolean> {
-  const subject = `${sharerName} shared a task with you`;
+  const subject = ``;
   const html = `
     <h2>Task Shared With You</h2>

[Killed] BlockStatement
src/lib/email/index.ts:242:21
     overdueTasks: number;
     criticalTasks: number;
   }
-): Promise<boolean> {
-  const subject = `Your Weekly Task Summary`;
-  const html = `
-    <h2>Weekly Task Summary</h2>
-    <div style="display: grid; gap: 8px;">
-      <div><strong>Total Tasks:</strong> ${summary.totalTasks}</div>
-      <div><strong>Completed:</strong> ${summary.completedTasks}</div>
-      <div><strong>Overdue:</strong> ${summary.overdueTasks}</div>
-      <div><strong>Critical:</strong> ${summary.criticalTasks}</div>
-    </div>
-    <p style="margin-top: 16px;"><a href="${process.env.NEXTAUTH_URL}">View Dashboard</a></p>
-  `;
-
-  return sendEmail({
-    to: userEmail,
-    subject,
-    html,
-  });
-}
+): Promise<boolean> {}
 
killedBy: email sendWeeklyDigest should send weekly digest with summary stats
statusReason: expected undefined to be true // Object.is equality
