[Survived] StringLiteral
src/lib/actions/tasks.ts:1853:45
           next.setDate(next.getDate() + 1);
           nextDay = next.getDay();
         }
-        nextDate = next.toISOString().split('T')[0];
+        nextDate = next.toISOString().split("")[0];
         break;
       }

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1857:7
         break;
       }
 
-      case 'monthly':
-        nextDate = new Date(Date.now() + 30 * 24 * 60 * 60 * 1000)
-          .toISOString()
-          .split('T')[0];
-        break;
+      case 'monthly':
 
       case 'yearly':

[Survived] StringLiteral
src/lib/actions/tasks.ts:1857:12
         break;
       }
 
-      case 'monthly':
+      case "":
         nextDate = new Date(Date.now() + 30 * 24 * 60 * 60 * 1000)
           .toISOString()

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1858:42
       }
 
       case 'monthly':
-        nextDate = new Date(Date.now() + 30 * 24 * 60 * 60 * 1000)
+        nextDate = new Date(Date.now() + 30 * 24 * 60 / 60 * 1000)
           .toISOString()
           .split('T')[0];

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1858:42
       }
 
       case 'monthly':
-        nextDate = new Date(Date.now() + 30 * 24 * 60 * 60 * 1000)
+        nextDate = new Date(Date.now() + 30 * 24 * 60 * 60 / 1000)
           .toISOString()
           .split('T')[0];

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1863:7
           .split('T')[0];
         break;
 
-      case 'yearly':
-        nextDate = new Date(Date.now() + 365 * 24 * 60 * 60 * 1000)
-          .toISOString()
-          .split('T')[0];
-        break;
+      case 'yearly':
 
       case 'custom':

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1864:42
         break;
 
       case 'yearly':
-        nextDate = new Date(Date.now() + 365 * 24 * 60 * 60 * 1000)
+        nextDate = new Date(Date.now() + 365 * 24 * 60 / 60 * 1000)
           .toISOString()
           .split('T')[0];

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1864:29
         break;
 
       case 'yearly':
-        nextDate = new Date(Date.now() + 365 * 24 * 60 * 60 * 1000)
+        nextDate = new Date(Date.now() - 365 * 24 * 60 * 60 * 1000)
           .toISOString()
           .split('T')[0];

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1869:7
           .split('T')[0];
         break;
 
-      case 'custom':
-        if (config.interval && config.unit) {
-          const multiplier =
-            config.unit === 'days'
-              ? 1
-              : config.unit === 'weeks'
-                ? 7
-                : config.unit === 'months'
-                  ? 30
-                  : 365;
-          nextDate = new Date(
-            Date.now() + config.interval * multiplier * 24 * 60 * 60 * 1000
-          )
-            .toISOString()
-            .split('T')[0];
-        }
-        break;
+      case 'custom':
     }
 

[Survived] StringLiteral
src/lib/actions/tasks.ts:1869:12
           .split('T')[0];
         break;
 
-      case 'custom':
+      case "":
         if (config.interval && config.unit) {
           const multiplier =

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1870:13
         break;
 
       case 'custom':
-        if (config.interval && config.unit) {
+        if (true) {
           const multiplier =
             config.unit === 'days'
killedBy: Task Actions - Archive/Recurring Functions generateRecurringTasks should handle custom recurring_config that returns non-object from JSON.parse
statusReason: Invalid time value

[Survived] LogicalOperator
src/lib/actions/tasks.ts:1870:13
         break;
 
       case 'custom':
-        if (config.interval && config.unit) {
+        if (config.interval || config.unit) {
           const multiplier =
             config.unit === 'days'

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1872:13
       case 'custom':
         if (config.interval && config.unit) {
           const multiplier =
-            config.unit === 'days'
+            false
               ? 1
               : config.unit === 'weeks'

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1872:13
       case 'custom':
         if (config.interval && config.unit) {
           const multiplier =
-            config.unit === 'days'
+            true
               ? 1
               : config.unit === 'weeks'

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1874:17
           const multiplier =
             config.unit === 'days'
               ? 1
-              : config.unit === 'weeks'
+              : false
                 ? 7
                 : config.unit === 'months'

[Survived] EqualityOperator
src/lib/actions/tasks.ts:1874:17
           const multiplier =
             config.unit === 'days'
               ? 1
-              : config.unit === 'weeks'
+              : config.unit !== 'weeks'
                 ? 7
                 : config.unit === 'months'

[NoCoverage] EqualityOperator
src/lib/actions/tasks.ts:1876:19
               ? 1
               : config.unit === 'weeks'
                 ? 7
-                : config.unit === 'months'
+                : config.unit !== 'months'
                   ? 30
                   : 365;

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:1876:19
               ? 1
               : config.unit === 'weeks'
                 ? 7
-                : config.unit === 'months'
+                : false
                   ? 30
                   : 365;

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1880:26
                   ? 30
                   : 365;
           nextDate = new Date(
-            Date.now() + config.interval * multiplier * 24 * 60 * 60 * 1000
+            Date.now() + config.interval * multiplier * 24 * 60 * 60 / 1000
           )
             .toISOString()

[Survived] ArithmeticOperator
src/lib/actions/tasks.ts:1880:26
                   ? 30
                   : 365;
           nextDate = new Date(
-            Date.now() + config.interval * multiplier * 24 * 60 * 60 * 1000
+            Date.now() + config.interval * multiplier * 24 / 60 * 60 * 1000
           )
             .toISOString()

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1888:9
         break;
     }
 
-    if (nextDate && (!task.date || task.date < nextDate)) {
+    if (true) {
       // Create new task instance
       await createTask({
killedBy: Task Actions - Archive/Recurring Functions generateRecurringTasks should handle custom recurring_config that returns non-object from JSON.parse
statusReason: expected 1 to be +0 // Object.is equality

[Survived] BooleanLiteral
src/lib/actions/tasks.ts:1888:22
         break;
     }
 
-    if (nextDate && (!task.date || task.date < nextDate)) {
+    if (nextDate && (task.date || task.date < nextDate)) {
       // Create new task instance
       await createTask({

[Survived] ObjectLiteral
src/lib/actions/tasks.ts:1890:24
 
     if (nextDate && (!task.date || task.date < nextDate)) {
       // Create new task instance
-      await createTask({
-        name: task.name,
-        description: task.description || undefined,
-        list_id: task.list_id || undefined,
-        date: nextDate,
-        priority: task.priority,
-        label_ids: [], // Labels not copied to recurring instances
-      });
+      await createTask({});
       generatedCount++;
     }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1892:22
       // Create new task instance
       await createTask({
         name: task.name,
-        description: task.description || undefined,
+        description: true,
         list_id: task.list_id || undefined,
         date: nextDate,
killedBy: Task Actions - Comprehensive Tests Task Operations generateRecurringTasks edge cases should handle non-custom recurring without config
statusReason: clean.replace is not a function

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1892:22
       // Create new task instance
       await createTask({
         name: task.name,
-        description: task.description || undefined,
+        description: false,
         list_id: task.list_id || undefined,
         date: nextDate,

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1893:18
       await createTask({
         name: task.name,
         description: task.description || undefined,
-        list_id: task.list_id || undefined,
+        list_id: true,
         date: nextDate,
         priority: task.priority,

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1893:18
       await createTask({
         name: task.name,
         description: task.description || undefined,
-        list_id: task.list_id || undefined,
+        list_id: false,
         date: nextDate,
         priority: task.priority,

[Survived] ArrayDeclaration
src/lib/actions/tasks.ts:1896:20
         list_id: task.list_id || undefined,
         date: nextDate,
         priority: task.priority,
-        label_ids: [], // Labels not copied to recurring instances
+        label_ids: ["Stryker was here"], // Labels not copied to recurring instances
       });
       generatedCount++;

[Killed] UpdateOperator
src/lib/actions/tasks.ts:1898:7
         priority: task.priority,
         label_ids: [], // Labels not copied to recurring instances
       });
-      generatedCount++;
+      generatedCount--;
     }
   }
killedBy: Task Actions - Archive/Recurring Functions generateRecurringTasks should generate daily recurring tasks
statusReason: expected -1 to be greater than or equal to 0

[Killed] BlockStatement
src/lib/actions/tasks.ts:1908:62
 /**
  * Archive a task (hide from active view without deleting)
  */
-export async function archiveTask(id: number): Promise<void> {
-  const db = getDb();
-  const user = await getCurrentUser();
-
-  if (!user?.id) {
-    throw new Error('Authentication required');
-  }
-
-  // Verify user owns the task
-  const existing = db
-    .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
-    .get(id, user.id);
-  if (!existing) {
-    throw new Error('Task not found or access denied');
-  }
-
-  db.prepare(
-    'UPDATE tasks SET archived = 1, updated_at = CURRENT_TIMESTAMP WHERE id = ?'
-  ).run(id);
-  logTaskAction(id, 'archived', 'Task archived');
-}
+export async function archiveTask(id: number): Promise<void> {}
 
 /**
killedBy: Task Actions - Archive/Recurring Functions archiveTask should archive a task successfully
statusReason: expected +0 to be 1 // Object.is equality

[Killed] OptionalChaining
src/lib/actions/tasks.ts:1912:8
   const db = getDb();
   const user = await getCurrentUser();
 
-  if (!user?.id) {
+  if (!user.id) {
     throw new Error('Authentication required');
   }
killedBy: Task Actions - Archive/Recurring Functions archiveTask should throw error when user is not authenticated
statusReason: expected [Function] to throw error including 'Authentication required' but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/lib/actions/tasks.ts:1912:18
   const db = getDb();
   const user = await getCurrentUser();
 
-  if (!user?.id) {
-    throw new Error('Authentication required');
-  }
+  if (!user?.id) {}
 
   // Verify user owns the task
killedBy: Task Actions - Archive/Recurring Functions archiveTask should throw error when user is not authenticated
statusReason: expected [Function] to throw error including 'Authentication required' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1920:7
   const existing = db
     .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
     .get(id, user.id);
-  if (!existing) {
+  if (true) {
     throw new Error('Task not found or access denied');
   }
killedBy: Task Actions - Archive/Recurring Functions archiveTask should archive a task successfully
statusReason: Task not found or access denied

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:1920:7
   const existing = db
     .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
     .get(id, user.id);
-  if (!existing) {
+  if (existing) {
     throw new Error('Task not found or access denied');
   }
killedBy: Task Actions - Archive/Recurring Functions archiveTask should archive a task successfully
statusReason: Task not found or access denied

[Killed] BlockStatement
src/lib/actions/tasks.ts:1933:64
 /**
  * Unarchive a task (restore to active view)
  */
-export async function unarchiveTask(id: number): Promise<void> {
-  const db = getDb();
-  const user = await getCurrentUser();
-
-  if (!user?.id) {
-    throw new Error('Authentication required');
-  }
-
-  // Verify user owns the task
-  const existing = db
-    .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
-    .get(id, user.id);
-  if (!existing) {
-    throw new Error('Task not found or access denied');
-  }
-
-  db.prepare(
-    'UPDATE tasks SET archived = 0, updated_at = CURRENT_TIMESTAMP WHERE id = ?'
-  ).run(id);
-  logTaskAction(id, 'unarchived', 'Task unarchived');
-}
+export async function unarchiveTask(id: number): Promise<void> {}
 
 /**
killedBy: Task Actions - Archive/Recurring Functions unarchiveTask should unarchive a task successfully
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1937:7
   const db = getDb();
   const user = await getCurrentUser();
 
-  if (!user?.id) {
+  if (false) {
     throw new Error('Authentication required');
   }
killedBy: Task Actions - Archive/Recurring Functions unarchiveTask should throw error when user is not authenticated
statusReason: expected [Function] to throw error including 'Authentication required' but got 'Cannot read properties of null (readi…'

[Killed] StringLiteral
src/lib/actions/tasks.ts:1938:21
   const user = await getCurrentUser();
 
   if (!user?.id) {
-    throw new Error('Authentication required');
+    throw new Error("");
   }
 
killedBy: Task Actions - Archive/Recurring Functions unarchiveTask should throw error when user is not authenticated
statusReason: expected [Function] to throw error including 'Authentication required' but got ''

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1945:7
   const existing = db
     .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
     .get(id, user.id);
-  if (!existing) {
+  if (false) {
     throw new Error('Task not found or access denied');
   }
killedBy: Task Actions - Archive/Recurring Functions unarchiveTask should throw error for non-existent task
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/lib/actions/tasks.ts:1946:21
     .prepare('SELECT id FROM tasks WHERE id = ? AND user_id = ?')
     .get(id, user.id);
   if (!existing) {
-    throw new Error('Task not found or access denied');
+    throw new Error("");
   }
 
killedBy: Task Actions - Archive/Recurring Functions unarchiveTask should throw error for non-existent task
statusReason: expected [Function] to throw error including 'Task not found or access denied' but got ''

[Killed] StringLiteral
src/lib/actions/tasks.ts:1950:5
   }
 
   db.prepare(
-    'UPDATE tasks SET archived = 0, updated_at = CURRENT_TIMESTAMP WHERE id = ?'
+    ""
   ).run(id);
   logTaskAction(id, 'unarchived', 'Task unarchived');
killedBy: Task Actions - Archive/Recurring Functions unarchiveTask should unarchive a task successfully
statusReason: expected 1 to be +0 // Object.is equality

[Survived] StringLiteral
src/lib/actions/tasks.ts:1952:35
   db.prepare(
     'UPDATE tasks SET archived = 0, updated_at = CURRENT_TIMESTAMP WHERE id = ?'
   ).run(id);
-  logTaskAction(id, 'unarchived', 'Task unarchived');
+  logTaskAction(id, 'unarchived', "");
 }
 

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:1962:7
   const db = getDb();
   const user = await getCurrentUser();
 
-  if (!user?.id) {
+  if (true) {
     return [];
   }
killedBy: Task Actions - Archive/Recurring Functions getArchivedTasks should return archived tasks for authenticated user
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:1976:23
   const relationsMap = await getTaskRelations(db, taskIds);
 
   return tasks.map(task => {
-    const relations = relationsMap[task.id] || {
-      labels: [],
-      subtasks: [],
-      reminders: [],
-      logs: [],
-      comments: [],
-      attachments: [],
-      blockers: [],
-      blocked_by: [],
-      assignee: undefined,
-      time_entries: [],
-      recurring_exceptions: [],
-    };
+    const relations = true;
     return {
       ...task,

[Survived] LogicalOperator
src/lib/actions/tasks.ts:1976:23
   const relationsMap = await getTaskRelations(db, taskIds);
 
   return tasks.map(task => {
-    const relations = relationsMap[task.id] || {
-      labels: [],
-      subtasks: [],
-      reminders: [],
-      logs: [],
-      comments: [],
-      attachments: [],
-      blockers: [],
-      blocked_by: [],
-      assignee: undefined,
-      time_entries: [],
-      recurring_exceptions: [],
-    };
+    const relations = relationsMap[task.id] && {
+  labels: [],
+  subtasks: [],
+  reminders: [],
+  logs: [],
+  comments: [],
+  attachments: [],
+  blockers: [],
+  blocked_by: [],
+  assignee: undefined,
+  time_entries: [],
+  recurring_exceptions: []
+};
     return {
       ...task,

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:1977:15
 
   return tasks.map(task => {
     const relations = relationsMap[task.id] || {
-      labels: [],
+      labels: ["Stryker was here"],
       subtasks: [],
       reminders: [],

[NoCoverage] ArrayDeclaration
src/lib/actions/tasks.ts:1987:29
       blocked_by: [],
       assignee: undefined,
       time_entries: [],
-      recurring_exceptions: [],
+      recurring_exceptions: ["Stryker was here"],
     };
     return {

[Killed] BlockStatement
src/lib/actions/tasks.ts:2032:38
 ): Promise<{ success: boolean; message: string; task?: TaskWithRelations }> {
   const { action, taskId, updates } = command;
 
-  if (action === 'delete' && taskId) {
-    await deleteTask(taskId);
-    return { success: true, message: 'Task deleted' };
-  }
+  if (action === 'delete' && taskId) {}
 
   if (taskId) {
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle delete action successfully
statusReason: expected 'Task updated' to be 'Task deleted' // Object.is equality

[Killed] EqualityOperator
src/lib/actions/tasks.ts:2032:7
 ): Promise<{ success: boolean; message: string; task?: TaskWithRelations }> {
   const { action, taskId, updates } = command;
 
-  if (action === 'delete' && taskId) {
+  if (action !== 'delete' && taskId) {
     await deleteTask(taskId);
     return { success: true, message: 'Task deleted' };
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle delete action successfully
statusReason: expected 'Task updated' to be 'Task deleted' // Object.is equality

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:2034:23
 
   if (action === 'delete' && taskId) {
     await deleteTask(taskId);
-    return { success: true, message: 'Task deleted' };
+    return { success: false, message: 'Task deleted' };
   }
 
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle delete action successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:2037:7
     return { success: true, message: 'Task deleted' };
   }
 
-  if (taskId) {
+  if (false) {
     const taskInput: Record<string, unknown> = {};
     if (
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle priority update with valid priority
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:2037:7
     return { success: true, message: 'Task deleted' };
   }
 
-  if (taskId) {
+  if (true) {
     const taskInput: Record<string, unknown> = {};
     if (
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should return failure when no valid task specified
statusReason: Task not found or access denied

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:2040:7
   if (taskId) {
     const taskInput: Record<string, unknown> = {};
     if (
-      updates?.priority &&
-      ['critical', 'high', 'medium', 'low', 'none'].includes(
-        updates.priority as string
-      )
+      true
     ) {
       taskInput.priority = updates.priority;
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should ignore invalid priority values
statusReason: expected 'invalid-priority' to be 'low' // Object.is equality

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:2040:7
   if (taskId) {
     const taskInput: Record<string, unknown> = {};
     if (
-      updates?.priority &&
-      ['critical', 'high', 'medium', 'low', 'none'].includes(
-        updates.priority as string
-      )
+      false
     ) {
       taskInput.priority = updates.priority;
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle priority update with valid priority
statusReason: expected 'low' to be 'critical' // Object.is equality

[Survived] StringLiteral
src/lib/actions/tasks.ts:2041:45
     const taskInput: Record<string, unknown> = {};
     if (
       updates?.priority &&
-      ['critical', 'high', 'medium', 'low', 'none'].includes(
+      ['critical', 'high', 'medium', 'low', ""].includes(
         updates.priority as string
       )

[Killed] BlockStatement
src/lib/actions/tasks.ts:2044:7
       ['critical', 'high', 'medium', 'low', 'none'].includes(
         updates.priority as string
       )
-    ) {
-      taskInput.priority = updates.priority;
-    }
+    ) {}
     if (updates?.list_id && typeof updates.list_id === 'number') {
       taskInput.list_id = updates.list_id;
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle priority update with valid priority
statusReason: expected 'low' to be 'critical' // Object.is equality

[Survived] ConditionalExpression
src/lib/actions/tasks.ts:2047:29
     ) {
       taskInput.priority = updates.priority;
     }
-    if (updates?.list_id && typeof updates.list_id === 'number') {
+    if (updates?.list_id && true) {
       taskInput.list_id = updates.list_id;
     }

[Survived] LogicalOperator
src/lib/actions/tasks.ts:2047:9
     ) {
       taskInput.priority = updates.priority;
     }
-    if (updates?.list_id && typeof updates.list_id === 'number') {
+    if (updates?.list_id || typeof updates.list_id === 'number') {
       taskInput.list_id = updates.list_id;
     }

[Killed] ConditionalExpression
src/lib/actions/tasks.ts:2050:9
     if (updates?.list_id && typeof updates.list_id === 'number') {
       taskInput.list_id = updates.list_id;
     }
-    if (updates?.completed !== undefined) {
+    if (false) {
       taskInput.completed = updates.completed ? 1 : 0;
     }
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle completed boolean update
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:2050:43
     if (updates?.list_id && typeof updates.list_id === 'number') {
       taskInput.list_id = updates.list_id;
     }
-    if (updates?.completed !== undefined) {
-      taskInput.completed = updates.completed ? 1 : 0;
-    }
+    if (updates?.completed !== undefined) {}
     if (updates?.date && typeof updates.date === 'string') {
       taskInput.date = updates.date;
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle completed boolean update
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/actions/tasks.ts:2053:26
     if (updates?.completed !== undefined) {
       taskInput.completed = updates.completed ? 1 : 0;
     }
-    if (updates?.date && typeof updates.date === 'string') {
+    if (updates?.date && typeof updates.date !== 'string') {
       taskInput.date = updates.date;
     }
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle date string update
statusReason: expected '2024-01-01' to be '2024-12-31' // Object.is equality

[Killed] BlockStatement
src/lib/actions/tasks.ts:2053:60
     if (updates?.completed !== undefined) {
       taskInput.completed = updates.completed ? 1 : 0;
     }
-    if (updates?.date && typeof updates.date === 'string') {
-      taskInput.date = updates.date;
-    }
+    if (updates?.date && typeof updates.date === 'string') {}
     if (updates?.deadline && typeof updates.deadline === 'string') {
       taskInput.deadline = updates.deadline;
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle date string update
statusReason: expected '2024-01-01' to be '2024-12-31' // Object.is equality

[Survived] OptionalChaining
src/lib/actions/tasks.ts:2056:9
     if (updates?.date && typeof updates.date === 'string') {
       taskInput.date = updates.date;
     }
-    if (updates?.deadline && typeof updates.deadline === 'string') {
+    if (updates.deadline && typeof updates.deadline === 'string') {
       taskInput.deadline = updates.deadline;
     }

[Survived] LogicalOperator
src/lib/actions/tasks.ts:2056:9
     if (updates?.date && typeof updates.date === 'string') {
       taskInput.date = updates.date;
     }
-    if (updates?.deadline && typeof updates.deadline === 'string') {
+    if (updates?.deadline || typeof updates.deadline === 'string') {
       taskInput.deadline = updates.deadline;
     }

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:2061:23
     }
 
     const updated = await updateTask(taskId, taskInput);
-    return { success: true, message: 'Task updated', task: updated };
+    return { success: false, message: 'Task updated', task: updated };
   }
 
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should handle priority update with valid priority
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/actions/tasks.ts:2064:21
     return { success: true, message: 'Task updated', task: updated };
   }
 
-  return { success: false, message: 'No valid task specified' };
+  return { success: true, message: 'No valid task specified' };
 }
 
killedBy: Task Actions - AI Edit Function editTaskWithAI edge cases should return failure when no valid task specified
statusReason: expected true to be false // Object.is equality

[NoCoverage] BooleanLiteral
src/lib/actions/tasks.ts:2097:7
   const db = getDb();
   const user = await getCurrentUser();
 
-  if (!user?.id) {
+  if (user?.id) {
     throw new Error('Authentication required');
   }

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2103:18
 
   // Generate a new ID (use the highest existing ID + 1)
   const maxIdResult = db.prepare('SELECT MAX(id) as max_id FROM tasks').get();
-  const newId = (maxIdResult?.max_id || 0) + 1;
+  const newId = (maxIdResult?.max_id && 0) + 1;
 
   const now = new Date().toISOString();

[NoCoverage] ConditionalExpression
src/lib/actions/tasks.ts:2103:18
 
   // Generate a new ID (use the highest existing ID + 1)
   const maxIdResult = db.prepare('SELECT MAX(id) as max_id FROM tasks').get();
-  const newId = (maxIdResult?.max_id || 0) + 1;
+  const newId = (false) + 1;
 
   const now = new Date().toISOString();

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:2108:14
   const now = new Date().toISOString();
 
   const _result = db
-    .prepare(`
-      INSERT INTO tasks
-      (id, user_id, name, description, notes, list_id, date, deadline, estimate, actual_time,
-       priority, recurring, recurring_config, sort_order, archived, created_at, updated_at)
-      VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, 0, ?, ?)
-    `)
+    .prepare(``)
     .run(
       newId,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2118:7
       newId,
       user.id,
       taskData.name,
-      taskData.description ?? null,
+      taskData.description && null,
       taskData.notes ?? null,
       taskData.list_id ?? null,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2119:7
       user.id,
       taskData.name,
       taskData.description ?? null,
-      taskData.notes ?? null,
+      taskData.notes && null,
       taskData.list_id ?? null,
       taskData.date ?? null,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2120:7
       taskData.name,
       taskData.description ?? null,
       taskData.notes ?? null,
-      taskData.list_id ?? null,
+      taskData.list_id && null,
       taskData.date ?? null,
       taskData.deadline ?? null,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2121:7
       taskData.description ?? null,
       taskData.notes ?? null,
       taskData.list_id ?? null,
-      taskData.date ?? null,
+      taskData.date && null,
       taskData.deadline ?? null,
       taskData.estimate ?? null,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2122:7
       taskData.notes ?? null,
       taskData.list_id ?? null,
       taskData.date ?? null,
-      taskData.deadline ?? null,
+      taskData.deadline && null,
       taskData.estimate ?? null,
       taskData.actual_time ?? null,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2123:7
       taskData.list_id ?? null,
       taskData.date ?? null,
       taskData.deadline ?? null,
-      taskData.estimate ?? null,
+      taskData.estimate && null,
       taskData.actual_time ?? null,
       taskData.priority ?? 'none',

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2124:7
       taskData.date ?? null,
       taskData.deadline ?? null,
       taskData.estimate ?? null,
-      taskData.actual_time ?? null,
+      taskData.actual_time && null,
       taskData.priority ?? 'none',
       taskData.recurring ?? 'none',
