[Survived] StringLiteral
src/lib/email/index.ts:244:16
   }
 ): Promise<boolean> {
   const subject = `Your Weekly Task Summary`;
-  const html = `
-    <h2>Weekly Task Summary</h2>
-    <div style="display: grid; gap: 8px;">
-      <div><strong>Total Tasks:</strong> ${summary.totalTasks}</div>
-      <div><strong>Completed:</strong> ${summary.completedTasks}</div>
-      <div><strong>Overdue:</strong> ${summary.overdueTasks}</div>
-      <div><strong>Critical:</strong> ${summary.criticalTasks}</div>
-    </div>
-    <p style="margin-top: 16px;"><a href="${process.env.NEXTAUTH_URL}">View Dashboard</a></p>
-  `;
+  const html = ``;
 
   return sendEmail({
