[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2125:7
       taskData.deadline ?? null,
       taskData.estimate ?? null,
       taskData.actual_time ?? null,
-      taskData.priority ?? 'none',
+      taskData.priority && 'none',
       taskData.recurring ?? 'none',
       taskData.recurring_config ?? null,

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:2125:28
       taskData.deadline ?? null,
       taskData.estimate ?? null,
       taskData.actual_time ?? null,
-      taskData.priority ?? 'none',
+      taskData.priority ?? "",
       taskData.recurring ?? 'none',
       taskData.recurring_config ?? null,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2126:7
       taskData.estimate ?? null,
       taskData.actual_time ?? null,
       taskData.priority ?? 'none',
-      taskData.recurring ?? 'none',
+      taskData.recurring && 'none',
       taskData.recurring_config ?? null,
       taskData.sort_order ?? 0,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2127:7
       taskData.actual_time ?? null,
       taskData.priority ?? 'none',
       taskData.recurring ?? 'none',
-      taskData.recurring_config ?? null,
+      taskData.recurring_config && null,
       taskData.sort_order ?? 0,
       taskData.created_at ?? now,

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2128:7
       taskData.priority ?? 'none',
       taskData.recurring ?? 'none',
       taskData.recurring_config ?? null,
-      taskData.sort_order ?? 0,
+      taskData.sort_order && 0,
       taskData.created_at ?? now,
       now

[NoCoverage] LogicalOperator
src/lib/actions/tasks.ts:2129:7
       taskData.recurring ?? 'none',
       taskData.recurring_config ?? null,
       taskData.sort_order ?? 0,
-      taskData.created_at ?? now,
+      taskData.created_at && now,
       now
     );

[NoCoverage] StringLiteral
src/lib/actions/tasks.ts:2138:36
     .get(newId) as Task;
 
   // Log the restoration
-  logTaskAction(newId, 'restored', 'Task restored via undo');
+  logTaskAction(newId, 'restored', "");
 
   // Broadcast for real-time updates
