[Killed] StringLiteral
src/lib/offline-storage.ts:9:25
 import type { CreateTaskInput } from '../types';
 
 const OFFLINE_TASKS_KEY = 'taskflow_offline_tasks';
-const SYNC_STATUS_KEY = 'taskflow_sync_status';
+const SYNC_STATUS_KEY = "";
 
 export interface OfflineTask {
killedBy: offline-storage getSyncStatus should return status from localStorage when it exists
statusReason: expected null to be 1789203879673 // Object.is equality

[Killed] BlockStatement
src/lib/offline-storage.ts:30:44
 /**
  * Get the localStorage object (handles SSR)
  */
-function getLocalStorage(): Storage | null {
-  if (typeof window === 'undefined') return null;
-  return window.localStorage;
-}
+function getLocalStorage(): Storage | null {}
 
 /**
killedBy: offline-storage getSyncStatus should return status from localStorage when it exists
statusReason: expected null to be 1789198353466 // Object.is equality

[Killed] ConditionalExpression
src/lib/offline-storage.ts:31:7
  * Get the localStorage object (handles SSR)
  */
 function getLocalStorage(): Storage | null {
-  if (typeof window === 'undefined') return null;
+  if (true) return null;
   return window.localStorage;
 }
killedBy: offline-storage getSyncStatus should return status from localStorage when it exists
statusReason: expected null to be 1789198353944 // Object.is equality

[Killed] EqualityOperator
src/lib/offline-storage.ts:31:7
  * Get the localStorage object (handles SSR)
  */
 function getLocalStorage(): Storage | null {
-  if (typeof window === 'undefined') return null;
+  if (typeof window !== 'undefined') return null;
   return window.localStorage;
 }
killedBy: offline-storage getSyncStatus should return status from localStorage when it exists
statusReason: expected null to be 1789198354919 // Object.is equality

[Killed] BlockStatement
src/lib/offline-storage.ts:38:45
 /**
  * Get current sync status
  */
-export function getSyncStatus(): SyncStatus {
-  const ls = getLocalStorage();
-  if (!ls) {
-    return { lastSync: null, pendingCount: 0, isSyncing: false };
-  }
-
-  const statusStr = ls.getItem(SYNC_STATUS_KEY);
-  const pendingCount = getPendingOfflineTasks().length;
-
-  if (statusStr) {
-    const status: SyncStatus = JSON.parse(statusStr);
-    return { ...status, pendingCount };
-  }
-
-  return { lastSync: null, pendingCount, isSyncing: false };
-}
+export function getSyncStatus(): SyncStatus {}
 
 /**
killedBy: offline-storage getSyncStatus should return default status when no sync status exists
statusReason: expected undefined to deeply equal { lastSync: null, …(2) }

[Killed] BooleanLiteral
src/lib/offline-storage.ts:40:7
  */
 export function getSyncStatus(): SyncStatus {
   const ls = getLocalStorage();
-  if (!ls) {
+  if (ls) {
     return { lastSync: null, pendingCount: 0, isSyncing: false };
   }
killedBy: offline-storage getSyncStatus should return status from localStorage when it exists
statusReason: expected null to be 1789198356301 // Object.is equality

[Killed] BlockStatement
src/lib/offline-storage.ts:40:12
  */
 export function getSyncStatus(): SyncStatus {
   const ls = getLocalStorage();
-  if (!ls) {
-    return { lastSync: null, pendingCount: 0, isSyncing: false };
-  }
+  if (!ls) {}
 
   const statusStr = ls.getItem(SYNC_STATUS_KEY);
killedBy: offline-storage - Server Environment should gracefully handle missing localStorage
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/lib/offline-storage.ts:41:58
 export function getSyncStatus(): SyncStatus {
   const ls = getLocalStorage();
   if (!ls) {
-    return { lastSync: null, pendingCount: 0, isSyncing: false };
+    return { lastSync: null, pendingCount: 0, isSyncing: true };
   }
 
killedBy: offline-storage - Server Environment should return default values in server environment
statusReason: expected { lastSync: null, …(2) } to deeply equal { lastSync: null, …(2) }

[Killed] ConditionalExpression
src/lib/offline-storage.ts:47:7
   const statusStr = ls.getItem(SYNC_STATUS_KEY);
   const pendingCount = getPendingOfflineTasks().length;
 
-  if (statusStr) {
+  if (true) {
     const status: SyncStatus = JSON.parse(statusStr);
     return { ...status, pendingCount };
killedBy: offline-storage getSyncStatus should return default status when no sync status exists
statusReason: expected { pendingCount: +0 } to deeply equal { lastSync: null, …(2) }

[Killed] BlockStatement
src/lib/offline-storage.ts:47:18
   const statusStr = ls.getItem(SYNC_STATUS_KEY);
   const pendingCount = getPendingOfflineTasks().length;
 
-  if (statusStr) {
-    const status: SyncStatus = JSON.parse(statusStr);
-    return { ...status, pendingCount };
-  }
+  if (statusStr) {}
 
   return { lastSync: null, pendingCount, isSyncing: false };
killedBy: offline-storage getSyncStatus should return status from localStorage when it exists
statusReason: expected null to be 1789198359944 // Object.is equality

[Killed] ObjectLiteral
src/lib/offline-storage.ts:49:12
 
   if (statusStr) {
     const status: SyncStatus = JSON.parse(statusStr);
-    return { ...status, pendingCount };
+    return {};
   }
 
killedBy: offline-storage getSyncStatus should return status from localStorage when it exists
statusReason: expected undefined to be 1789198360396 // Object.is equality

[Killed] BooleanLiteral
src/lib/offline-storage.ts:52:53
     return { ...status, pendingCount };
   }
 
-  return { lastSync: null, pendingCount, isSyncing: false };
+  return { lastSync: null, pendingCount, isSyncing: true };
 }
 
killedBy: offline-storage getSyncStatus should return default status when no sync status exists
statusReason: expected { lastSync: null, …(2) } to deeply equal { lastSync: null, …(2) }

[Killed] BlockStatement
src/lib/offline-storage.ts:61:9
 export function saveOfflineTask(
   action: 'create' | 'update' | 'delete',
   data: CreateTaskInput | Partial<CreateTaskInput> | { id: number }
-): void {
-  const ls = getLocalStorage();
-  if (!ls) return;
-
-  const offlineTasks: OfflineTask[] = JSON.parse(
-    ls.getItem(OFFLINE_TASKS_KEY) || '[]'
-  );
-  const newTask: OfflineTask = {
-    id: `${Date.now()}-${Math.random().toString(36).substr(2, 9)}`,
-    action,
-    data,
-    timestamp: Date.now(),
-    synced: false,
-    retryCount: 0,
-  };
-
-  offlineTasks.push(newTask);
-  ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
-  updateSyncStatus(true);
-}
+): void {}
 
 /**
killedBy: offline-storage getSyncStatus should count pending tasks correctly
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/offline-storage.ts:63:7
   data: CreateTaskInput | Partial<CreateTaskInput> | { id: number }
 ): void {
   const ls = getLocalStorage();
-  if (!ls) return;
+  if (true) return;
 
   const offlineTasks: OfflineTask[] = JSON.parse(
killedBy: offline-storage getSyncStatus should count pending tasks correctly
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/offline-storage.ts:63:7
   data: CreateTaskInput | Partial<CreateTaskInput> | { id: number }
 ): void {
   const ls = getLocalStorage();
-  if (!ls) return;
+  if (false) return;
 
   const offlineTasks: OfflineTask[] = JSON.parse(
killedBy: offline-storage - Server Environment should gracefully handle missing localStorage
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/lib/offline-storage.ts:66:5
   if (!ls) return;
 
   const offlineTasks: OfflineTask[] = JSON.parse(
-    ls.getItem(OFFLINE_TASKS_KEY) || '[]'
+    false
   );
   const newTask: OfflineTask = {
killedBy: offline-storage getSyncStatus should count pending tasks correctly
statusReason: offlineTasks.push is not a function

[Killed] ConditionalExpression
src/lib/offline-storage.ts:66:5
   if (!ls) return;
 
   const offlineTasks: OfflineTask[] = JSON.parse(
-    ls.getItem(OFFLINE_TASKS_KEY) || '[]'
+    true
   );
   const newTask: OfflineTask = {
killedBy: offline-storage getSyncStatus should count pending tasks correctly
statusReason: offlineTasks.push is not a function

[Killed] ObjectLiteral
src/lib/offline-storage.ts:68:32
   const offlineTasks: OfflineTask[] = JSON.parse(
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
-  const newTask: OfflineTask = {
-    id: `${Date.now()}-${Math.random().toString(36).substr(2, 9)}`,
-    action,
-    data,
-    timestamp: Date.now(),
-    synced: false,
-    retryCount: 0,
-  };
+  const newTask: OfflineTask = {};
 
   offlineTasks.push(newTask);
killedBy: offline-storage saveOfflineTask should save a task with correct structure
statusReason: expected undefined to be 'create' // Object.is equality

[Survived] MethodExpression
src/lib/offline-storage.ts:69:26
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
   const newTask: OfflineTask = {
-    id: `${Date.now()}-${Math.random().toString(36).substr(2, 9)}`,
+    id: `${Date.now()}-${Math.random().toString(36)}`,
     action,
     data,

[Killed] StringLiteral
src/lib/offline-storage.ts:69:9
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
   const newTask: OfflineTask = {
-    id: `${Date.now()}-${Math.random().toString(36).substr(2, 9)}`,
+    id: ``,
     action,
     data,
killedBy: offline-storage saveOfflineTask should generate unique IDs for each task
statusReason: expected '' not to be '' // Object.is equality

[Killed] BooleanLiteral
src/lib/offline-storage.ts:73:13
     action,
     data,
     timestamp: Date.now(),
-    synced: false,
+    synced: true,
     retryCount: 0,
   };
killedBy: offline-storage getSyncStatus should count pending tasks correctly
statusReason: expected +0 to be 2 // Object.is equality

[Survived] BooleanLiteral
src/lib/offline-storage.ts:79:20
 
   offlineTasks.push(newTask);
   ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
-  updateSyncStatus(true);
+  updateSyncStatus(false);
 }
 

[Killed] BlockStatement
src/lib/offline-storage.ts:85:50
 /**
  * Get all pending offline tasks
  */
-export function getOfflineTasks(): OfflineTask[] {
-  const ls = getLocalStorage();
-  if (!ls) return [];
-  return JSON.parse(ls.getItem(OFFLINE_TASKS_KEY) || '[]');
-}
+export function getOfflineTasks(): OfflineTask[] {}
 
 /**
killedBy: offline-storage getSyncStatus should return default status when no sync status exists
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
src/lib/offline-storage.ts:87:7
  */
 export function getOfflineTasks(): OfflineTask[] {
   const ls = getLocalStorage();
-  if (!ls) return [];
+  if (true) return [];
   return JSON.parse(ls.getItem(OFFLINE_TASKS_KEY) || '[]');
 }
killedBy: offline-storage getSyncStatus should count pending tasks correctly
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/offline-storage.ts:87:7
  */
 export function getOfflineTasks(): OfflineTask[] {
   const ls = getLocalStorage();
-  if (!ls) return [];
+  if (false) return [];
   return JSON.parse(ls.getItem(OFFLINE_TASKS_KEY) || '[]');
 }
killedBy: offline-storage - Server Environment should gracefully handle missing localStorage
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/lib/offline-storage.ts:88:21
 export function getOfflineTasks(): OfflineTask[] {
   const ls = getLocalStorage();
   if (!ls) return [];
-  return JSON.parse(ls.getItem(OFFLINE_TASKS_KEY) || '[]');
+  return JSON.parse(false);
 }
 
killedBy: offline-storage getSyncStatus should return default status when no sync status exists
statusReason: offlineTasks.filter is not a function

[Killed] ConditionalExpression
src/lib/offline-storage.ts:88:21
 export function getOfflineTasks(): OfflineTask[] {
   const ls = getLocalStorage();
   if (!ls) return [];
-  return JSON.parse(ls.getItem(OFFLINE_TASKS_KEY) || '[]');
+  return JSON.parse(true);
 }
 
killedBy: offline-storage getSyncStatus should return default status when no sync status exists
statusReason: offlineTasks.filter is not a function

[Killed] BlockStatement
src/lib/offline-storage.ts:94:56
 /**
  * Mark an offline task as synced
  */
-export function markTaskAsSynced(taskId: string): void {
-  const ls = getLocalStorage();
-  if (!ls) return;
-
-  const offlineTasks: OfflineTask[] = JSON.parse(
-    ls.getItem(OFFLINE_TASKS_KEY) || '[]'
-  );
-  const index = offlineTasks.findIndex(t => t.id === taskId);
-  if (index !== -1) {
-    offlineTasks[index].synced = true;
-    ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
-  }
-}
+export function markTaskAsSynced(taskId: string): void {}
 
 /**
killedBy: offline-storage markTaskAsSynced should mark task as synced
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/offline-storage.ts:96:7
  */
 export function markTaskAsSynced(taskId: string): void {
   const ls = getLocalStorage();
-  if (!ls) return;
+  if (ls) return;
 
   const offlineTasks: OfflineTask[] = JSON.parse(
killedBy: offline-storage markTaskAsSynced should mark task as synced
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/lib/offline-storage.ts:99:5
   if (!ls) return;
 
   const offlineTasks: OfflineTask[] = JSON.parse(
-    ls.getItem(OFFLINE_TASKS_KEY) || '[]'
+    ls.getItem(OFFLINE_TASKS_KEY) && '[]'
   );
   const index = offlineTasks.findIndex(t => t.id === taskId);
killedBy: offline-storage markTaskAsSynced should mark task as synced
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/offline-storage.ts:101:45
   const offlineTasks: OfflineTask[] = JSON.parse(
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
-  const index = offlineTasks.findIndex(t => t.id === taskId);
+  const index = offlineTasks.findIndex(t => t.id !== taskId);
   if (index !== -1) {
     offlineTasks[index].synced = true;
killedBy: offline-storage markTaskAsSynced should mark task as synced
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/offline-storage.ts:101:40
   const offlineTasks: OfflineTask[] = JSON.parse(
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
-  const index = offlineTasks.findIndex(t => t.id === taskId);
+  const index = offlineTasks.findIndex(() => undefined);
   if (index !== -1) {
     offlineTasks[index].synced = true;
killedBy: offline-storage markTaskAsSynced should mark task as synced
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/offline-storage.ts:102:7
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
   const index = offlineTasks.findIndex(t => t.id === taskId);
-  if (index !== -1) {
+  if (true) {
     offlineTasks[index].synced = true;
     ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
killedBy: offline-storage markTaskAsSynced should not throw when marking non-existent task
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot set properties of u…' was thrown

[Killed] ConditionalExpression
src/lib/offline-storage.ts:102:7
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
   const index = offlineTasks.findIndex(t => t.id === taskId);
-  if (index !== -1) {
+  if (false) {
     offlineTasks[index].synced = true;
     ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
killedBy: offline-storage markTaskAsSynced should mark task as synced
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/offline-storage.ts:103:34
   );
   const index = offlineTasks.findIndex(t => t.id === taskId);
   if (index !== -1) {
-    offlineTasks[index].synced = true;
+    offlineTasks[index].synced = false;
     ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
   }
killedBy: offline-storage markTaskAsSynced should mark task as synced
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/offline-storage.ts:111:57
 /**
  * Remove a synced task from offline storage
  */
-export function removeOfflineTask(taskId: string): void {
-  const ls = getLocalStorage();
-  if (!ls) return;
-
-  const offlineTasks: OfflineTask[] = JSON.parse(
-    ls.getItem(OFFLINE_TASKS_KEY) || '[]'
-  );
-  const filtered = offlineTasks.filter(t => t.id !== taskId);
-  ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(filtered));
-}
+export function removeOfflineTask(taskId: string): void {}
 
 /**
killedBy: offline-storage removeOfflineTask should remove a task
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/offline-storage.ts:118:45
   const offlineTasks: OfflineTask[] = JSON.parse(
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
-  const filtered = offlineTasks.filter(t => t.id !== taskId);
+  const filtered = offlineTasks.filter(t => true);
   ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(filtered));
 }
killedBy: offline-storage removeOfflineTask should remove a task
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/offline-storage.ts:118:45
   const offlineTasks: OfflineTask[] = JSON.parse(
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
-  const filtered = offlineTasks.filter(t => t.id !== taskId);
+  const filtered = offlineTasks.filter(t => false);
   ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(filtered));
 }
killedBy: offline-storage removeOfflineTask should only remove the specified task
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/offline-storage.ts:125:49
 /**
  * Increment retry count for a failed task
  */
-function retryOfflineTask(taskId: string): void {
-  const ls = getLocalStorage();
-  if (!ls) return;
-
-  const offlineTasks: OfflineTask[] = JSON.parse(
-    ls.getItem(OFFLINE_TASKS_KEY) || '[]'
-  );
-  const index = offlineTasks.findIndex(t => t.id === taskId);
-  if (index !== -1) {
-    offlineTasks[index].retryCount = (offlineTasks[index].retryCount || 0) + 1;
-    ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
-  }
-}
+function retryOfflineTask(taskId: string): void {}
 
 /**
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/lib/offline-storage.ts:132:45
   const offlineTasks: OfflineTask[] = JSON.parse(
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
-  const index = offlineTasks.findIndex(t => t.id === taskId);
+  const index = offlineTasks.findIndex(t => false);
   if (index !== -1) {
     offlineTasks[index].retryCount = (offlineTasks[index].retryCount || 0) + 1;
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/lib/offline-storage.ts:133:21
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
   const index = offlineTasks.findIndex(t => t.id === taskId);
-  if (index !== -1) {
-    offlineTasks[index].retryCount = (offlineTasks[index].retryCount || 0) + 1;
-    ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
-  }
+  if (index !== -1) {}
 }
 
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Killed] ArithmeticOperator
src/lib/offline-storage.ts:134:38
   );
   const index = offlineTasks.findIndex(t => t.id === taskId);
   if (index !== -1) {
-    offlineTasks[index].retryCount = (offlineTasks[index].retryCount || 0) + 1;
+    offlineTasks[index].retryCount = (offlineTasks[index].retryCount || 0) - 1;
     ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
   }
killedBy: offline-storage syncOfflineTasks should increment retry count on failure with retries remaining
statusReason: expected -1 to be greater than or equal to 0

[Survived] ConditionalExpression
src/lib/offline-storage.ts:134:39
   );
   const index = offlineTasks.findIndex(t => t.id === taskId);
   if (index !== -1) {
-    offlineTasks[index].retryCount = (offlineTasks[index].retryCount || 0) + 1;
+    offlineTasks[index].retryCount = (true) + 1;
     ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(offlineTasks));
   }

[Killed] BlockStatement
src/lib/offline-storage.ts:142:57
 /**
  * Get pending (unsynced) tasks
  */
-export function getPendingOfflineTasks(): OfflineTask[] {
-  const offlineTasks = getOfflineTasks();
-  return offlineTasks.filter(t => !t.synced);
-}
+export function getPendingOfflineTasks(): OfflineTask[] {}
 
 /**
killedBy: offline-storage getSyncStatus should return default status when no sync status exists
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/lib/offline-storage.ts:144:35
  */
 export function getPendingOfflineTasks(): OfflineTask[] {
   const offlineTasks = getOfflineTasks();
-  return offlineTasks.filter(t => !t.synced);
+  return offlineTasks.filter(t => t.synced);
 }
 
killedBy: offline-storage getSyncStatus should count pending tasks correctly
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/lib/offline-storage.ts:144:30
  */
 export function getPendingOfflineTasks(): OfflineTask[] {
   const offlineTasks = getOfflineTasks();
-  return offlineTasks.filter(t => !t.synced);
+  return offlineTasks.filter(() => undefined);
 }
 
killedBy: offline-storage getSyncStatus should count pending tasks correctly
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/offline-storage.ts:150:42
 /**
  * Clear all synced tasks from offline storage
  */
-export function clearSyncedTasks(): void {
-  const ls = getLocalStorage();
-  if (!ls) return;
-
-  const offlineTasks: OfflineTask[] = JSON.parse(
-    ls.getItem(OFFLINE_TASKS_KEY) || '[]'
-  );
-  const filtered = offlineTasks.filter(t => !t.synced);
-  ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(filtered));
-}
+export function clearSyncedTasks(): void {}
 
 /**
killedBy: offline-storage clearSyncedTasks should remove only synced tasks
statusReason: expected 3 to be 1 // Object.is equality

[Killed] MethodExpression
src/lib/offline-storage.ts:157:20
   const offlineTasks: OfflineTask[] = JSON.parse(
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
-  const filtered = offlineTasks.filter(t => !t.synced);
+  const filtered = offlineTasks;
   ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(filtered));
 }
killedBy: offline-storage clearSyncedTasks should remove only synced tasks
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/offline-storage.ts:157:45
   const offlineTasks: OfflineTask[] = JSON.parse(
     ls.getItem(OFFLINE_TASKS_KEY) || '[]'
   );
-  const filtered = offlineTasks.filter(t => !t.synced);
+  const filtered = offlineTasks.filter(t => t.synced);
   ls.setItem(OFFLINE_TASKS_KEY, JSON.stringify(filtered));
 }
killedBy: offline-storage clearSyncedTasks should remove only synced tasks
statusReason: expected 2 to be 1 // Object.is equality

[Survived] BooleanLiteral
src/lib/offline-storage.ts:172:20
   let success = 0;
   let failed = 0;
 
-  updateSyncStatus(true);
+  updateSyncStatus(false);
 
   for (const task of pendingTasks) {

[Killed] EqualityOperator
src/lib/offline-storage.ts:176:11
 
   for (const task of pendingTasks) {
     try {
-      if (task.action === 'create') {
+      if (task.action !== 'create') {
         const response = await fetch('/api/tasks', {
           method: 'POST',
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/lib/offline-storage.ts:176:11
 
   for (const task of pendingTasks) {
     try {
-      if (task.action === 'create') {
+      if (false) {
         const response = await fetch('/api/tasks', {
           method: 'POST',
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Survived] StringLiteral
src/lib/offline-storage.ts:178:19
     try {
       if (task.action === 'create') {
         const response = await fetch('/api/tasks', {
-          method: 'POST',
+          method: "",
           headers: { 'Content-Type': 'application/json' },
           body: JSON.stringify(task.data),

[Killed] ConditionalExpression
src/lib/offline-storage.ts:182:13
           headers: { 'Content-Type': 'application/json' },
           body: JSON.stringify(task.data),
         });
-        if (response.ok) {
+        if (true) {
           markTaskAsSynced(task.id);
           success++;
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Survived] ConditionalExpression
src/lib/offline-storage.ts:182:13
           headers: { 'Content-Type': 'application/json' },
           body: JSON.stringify(task.data),
         });
-        if (response.ok) {
+        if (false) {
           markTaskAsSynced(task.id);
           success++;

[Survived] UpdateOperator
src/lib/offline-storage.ts:184:11
         });
         if (response.ok) {
           markTaskAsSynced(task.id);
-          success++;
+          success--;
         } else {
           failed++;

[Killed] BlockStatement
src/lib/offline-storage.ts:185:16
         if (response.ok) {
           markTaskAsSynced(task.id);
           success++;
-        } else {
-          failed++;
-          if ((task.retryCount || 0) < 3) {
-            retryOfflineTask(task.id);
-          }
-        }
+        } else {}
       } else if (task.action === 'update') {
         const { id, ...updates } = task.data as { id: number };
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/lib/offline-storage.ts:187:15
           success++;
         } else {
           failed++;
-          if ((task.retryCount || 0) < 3) {
+          if ((task.retryCount || 0) >= 3) {
             retryOfflineTask(task.id);
           }
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/lib/offline-storage.ts:187:43
           success++;
         } else {
           failed++;
-          if ((task.retryCount || 0) < 3) {
-            retryOfflineTask(task.id);
-          }
+          if ((task.retryCount || 0) < 3) {}
         }
       } else if (task.action === 'update') {
killedBy: syncOfflineTasks - retry logic should handle fetch failure and retry
statusReason: expected 0 to be greater than or equal to 1

[Survived] EqualityOperator
src/lib/offline-storage.ts:191:18
             retryOfflineTask(task.id);
           }
         }
-      } else if (task.action === 'update') {
+      } else if (task.action !== 'update') {
         const { id, ...updates } = task.data as { id: number };
         const response = await fetch(`/api/tasks/${id}`, {

[Survived] BlockStatement
src/lib/offline-storage.ts:191:44
             retryOfflineTask(task.id);
           }
         }
-      } else if (task.action === 'update') {
-        const { id, ...updates } = task.data as { id: number };
-        const response = await fetch(`/api/tasks/${id}`, {
-          method: 'PATCH',
-          headers: { 'Content-Type': 'application/json' },
-          body: JSON.stringify(updates),
-        });
-        if (response.ok) {
-          markTaskAsSynced(task.id);
-          success++;
-        } else {
-          failed++;
-          if ((task.retryCount || 0) < 3) {
-            retryOfflineTask(task.id);
-          }
-        }
-      } else if (task.action === 'delete') {
+      } else if (task.action === 'update') {} else if (task.action === 'delete') {
         const { id } = task.data as { id: number };
         const response = await fetch(`/api/tasks/${id}`, {

[Survived] StringLiteral
src/lib/offline-storage.ts:193:38
         }
       } else if (task.action === 'update') {
         const { id, ...updates } = task.data as { id: number };
-        const response = await fetch(`/api/tasks/${id}`, {
+        const response = await fetch(``, {
           method: 'PATCH',
           headers: { 'Content-Type': 'application/json' },

[Survived] StringLiteral
src/lib/offline-storage.ts:195:38
         const { id, ...updates } = task.data as { id: number };
         const response = await fetch(`/api/tasks/${id}`, {
           method: 'PATCH',
-          headers: { 'Content-Type': 'application/json' },
+          headers: { 'Content-Type': "" },
           body: JSON.stringify(updates),
         });

[NoCoverage] EqualityOperator
src/lib/offline-storage.ts:203:15
           success++;
         } else {
           failed++;
-          if ((task.retryCount || 0) < 3) {
+          if ((task.retryCount || 0) <= 3) {
             retryOfflineTask(task.id);
           }

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:203:16
           success++;
         } else {
           failed++;
-          if ((task.retryCount || 0) < 3) {
+          if ((false) < 3) {
             retryOfflineTask(task.id);
           }

[Survived] EqualityOperator
src/lib/offline-storage.ts:207:18
             retryOfflineTask(task.id);
           }
         }
-      } else if (task.action === 'delete') {
+      } else if (task.action !== 'delete') {
         const { id } = task.data as { id: number };
         const response = await fetch(`/api/tasks/${id}`, {
