[Survived] ConditionalExpression
src/lib/offline-storage.ts:207:18
             retryOfflineTask(task.id);
           }
         }
-      } else if (task.action === 'delete') {
+      } else if (false) {
         const { id } = task.data as { id: number };
         const response = await fetch(`/api/tasks/${id}`, {

[Survived] StringLiteral
src/lib/offline-storage.ts:209:38
         }
       } else if (task.action === 'delete') {
         const { id } = task.data as { id: number };
-        const response = await fetch(`/api/tasks/${id}`, {
+        const response = await fetch(``, {
           method: 'DELETE',
         });

[Survived] BlockStatement
src/lib/offline-storage.ts:212:26
         const response = await fetch(`/api/tasks/${id}`, {
           method: 'DELETE',
         });
-        if (response.ok) {
-          markTaskAsSynced(task.id);
-          success++;
-        } else {
+        if (response.ok) {} else {
           failed++;
           if ((task.retryCount || 0) < 3) {

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:217:15
           success++;
         } else {
           failed++;
-          if ((task.retryCount || 0) < 3) {
+          if (false) {
             retryOfflineTask(task.id);
           }

[Survived] BlockStatement
src/lib/offline-storage.ts:222:13
           }
         }
       }
-    } catch {
-      failed++;
-      if ((task.retryCount || 0) < 3) {
-        retryOfflineTask(task.id);
-      }
-    }
+    } catch {}
   }
 

[Survived] UpdateOperator
src/lib/offline-storage.ts:223:7
         }
       }
     } catch {
-      failed++;
+      failed--;
       if ((task.retryCount || 0) < 3) {
         retryOfflineTask(task.id);

[Survived] BooleanLiteral
src/lib/offline-storage.ts:230:20
     }
   }
 
-  updateSyncStatus(false);
+  updateSyncStatus(true);
   return { success, failed };
 }

[Killed] ObjectLiteral
src/lib/offline-storage.ts:231:10
   }
 
   updateSyncStatus(false);
-  return { success, failed };
+  return {};
 }
 
killedBy: offline-storage syncOfflineTasks should return success and failed counts
statusReason: expected {} to have property "success"

[Survived] BlockStatement
src/lib/offline-storage.ts:237:69
 /**
  * Update sync status
  */
-function updateSyncStatus(isSyncing: boolean, error?: string): void {
-  const ls = getLocalStorage();
-  if (!ls) return;
-
-  const status: SyncStatus = {
-    lastSync: error ? null : Date.now(),
-    pendingCount: getPendingOfflineTasks().length,
-    isSyncing,
-    error,
-  };
-
-  ls.setItem(SYNC_STATUS_KEY, JSON.stringify(status));
-}
+function updateSyncStatus(isSyncing: boolean, error?: string): void {}
 
 /**

[Killed] BlockStatement
src/lib/offline-storage.ts:254:51
 /**
  * Check if there are pending offline tasks
  */
-export function hasPendingOfflineTasks(): boolean {
-  return getPendingOfflineTasks().length > 0;
-}
+export function hasPendingOfflineTasks(): boolean {}
 
 /**
killedBy: offline-storage hasPendingOfflineTasks should return false when no pending tasks
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/lib/offline-storage.ts:255:10
  * Check if there are pending offline tasks
  */
 export function hasPendingOfflineTasks(): boolean {
-  return getPendingOfflineTasks().length > 0;
+  return getPendingOfflineTasks().length <= 0;
 }
 
killedBy: offline-storage hasPendingOfflineTasks should return false when no pending tasks
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/offline-storage.ts:255:10
  * Check if there are pending offline tasks
  */
 export function hasPendingOfflineTasks(): boolean {
-  return getPendingOfflineTasks().length > 0;
+  return false;
 }
 
killedBy: offline-storage hasPendingOfflineTasks should return true when there are pending tasks
statusReason: expected false to be true // Object.is equality

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:273:5
   resolution: ConflictResolution = 'server-wins'
 ): Promise<Record<string, unknown>> {
   switch (resolution) {
-    case 'server-wins':
-      return serverTask;
+    case 'server-wins':
     case 'client-wins':
       return { ...serverTask, ...offlineTask.data };

[NoCoverage] StringLiteral
src/lib/offline-storage.ts:273:10
   resolution: ConflictResolution = 'server-wins'
 ): Promise<Record<string, unknown>> {
   switch (resolution) {
-    case 'server-wins':
+    case "":
       return serverTask;
     case 'client-wins':

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:275:5
   switch (resolution) {
     case 'server-wins':
       return serverTask;
-    case 'client-wins':
-      return { ...serverTask, ...offlineTask.data };
+    case 'client-wins':
     case 'merge': {
       // Merge strategy: prefer offline changes for non-conflicting fields

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:277:5
       return serverTask;
     case 'client-wins':
       return { ...serverTask, ...offlineTask.data };
-    case 'merge': {
-      // Merge strategy: prefer offline changes for non-conflicting fields
-      const merged = { ...serverTask };
-      if (typeof offlineTask.data === 'object' && offlineTask.data !== null) {
-        for (const [key, value] of Object.entries(offlineTask.data)) {
-          if (key !== 'id' && value !== undefined) {
-            merged[key] = value;
-          }
-        }
-      }
-      return merged;
-    }
+    case 'merge':
     case 'prompt':
       // In a real implementation, this would trigger a UI prompt

[NoCoverage] BlockStatement
src/lib/offline-storage.ts:277:19
       return serverTask;
     case 'client-wins':
       return { ...serverTask, ...offlineTask.data };
-    case 'merge': {
-      // Merge strategy: prefer offline changes for non-conflicting fields
-      const merged = { ...serverTask };
-      if (typeof offlineTask.data === 'object' && offlineTask.data !== null) {
-        for (const [key, value] of Object.entries(offlineTask.data)) {
-          if (key !== 'id' && value !== undefined) {
-            merged[key] = value;
-          }
-        }
-      }
-      return merged;
-    }
+    case 'merge': {}
     case 'prompt':
       // In a real implementation, this would trigger a UI prompt

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:280:51
     case 'merge': {
       // Merge strategy: prefer offline changes for non-conflicting fields
       const merged = { ...serverTask };
-      if (typeof offlineTask.data === 'object' && offlineTask.data !== null) {
+      if (typeof offlineTask.data === 'object' && true) {
         for (const [key, value] of Object.entries(offlineTask.data)) {
           if (key !== 'id' && value !== undefined) {

[NoCoverage] LogicalOperator
src/lib/offline-storage.ts:280:11
     case 'merge': {
       // Merge strategy: prefer offline changes for non-conflicting fields
       const merged = { ...serverTask };
-      if (typeof offlineTask.data === 'object' && offlineTask.data !== null) {
+      if (typeof offlineTask.data === 'object' || offlineTask.data !== null) {
         for (const [key, value] of Object.entries(offlineTask.data)) {
           if (key !== 'id' && value !== undefined) {

[NoCoverage] BlockStatement
src/lib/offline-storage.ts:281:70
       // Merge strategy: prefer offline changes for non-conflicting fields
       const merged = { ...serverTask };
       if (typeof offlineTask.data === 'object' && offlineTask.data !== null) {
-        for (const [key, value] of Object.entries(offlineTask.data)) {
-          if (key !== 'id' && value !== undefined) {
-            merged[key] = value;
-          }
-        }
+        for (const [key, value] of Object.entries(offlineTask.data)) {}
       }
       return merged;

[NoCoverage] LogicalOperator
src/lib/offline-storage.ts:282:15
       const merged = { ...serverTask };
       if (typeof offlineTask.data === 'object' && offlineTask.data !== null) {
         for (const [key, value] of Object.entries(offlineTask.data)) {
-          if (key !== 'id' && value !== undefined) {
+          if (key !== 'id' || value !== undefined) {
             merged[key] = value;
           }

[NoCoverage] EqualityOperator
src/lib/offline-storage.ts:282:15
       const merged = { ...serverTask };
       if (typeof offlineTask.data === 'object' && offlineTask.data !== null) {
         for (const [key, value] of Object.entries(offlineTask.data)) {
-          if (key !== 'id' && value !== undefined) {
+          if (key === 'id' && value !== undefined) {
             merged[key] = value;
           }

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:289:5
       }
       return merged;
     }
-    case 'prompt':
-      // In a real implementation, this would trigger a UI prompt
-      // For now, default to merge
-      return { ...serverTask, ...offlineTask.data };
+    case 'prompt':
     default:
       return serverTask;

[NoCoverage] StringLiteral
src/lib/offline-storage.ts:289:10
       }
       return merged;
     }
-    case 'prompt':
+    case "":
       // In a real implementation, this would trigger a UI prompt
       // For now, default to merge

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:293:5
       // In a real implementation, this would trigger a UI prompt
       // For now, default to merge
       return { ...serverTask, ...offlineTask.data };
-    default:
-      return serverTask;
+    default:
   }
 }

[NoCoverage] BlockStatement
src/lib/offline-storage.ts:301:46
 /**
  * Clear all offline tasks (use with caution)
  */
-export function clearAllOfflineTasks(): void {
-  const ls = getLocalStorage();
-  if (!ls) return;
-  ls.removeItem(OFFLINE_TASKS_KEY);
-  ls.removeItem(SYNC_STATUS_KEY);
-}
+export function clearAllOfflineTasks(): void {}
 
 /**

[NoCoverage] BlockStatement
src/lib/offline-storage.ts:315:3
   create: number;
   update: number;
   delete: number;
-} {
-  const pending = getPendingOfflineTasks();
-  return pending.reduce(
-    (acc, task) => {
-      acc[task.action] = (acc[task.action] || 0) + 1;
-      return acc;
-    },
-    { create: 0, update: 0, delete: 0 }
-  );
-}
+} {}
 

[NoCoverage] BlockStatement
src/lib/offline-storage.ts:318:20
 } {
   const pending = getPendingOfflineTasks();
   return pending.reduce(
-    (acc, task) => {
-      acc[task.action] = (acc[task.action] || 0) + 1;
-      return acc;
-    },
+    (acc, task) => {},
     { create: 0, update: 0, delete: 0 }
   );

[NoCoverage] LogicalOperator
src/lib/offline-storage.ts:319:27
   const pending = getPendingOfflineTasks();
   return pending.reduce(
     (acc, task) => {
-      acc[task.action] = (acc[task.action] || 0) + 1;
+      acc[task.action] = (acc[task.action] && 0) + 1;
       return acc;
     },

[NoCoverage] ConditionalExpression
src/lib/offline-storage.ts:319:27
   const pending = getPendingOfflineTasks();
   return pending.reduce(
     (acc, task) => {
-      acc[task.action] = (acc[task.action] || 0) + 1;
+      acc[task.action] = (true) + 1;
       return acc;
     },

[NoCoverage] ObjectLiteral
src/lib/offline-storage.ts:322:5
       acc[task.action] = (acc[task.action] || 0) + 1;
       return acc;
     },
-    { create: 0, update: 0, delete: 0 }
+    {}
   );
 }
