[Survived] ArithmeticOperator
src/lib/ai/providers.ts:349:31
 
     // Check for specific dates
     const today = new Date();
-    const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
+    const tomorrow = new Date(today.getTime() - 24 * 60 * 60 * 1000);
     const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 1000);
 

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:349:49
 
     // Check for specific dates
     const today = new Date();
-    const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
+    const tomorrow = new Date(today.getTime() + 24 * 60 / 60 * 1000);
     const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 1000);
 

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:350:49
     // Check for specific dates
     const today = new Date();
     const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
-    const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 1000);
+    const nextWeek = new Date(today.getTime() + 7 * 24 * 60 / 1000);
 
     if (text.includes('tomorrow')) {

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:350:49
     // Check for specific dates
     const today = new Date();
     const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
-    const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 1000);
+    const nextWeek = new Date(today.getTime() + 7 * 24 / 60 * 1000);
 
     if (text.includes('tomorrow')) {

[Killed] BlockStatement
src/lib/ai/providers.ts:352:36
     const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
     const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 1000);
 
-    if (text.includes('tomorrow')) {
-      suggested_date = tomorrow.toISOString().split('T')[0];
-    } else if (text.includes('next week') || text.includes('weekend')) {
+    if (text.includes('tomorrow')) {} else if (text.includes('next week') || text.includes('weekend')) {
       suggested_date = nextWeek.toISOString().split('T')[0];
     } else if (text.includes('today')) {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract tomorrow date
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/ai/providers.ts:352:9
     const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
     const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 1000);
 
-    if (text.includes('tomorrow')) {
+    if (false) {
       suggested_date = tomorrow.toISOString().split('T')[0];
     } else if (text.includes('next week') || text.includes('weekend')) {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract tomorrow date
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/ai/providers.ts:354:72
 
     if (text.includes('tomorrow')) {
       suggested_date = tomorrow.toISOString().split('T')[0];
-    } else if (text.includes('next week') || text.includes('weekend')) {
-      suggested_date = nextWeek.toISOString().split('T')[0];
-    } else if (text.includes('today')) {
+    } else if (text.includes('next week') || text.includes('weekend')) {} else if (text.includes('today')) {
       suggested_date = today.toISOString().split('T')[0];
     }
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract next week date
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/ai/providers.ts:354:16
 
     if (text.includes('tomorrow')) {
       suggested_date = tomorrow.toISOString().split('T')[0];
-    } else if (text.includes('next week') || text.includes('weekend')) {
+    } else if (false) {
       suggested_date = nextWeek.toISOString().split('T')[0];
     } else if (text.includes('today')) {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract next week date
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/ai/providers.ts:356:16
       suggested_date = tomorrow.toISOString().split('T')[0];
     } else if (text.includes('next week') || text.includes('weekend')) {
       suggested_date = nextWeek.toISOString().split('T')[0];
-    } else if (text.includes('today')) {
+    } else if (false) {
       suggested_date = today.toISOString().split('T')[0];
     }
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract today date
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/ai/providers.ts:356:40
       suggested_date = tomorrow.toISOString().split('T')[0];
     } else if (text.includes('next week') || text.includes('weekend')) {
       suggested_date = nextWeek.toISOString().split('T')[0];
-    } else if (text.includes('today')) {
-      suggested_date = today.toISOString().split('T')[0];
-    }
+    } else if (text.includes('today')) {}
 
     // Check for specific weekdays
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract today date
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/ai/providers.ts:361:41
     }
 
     // Check for specific weekdays
-    for (const day of this.dayKeywords) {
-      if (text.includes(day)) {
-        const nextDay = this.getNextDay(day);
-        if (!suggested_date)
-          suggested_date = nextDay.toISOString().split('T')[0];
-        break;
-      }
-    }
+    for (const day of this.dayKeywords) {}
 
     // Enhanced date parsing: "in X days/weeks"
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract weekday date
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/ai/providers.ts:362:11
 
     // Check for specific weekdays
     for (const day of this.dayKeywords) {
-      if (text.includes(day)) {
+      if (false) {
         const nextDay = this.getNextDay(day);
         if (!suggested_date)
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract weekday date
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/ai/providers.ts:362:31
 
     // Check for specific weekdays
     for (const day of this.dayKeywords) {
-      if (text.includes(day)) {
-        const nextDay = this.getNextDay(day);
-        if (!suggested_date)
-          suggested_date = nextDay.toISOString().split('T')[0];
-        break;
-      }
+      if (text.includes(day)) {}
     }
 
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract weekday date
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/ai/providers.ts:364:13
     for (const day of this.dayKeywords) {
       if (text.includes(day)) {
         const nextDay = this.getNextDay(day);
-        if (!suggested_date)
+        if (false)
           suggested_date = nextDay.toISOString().split('T')[0];
         break;
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract weekday date
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/lib/ai/providers.ts:364:13
     for (const day of this.dayKeywords) {
       if (text.includes(day)) {
         const nextDay = this.getNextDay(day);
-        if (!suggested_date)
+        if (suggested_date)
           suggested_date = nextDay.toISOString().split('T')[0];
         break;
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract weekday date
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/lib/ai/providers.ts:365:56
       if (text.includes(day)) {
         const nextDay = this.getNextDay(day);
         if (!suggested_date)
-          suggested_date = nextDay.toISOString().split('T')[0];
+          suggested_date = nextDay.toISOString().split("")[0];
         break;
       }

[Killed] Regex
src/lib/ai/providers.ts:371:32
     }
 
     // Enhanced date parsing: "in X days/weeks"
-    const inMatch = text.match(/in\s+(\d+)\s+(day|week|month|year)s?/);
+    const inMatch = text.match(/in\s+(\D+)\s+(day|week|month|year)s?/);
     if (inMatch && !suggested_date) {
       const daysNum = parseInt(inMatch[1]);
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should parse in X days format
statusReason: expected undefined to be defined

[Killed] Regex
src/lib/ai/providers.ts:371:32
     }
 
     // Enhanced date parsing: "in X days/weeks"
-    const inMatch = text.match(/in\s+(\d+)\s+(day|week|month|year)s?/);
+    const inMatch = text.match(/in\S+(\d+)\s+(day|week|month|year)s?/);
     if (inMatch && !suggested_date) {
       const daysNum = parseInt(inMatch[1]);
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should parse in X days format
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/ai/providers.ts:372:9
 
     // Enhanced date parsing: "in X days/weeks"
     const inMatch = text.match(/in\s+(\d+)\s+(day|week|month|year)s?/);
-    if (inMatch && !suggested_date) {
+    if (false) {
       const daysNum = parseInt(inMatch[1]);
       const daysUnit = inMatch[2];
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should parse in X days format
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/ai/providers.ts:372:9
 
     // Enhanced date parsing: "in X days/weeks"
     const inMatch = text.match(/in\s+(\d+)\s+(day|week|month|year)s?/);
-    if (inMatch && !suggested_date) {
+    if (true) {
       const daysNum = parseInt(inMatch[1]);
       const daysUnit = inMatch[2];
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should parse task with critical priority
statusReason: Cannot read properties of null (reading '1')

[Survived] ConditionalExpression
src/lib/ai/providers.ts:376:9
       const daysNum = parseInt(inMatch[1]);
       const daysUnit = inMatch[2];
       const multiplier =
-        daysUnit === 'day'
+        false
           ? 1
           : daysUnit === 'week'

[Survived] ConditionalExpression
src/lib/ai/providers.ts:376:9
       const daysNum = parseInt(inMatch[1]);
       const daysUnit = inMatch[2];
       const multiplier =
-        daysUnit === 'day'
+        true
           ? 1
           : daysUnit === 'week'

[Survived] ConditionalExpression
src/lib/ai/providers.ts:378:13
       const multiplier =
         daysUnit === 'day'
           ? 1
-          : daysUnit === 'week'
+          : false
             ? 7
             : daysUnit === 'month'

[Survived] EqualityOperator
src/lib/ai/providers.ts:378:13
       const multiplier =
         daysUnit === 'day'
           ? 1
-          : daysUnit === 'week'
+          : daysUnit !== 'week'
             ? 7
             : daysUnit === 'month'

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:380:15
           ? 1
           : daysUnit === 'week'
             ? 7
-            : daysUnit === 'month'
+            : false
               ? 30
               : 365;

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:380:15
           ? 1
           : daysUnit === 'week'
             ? 7
-            : daysUnit === 'month'
+            : true
               ? 30
               : 365;

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:384:22
               ? 30
               : 365;
       const futureDate = new Date(
-        Date.now() + daysNum * multiplier * 24 * 60 * 60 * 1000
+        Date.now() + daysNum * multiplier / 24 * 60 * 60 * 1000
       );
       suggested_date = futureDate.toISOString().split('T')[0];

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:384:22
               ? 30
               : 365;
       const futureDate = new Date(
-        Date.now() + daysNum * multiplier * 24 * 60 * 60 * 1000
+        Date.now() + daysNum * multiplier * 24 * 60 * 60 / 1000
       );
       suggested_date = futureDate.toISOString().split('T')[0];

[Killed] Regex
src/lib/ai/providers.ts:392:7
     // Parse "every X day/week/month/year" patterns for custom recurring
     // Supports: "every day", "every 3 days", "every week", "every 2 weeks", etc.
     const everyMatch = text.match(
-      /every\s+(\d+)\s*(day|week|weekday|month|year)s?/i
+      /every\s+(\D+)\s*(day|week|weekday|month|year)s?/i
     );
     if (everyMatch && recurring === 'none') {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract custom recurring from every X days
statusReason: expected 'none' to be 'custom' // Object.is equality

[Killed] Regex
src/lib/ai/providers.ts:392:7
     // Parse "every X day/week/month/year" patterns for custom recurring
     // Supports: "every day", "every 3 days", "every week", "every 2 weeks", etc.
     const everyMatch = text.match(
-      /every\s+(\d+)\s*(day|week|weekday|month|year)s?/i
+      /every\S+(\d+)\s*(day|week|weekday|month|year)s?/i
     );
     if (everyMatch && recurring === 'none') {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract custom recurring from every X days
statusReason: expected 'none' to be 'custom' // Object.is equality

[Killed] EqualityOperator
src/lib/ai/providers.ts:394:23
     const everyMatch = text.match(
       /every\s+(\d+)\s*(day|week|weekday|month|year)s?/i
     );
-    if (everyMatch && recurring === 'none') {
+    if (everyMatch && recurring !== 'none') {
       const recNum = parseInt(everyMatch[1]);
       const recUnit = everyMatch[2].toLowerCase();
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract custom recurring from every X days
statusReason: expected 'none' to be 'custom' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:394:9
     const everyMatch = text.match(
       /every\s+(\d+)\s*(day|week|weekday|month|year)s?/i
     );
-    if (everyMatch && recurring === 'none') {
+    if (false) {
       const recNum = parseInt(everyMatch[1]);
       const recUnit = everyMatch[2].toLowerCase();
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract custom recurring from every X days
statusReason: expected 'none' to be 'custom' // Object.is equality

[Killed] MethodExpression
src/lib/ai/providers.ts:396:23
     );
     if (everyMatch && recurring === 'none') {
       const recNum = parseInt(everyMatch[1]);
-      const recUnit = everyMatch[2].toLowerCase();
+      const recUnit = everyMatch[2].toUpperCase();
       const intervalMap: Record<
         string,
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract custom recurring from every X days
statusReason: expected 'none' to be 'custom' // Object.is equality

[Survived] StringLiteral
src/lib/ai/providers.ts:401:40
         string,
         { interval: number; unit: 'days' | 'weeks' | 'months' | 'years' }
       > = {
-        day: { interval: recNum, unit: 'days' },
+        day: { interval: recNum, unit: "" },
         week: { interval: recNum, unit: 'weeks' },
         weekday: { interval: 1, unit: 'days' }, // weekdays treated as daily for config

[Survived] ObjectLiteral
src/lib/ai/providers.ts:402:15
         { interval: number; unit: 'days' | 'weeks' | 'months' | 'years' }
       > = {
         day: { interval: recNum, unit: 'days' },
-        week: { interval: recNum, unit: 'weeks' },
+        week: {},
         weekday: { interval: 1, unit: 'days' }, // weekdays treated as daily for config
         month: { interval: recNum, unit: 'months' },

[Survived] StringLiteral
src/lib/ai/providers.ts:402:41
         { interval: number; unit: 'days' | 'weeks' | 'months' | 'years' }
       > = {
         day: { interval: recNum, unit: 'days' },
-        week: { interval: recNum, unit: 'weeks' },
+        week: { interval: recNum, unit: "" },
         weekday: { interval: 1, unit: 'days' }, // weekdays treated as daily for config
         month: { interval: recNum, unit: 'months' },

[Survived] StringLiteral
src/lib/ai/providers.ts:403:39
       > = {
         day: { interval: recNum, unit: 'days' },
         week: { interval: recNum, unit: 'weeks' },
-        weekday: { interval: 1, unit: 'days' }, // weekdays treated as daily for config
+        weekday: { interval: 1, unit: "" }, // weekdays treated as daily for config
         month: { interval: recNum, unit: 'months' },
         year: { interval: recNum, unit: 'years' },

[Survived] ObjectLiteral
src/lib/ai/providers.ts:404:16
         day: { interval: recNum, unit: 'days' },
         week: { interval: recNum, unit: 'weeks' },
         weekday: { interval: 1, unit: 'days' }, // weekdays treated as daily for config
-        month: { interval: recNum, unit: 'months' },
+        month: {},
         year: { interval: recNum, unit: 'years' },
       };

[Killed] BlockStatement
src/lib/ai/providers.ts:408:21
         year: { interval: recNum, unit: 'years' },
       };
       const interval = intervalMap[recUnit];
-      if (interval) {
-        recurring = 'custom';
-        // Store for later use in return
-
-        recurringConfig = JSON.stringify(interval);
-      }
+      if (interval) {}
     }
 
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract custom recurring from every X days
statusReason: expected 'none' to be 'custom' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:408:11
         year: { interval: recNum, unit: 'years' },
       };
       const interval = intervalMap[recUnit];
-      if (interval) {
+      if (false) {
         recurring = 'custom';
         // Store for later use in return
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract custom recurring from every X days
statusReason: expected 'none' to be 'custom' // Object.is equality

[Killed] StringLiteral
src/lib/ai/providers.ts:409:21
       };
       const interval = intervalMap[recUnit];
       if (interval) {
-        recurring = 'custom';
+        recurring = "";
         // Store for later use in return
 
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract custom recurring from every X days
statusReason: expected '' to be 'custom' // Object.is equality

[Killed] Regex
src/lib/ai/providers.ts:419:18
     // Enhanced deadline parsing
     const deadlinePatterns = [
       {
-        pattern: /deadline[:\s]+(\d{4}-\d{2}-\d{2})/i,
+        pattern: /deadline[:\S]+(\d{4}-\d{2}-\d{2})/i,
         parse: (m: string[]) => m[1],
       },
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from date format
statusReason: expected undefined to be '2024-03-15' // Object.is equality

[Killed] ArrowFunction
src/lib/ai/providers.ts:420:16
     const deadlinePatterns = [
       {
         pattern: /deadline[:\s]+(\d{4}-\d{2}-\d{2})/i,
-        parse: (m: string[]) => m[1],
+        parse: () => undefined,
       },
       {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from date format
statusReason: expected undefined to be '2024-03-15' // Object.is equality

[Killed] Regex
src/lib/ai/providers.ts:423:18
         parse: (m: string[]) => m[1],
       },
       {
-        pattern: /due[:\s]+(\d{4}-\d{2}-\d{2})/i,
+        pattern: /due[:\S]+(\d{4}-\d{2}-\d{2})/i,
         parse: (m: string[]) => m[1],
       },
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from due format
statusReason: expected undefined to be '2024-05-20' // Object.is equality

[Killed] Regex
src/lib/ai/providers.ts:423:18
         parse: (m: string[]) => m[1],
       },
       {
-        pattern: /due[:\s]+(\d{4}-\d{2}-\d{2})/i,
+        pattern: /due[:\s]+(\D{4}-\d{2}-\d{2})/i,
         parse: (m: string[]) => m[1],
       },
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from due format
statusReason: expected undefined to be '2024-05-20' // Object.is equality

[Killed] ArrowFunction
src/lib/ai/providers.ts:424:16
       },
       {
         pattern: /due[:\s]+(\d{4}-\d{2}-\d{2})/i,
-        parse: (m: string[]) => m[1],
+        parse: () => undefined,
       },
       {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from due format
statusReason: expected undefined to be '2024-05-20' // Object.is equality

[Killed] Regex
src/lib/ai/providers.ts:427:18
         parse: (m: string[]) => m[1],
       },
       {
-        pattern: /by[:\s]+(tomorrow)/i,
+        pattern: /by[:\S]+(tomorrow)/i,
         parse: () => tomorrow.toISOString().split('T')[0],
       },
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from by tomorrow
statusReason: expected undefined to be defined

[Survived] Regex
src/lib/ai/providers.ts:427:18
         parse: (m: string[]) => m[1],
       },
       {
-        pattern: /by[:\s]+(tomorrow)/i,
+        pattern: /by[:\s](tomorrow)/i,
         parse: () => tomorrow.toISOString().split('T')[0],
       },

[Killed] ArrowFunction
src/lib/ai/providers.ts:428:16
       },
       {
         pattern: /by[:\s]+(tomorrow)/i,
-        parse: () => tomorrow.toISOString().split('T')[0],
+        parse: () => undefined,
       },
       {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from by tomorrow
statusReason: expected undefined to be defined

[Killed] ArrowFunction
src/lib/ai/providers.ts:432:16
       },
       {
         pattern: /by[:\s]+(next week)/i,
-        parse: () => nextWeek.toISOString().split('T')[0],
+        parse: () => undefined,
       },
     ];
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from by next week
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/lib/ai/providers.ts:432:51
       },
       {
         pattern: /by[:\s]+(next week)/i,
-        parse: () => nextWeek.toISOString().split('T')[0],
+        parse: () => nextWeek.toISOString().split("")[0],
       },
     ];

[Killed] BlockStatement
src/lib/ai/providers.ts:436:56
       },
     ];
 
-    for (const { pattern, parse } of deadlinePatterns) {
-      const match = text.match(pattern);
-      if (match) {
-        deadline = parse(match);
-        break;
-      }
-    }
+    for (const { pattern, parse } of deadlinePatterns) {}
 
     // Extract list/project context - first check explicit list mention, then keywords
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from date format
statusReason: expected undefined to be '2024-03-15' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:438:11
 
     for (const { pattern, parse } of deadlinePatterns) {
       const match = text.match(pattern);
-      if (match) {
+      if (true) {
         deadline = parse(match);
         break;
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should parse task with critical priority
statusReason: Cannot read properties of null (reading '1')

[Killed] BlockStatement
src/lib/ai/providers.ts:438:18
 
     for (const { pattern, parse } of deadlinePatterns) {
       const match = text.match(pattern);
-      if (match) {
-        deadline = parse(match);
-        break;
-      }
+      if (match) {}
     }
 
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from date format
statusReason: expected undefined to be '2024-03-15' // Object.is equality

[Survived] Regex
src/lib/ai/providers.ts:450:7
 
     // Check for explicit list mention
     const listMatch = text.match(
-      /(?:in|for|under)\s+(?:the\s+)?([a-z][a-z\s]+?)(?:\s+(?:project|list|folder)|$)/i
+      /(?:in|for|under)\s(?:the\s+)?([a-z][a-z\s]+?)(?:\s+(?:project|list|folder)|$)/i
     );
     if (listMatch) {

[Killed] ConditionalExpression
src/lib/ai/providers.ts:452:9
     const listMatch = text.match(
       /(?:in|for|under)\s+(?:the\s+)?([a-z][a-z\s]+?)(?:\s+(?:project|list|folder)|$)/i
     );
-    if (listMatch) {
+    if (true) {
       list_name = listMatch[1].trim();
     }
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should parse task with critical priority
statusReason: Cannot read properties of null (reading '1')

[Survived] BlockStatement
src/lib/ai/providers.ts:452:20
     const listMatch = text.match(
       /(?:in|for|under)\s+(?:the\s+)?([a-z][a-z\s]+?)(?:\s+(?:project|list|folder)|$)/i
     );
-    if (listMatch) {
-      list_name = listMatch[1].trim();
-    }
+    if (listMatch) {}
 
     // Check context lists if available

[Survived] MethodExpression
src/lib/ai/providers.ts:453:19
       /(?:in|for|under)\s+(?:the\s+)?([a-z][a-z\s]+?)(?:\s+(?:project|list|folder)|$)/i
     );
     if (listMatch) {
-      list_name = listMatch[1].trim();
+      list_name = listMatch[1];
     }
 

[Killed] OptionalChaining
src/lib/ai/providers.ts:457:9
     }
 
     // Check context lists if available
-    if (input.context?.lists && !list_name) {
+    if (input.context.lists && !list_name) {
       for (const list of input.context.lists) {
         if (
killedBy: KeywordParser parseTask should parse basic task name
statusReason: Cannot read properties of undefined (reading 'lists')

[Killed] BooleanLiteral
src/lib/ai/providers.ts:457:33
     }
 
     // Check context lists if available
-    if (input.context?.lists && !list_name) {
+    if (input.context?.lists && list_name) {
       for (const list of input.context.lists) {
         if (
killedBy: KeywordParser parseTask should extract list context from context lists
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:458:47
 
     // Check context lists if available
     if (input.context?.lists && !list_name) {
-      for (const list of input.context.lists) {
-        if (
-          text.includes(list.name.toLowerCase()) ||
-          text.includes(list.emoji)
-        ) {
-          list_name = list.name;
-          list_id = list.id;
-          break;
-        }
-      }
+      for (const list of input.context.lists) {}
     }
 
killedBy: KeywordParser parseTask should extract list context from context lists
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
src/lib/ai/providers.ts:460:25
     if (input.context?.lists && !list_name) {
       for (const list of input.context.lists) {
         if (
-          text.includes(list.name.toLowerCase()) ||
+          text.includes(list.name.toUpperCase()) ||
           text.includes(list.emoji)
         ) {
killedBy: KeywordParser parseTask should extract list context from context lists
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:460:11
     if (input.context?.lists && !list_name) {
       for (const list of input.context.lists) {
         if (
-          text.includes(list.name.toLowerCase()) ||
-          text.includes(list.emoji)
+          false
         ) {
           list_name = list.name;
killedBy: KeywordParser parseTask should extract list context from context lists
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:462:11
         if (
           text.includes(list.name.toLowerCase()) ||
           text.includes(list.emoji)
-        ) {
-          list_name = list.name;
-          list_id = list.id;
-          break;
-        }
+        ) {}
       }
     }
killedBy: KeywordParser parseTask should extract list context from context lists
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:471:21
     }
 
     // Check list keywords
-    if (!list_name) {
-      for (const [keyword, name] of Object.entries(this.listKeywords)) {
-        if (text.includes(keyword)) {
-          list_name = name;
-          break;
-        }
-      }
-    }
+    if (!list_name) {}
 
     // Parse time range for start/end times
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract list_name from keywords
statusReason: expected undefined to be 'Shopping' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:471:9
     }
 
     // Check list keywords
-    if (!list_name) {
+    if (false) {
       for (const [keyword, name] of Object.entries(this.listKeywords)) {
         if (text.includes(keyword)) {
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract list_name from keywords
statusReason: expected undefined to be 'Shopping' // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:472:72
 
     // Check list keywords
     if (!list_name) {
-      for (const [keyword, name] of Object.entries(this.listKeywords)) {
-        if (text.includes(keyword)) {
-          list_name = name;
-          break;
-        }
-      }
+      for (const [keyword, name] of Object.entries(this.listKeywords)) {}
     }
 
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract list_name from keywords
statusReason: expected undefined to be 'Shopping' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:473:13
     // Check list keywords
     if (!list_name) {
       for (const [keyword, name] of Object.entries(this.listKeywords)) {
-        if (text.includes(keyword)) {
+        if (false) {
           list_name = name;
           break;
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract list_name from keywords
statusReason: expected undefined to be 'Shopping' // Object.is equality
