[Killed] ConditionalExpression
src/lib/ai/providers.ts:473:13
     // Check list keywords
     if (!list_name) {
       for (const [keyword, name] of Object.entries(this.listKeywords)) {
-        if (text.includes(keyword)) {
+        if (true) {
           list_name = name;
           break;
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract list_name from keywords
statusReason: expected 'Work' to be 'Shopping' // Object.is equality

[Survived] ConditionalExpression
src/lib/ai/providers.ts:484:9
     const timeRange = this.parseTimeRange(text);
 
     // Build recurring_config for custom intervals
-    if (recurring === 'custom') {
+    if (false) {
       // recurringConfig is already set above from the everyMatch block
     }

[Survived] EqualityOperator
src/lib/ai/providers.ts:484:9
     const timeRange = this.parseTimeRange(text);
 
     // Build recurring_config for custom intervals
-    if (recurring === 'custom') {
+    if (recurring !== 'custom') {
       // recurringConfig is already set above from the everyMatch block
     }

[Killed] LogicalOperator
src/lib/ai/providers.ts:497:23
       ),
       priority,
       estimated_duration,
-      suggested_date: suggested_date ?? undefined,
+      suggested_date: suggested_date && undefined,
       recurring,
       recurring_config: recurringConfig,
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract tomorrow date
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/lib/ai/providers.ts:502:17
       recurring_config: recurringConfig,
       list_name,
       list_id,
-      deadline: deadline ?? undefined,
+      deadline: deadline && undefined,
       start_time: timeRange?.start_time,
       end_time: timeRange?.end_time,
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract deadline from date format
statusReason: expected undefined to be '2024-03-15' // Object.is equality

[Killed] OptionalChaining
src/lib/ai/providers.ts:503:19
       list_name,
       list_id,
       deadline: deadline ?? undefined,
-      start_time: timeRange?.start_time,
+      start_time: timeRange.start_time,
       end_time: timeRange?.end_time,
     };
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should parse task with critical priority
statusReason: Cannot read properties of null (reading 'start_time')

[Killed] OptionalChaining
src/lib/ai/providers.ts:504:17
       list_id,
       deadline: deadline ?? undefined,
       start_time: timeRange?.start_time,
-      end_time: timeRange?.end_time,
+      end_time: timeRange.end_time,
     };
   }
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should parse task with critical priority
statusReason: Cannot read properties of null (reading 'end_time')

[Killed] StringLiteral
src/lib/ai/providers.ts:511:7
   private cleanTaskName(text: string): string {
     // Remove common prefixes and keywords
     const prefixes = [
-      'create a task for',
+      "",
       'add',
       'schedule',
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should clean task name by removing prefixes
statusReason: expected 'Create a task for project work' to be 'Project work' // Object.is equality

[Killed] StringLiteral
src/lib/ai/providers.ts:512:7
     // Remove common prefixes and keywords
     const prefixes = [
       'create a task for',
-      'add',
+      "",
       'schedule',
       'remind me to',
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should clean task name by removing add prefix
statusReason: expected 'Add new feature' to be 'New feature' // Object.is equality

[Survived] StringLiteral
src/lib/ai/providers.ts:519:7
       'please',
       "don't forget to",
       'remember to',
-      "let's",
+      "",
       'let us',
     ];

[Killed] BlockStatement
src/lib/ai/providers.ts:524:36
     ];
 
     let name = text;
-    for (const prefix of prefixes) {
-      name = name.replace(new RegExp(`^${prefix}\\s*`, 'i'), '');
-    }
+    for (const prefix of prefixes) {}
 
     // Remove trailing context that's not part of the task name
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should clean task name by removing prefixes
statusReason: expected 'Create a task for project work' to be 'Project work' // Object.is equality

[Survived] StringLiteral
src/lib/ai/providers.ts:529:44
     }
 
     // Remove trailing context that's not part of the task name
-    name = name.replace(/\s*\(due.*?\)$/i, '');
+    name = name.replace(/\s*\(due.*?\)$/i, "Stryker was here!");
     name = name.replace(/\s*\binbox\b/i, '');
 

[Survived] Regex
src/lib/ai/providers.ts:529:25
     }
 
     // Remove trailing context that's not part of the task name
-    name = name.replace(/\s*\(due.*?\)$/i, '');
+    name = name.replace(/\s\(due.*?\)$/i, '');
     name = name.replace(/\s*\binbox\b/i, '');
 

[Survived] StringLiteral
src/lib/ai/providers.ts:530:42
 
     // Remove trailing context that's not part of the task name
     name = name.replace(/\s*\(due.*?\)$/i, '');
-    name = name.replace(/\s*\binbox\b/i, '');
+    name = name.replace(/\s*\binbox\b/i, "Stryker was here!");
 
     return name.trim().charAt(0).toUpperCase() + name.slice(1);

[Killed] MethodExpression
src/lib/ai/providers.ts:532:12
     name = name.replace(/\s*\(due.*?\)$/i, '');
     name = name.replace(/\s*\binbox\b/i, '');
 
-    return name.trim().charAt(0).toUpperCase() + name.slice(1);
+    return name.trim().toUpperCase() + name.slice(1);
   }
 
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should clean task name by removing prefixes
statusReason: expected 'PROJECT WORKroject work' to be 'Project work' // Object.is equality

[Killed] ArithmeticOperator
src/lib/ai/providers.ts:532:12
     name = name.replace(/\s*\(due.*?\)$/i, '');
     name = name.replace(/\s*\binbox\b/i, '');
 
-    return name.trim().charAt(0).toUpperCase() + name.slice(1);
+    return name.trim().charAt(0).toUpperCase() - name.slice(1);
   }
 
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should clean task name by removing prefixes
statusReason: expected NaN to be 'Project work' // Object.is equality

[Survived] BlockStatement
src/lib/ai/providers.ts:539:25
     text: string,
     priority: string,
     duration?: number
-  ): string | undefined {
-    const desc: string[] = [];
-
-    if (priority === 'critical' || text.includes('urgent')) {
-      desc.push('High priority task - requires immediate attention');
-    }
-
-    if (duration) {
-      desc.push(`Estimated time: ${duration} minutes`);
-    }
-
-    return desc.length > 0 ? desc.join('. ') : undefined;
-  }
+  ): string | undefined {}
 
   /**

[Survived] LogicalOperator
src/lib/ai/providers.ts:542:9
   ): string | undefined {
     const desc: string[] = [];
 
-    if (priority === 'critical' || text.includes('urgent')) {
+    if (priority === 'critical' && text.includes('urgent')) {
       desc.push('High priority task - requires immediate attention');
     }

[Survived] BlockStatement
src/lib/ai/providers.ts:542:61
   ): string | undefined {
     const desc: string[] = [];
 
-    if (priority === 'critical' || text.includes('urgent')) {
-      desc.push('High priority task - requires immediate attention');
-    }
+    if (priority === 'critical' || text.includes('urgent')) {}
 
     if (duration) {

[Survived] BlockStatement
src/lib/ai/providers.ts:546:19
       desc.push('High priority task - requires immediate attention');
     }
 
-    if (duration) {
-      desc.push(`Estimated time: ${duration} minutes`);
-    }
+    if (duration) {}
 
     return desc.length > 0 ? desc.join('. ') : undefined;

[Survived] ConditionalExpression
src/lib/ai/providers.ts:546:9
       desc.push('High priority task - requires immediate attention');
     }
 
-    if (duration) {
+    if (false) {
       desc.push(`Estimated time: ${duration} minutes`);
     }

[Survived] StringLiteral
src/lib/ai/providers.ts:547:17
     }
 
     if (duration) {
-      desc.push(`Estimated time: ${duration} minutes`);
+      desc.push(``);
     }
 

[Survived] ConditionalExpression
src/lib/ai/providers.ts:550:12
       desc.push(`Estimated time: ${duration} minutes`);
     }
 
-    return desc.length > 0 ? desc.join('. ') : undefined;
+    return false ? desc.join('. ') : undefined;
   }
 

[Survived] EqualityOperator
src/lib/ai/providers.ts:550:12
       desc.push(`Estimated time: ${duration} minutes`);
     }
 
-    return desc.length > 0 ? desc.join('. ') : undefined;
+    return desc.length >= 0 ? desc.join('. ') : undefined;
   }
 

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:556:78
   /**
    * Parse time from text - using shared utility
    */
-  private parseTime(text: string): { hours: number; minutes: number } | null {
-    return parseTime(text);
-  }
+  private parseTime(text: string): { hours: number; minutes: number } | null {}
 
   /**

[Survived] BlockStatement
src/lib/ai/providers.ts:565:56
    */
   private parseTimeRange(
     text: string
-  ): { start_time?: string; end_time?: string } | null {
-    return parseTimeRange(text);
-  }
+  ): { start_time?: string; end_time?: string } | null {}
 
   /**

[Killed] BlockStatement
src/lib/ai/providers.ts:572:45
   /**
    * Find the next occurrence of a specific day - using shared utility
    */
-  private getNextDay(dayName: string): Date {
-    return getNextDay(dayName);
-  }
+  private getNextDay(dayName: string): Date {}
 
   /**
killedBy: Providers Comprehensive Coverage KeywordParser - parseTask should extract weekday date
statusReason: Cannot read properties of undefined (reading 'toISOString')

[Killed] BlockStatement
src/lib/ai/providers.ts:585:5
       description?: string;
       priority?: 'critical' | 'high' | 'medium' | 'low' | 'none';
     }>
-  > {
-    const lines = notes.split('\n').filter(line => line.trim());
-    const tasks: Array<{
-      name: string;
-      description?: string;
-      priority?: 'critical' | 'high' | 'medium' | 'low' | 'none';
-    }> = [];
-
-    for (const line of lines) {
-      // Remove markdown bullet characters
-      const cleanLine = line.replace(/^[\s]*[-*>\d.\)\s]+/, '').trim();
-      if (cleanLine && cleanLine.length > 3) {
-        tasks.push({
-          name: cleanLine,
-          priority: 'medium',
-        });
-      }
-    }
-
-    return tasks;
-  }
+  > {}
 
   /**
killedBy: Providers Comprehensive Coverage KeywordParser - generateTasksFromNotes should parse bullet points from notes
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/lib/ai/providers.ts:586:44
       priority?: 'critical' | 'high' | 'medium' | 'low' | 'none';
     }>
   > {
-    const lines = notes.split('\n').filter(line => line.trim());
+    const lines = notes.split('\n').filter(() => undefined);
     const tasks: Array<{
       name: string;
killedBy: Providers Comprehensive Coverage KeywordParser - generateTasksFromNotes should parse bullet points from notes
statusReason: expected +0 to be 3 // Object.is equality

[Survived] MethodExpression
src/lib/ai/providers.ts:586:19
       priority?: 'critical' | 'high' | 'medium' | 'low' | 'none';
     }>
   > {
-    const lines = notes.split('\n').filter(line => line.trim());
+    const lines = notes.split('\n');
     const tasks: Array<{
       name: string;

[Killed] ArrayDeclaration
src/lib/ai/providers.ts:591:10
       name: string;
       description?: string;
       priority?: 'critical' | 'high' | 'medium' | 'low' | 'none';
-    }> = [];
+    }> = ["Stryker was here"];
 
     for (const line of lines) {
killedBy: Providers Comprehensive Coverage KeywordParser - generateTasksFromNotes should parse bullet points from notes
statusReason: expected 4 to be 3 // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:593:31
       priority?: 'critical' | 'high' | 'medium' | 'low' | 'none';
     }> = [];
 
-    for (const line of lines) {
-      // Remove markdown bullet characters
-      const cleanLine = line.replace(/^[\s]*[-*>\d.\)\s]+/, '').trim();
-      if (cleanLine && cleanLine.length > 3) {
-        tasks.push({
-          name: cleanLine,
-          priority: 'medium',
-        });
-      }
-    }
+    for (const line of lines) {}
 
     return tasks;
killedBy: Providers Comprehensive Coverage KeywordParser - generateTasksFromNotes should parse bullet points from notes
statusReason: expected +0 to be 3 // Object.is equality

[Survived] MethodExpression
src/lib/ai/providers.ts:595:25
 
     for (const line of lines) {
       // Remove markdown bullet characters
-      const cleanLine = line.replace(/^[\s]*[-*>\d.\)\s]+/, '').trim();
+      const cleanLine = line.replace(/^[\s]*[-*>\d.\)\s]+/, '');
       if (cleanLine && cleanLine.length > 3) {
         tasks.push({

[Killed] StringLiteral
src/lib/ai/providers.ts:595:61
 
     for (const line of lines) {
       // Remove markdown bullet characters
-      const cleanLine = line.replace(/^[\s]*[-*>\d.\)\s]+/, '').trim();
+      const cleanLine = line.replace(/^[\s]*[-*>\d.\)\s]+/, "Stryker was here!").trim();
       if (cleanLine && cleanLine.length > 3) {
         tasks.push({
killedBy: Providers Comprehensive Coverage KeywordParser - generateTasksFromNotes should filter out short lines (less than 3 chars after cleaning)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:596:24
     for (const line of lines) {
       // Remove markdown bullet characters
       const cleanLine = line.replace(/^[\s]*[-*>\d.\)\s]+/, '').trim();
-      if (cleanLine && cleanLine.length > 3) {
+      if (cleanLine && true) {
         tasks.push({
           name: cleanLine,
killedBy: Providers Comprehensive Coverage KeywordParser - generateTasksFromNotes should filter out short lines (less than 3 chars after cleaning)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:596:11
     for (const line of lines) {
       // Remove markdown bullet characters
       const cleanLine = line.replace(/^[\s]*[-*>\d.\)\s]+/, '').trim();
-      if (cleanLine && cleanLine.length > 3) {
+      if (true) {
         tasks.push({
           name: cleanLine,
killedBy: Providers Comprehensive Coverage KeywordParser - generateTasksFromNotes should filter out short lines (less than 3 chars after cleaning)
statusReason: expected 2 to be 1 // Object.is equality

[Survived] StringLiteral
src/lib/ai/providers.ts:613:40
   async generateProjectPlan(
     input: ProjectPlanInput
   ): Promise<GeneratedProject> {
-    const { projectName, description = '', constraints = {} } = input;
+    const { projectName, description = "Stryker was here!", constraints = {} } = input;
     const normalizedDescription = (
       description +

[Killed] MethodExpression
src/lib/ai/providers.ts:614:35
     input: ProjectPlanInput
   ): Promise<GeneratedProject> {
     const { projectName, description = '', constraints = {} } = input;
-    const normalizedDescription = (
-      description +
-      ' ' +
-      projectName
-    ).toLowerCase();
+    const normalizedDescription = (description + ' ' + projectName).toUpperCase();
 
     // Determine project duration based on constraints or description analysis
killedBy: AI Providers KeywordParser generateProjectPlan should detect development phases from description
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/lib/ai/providers.ts:631:33
 
     // Calculate total duration (sum of all phase durations)
     let calculatedDuration = 0;
-    for (const phase of phases) {
-      if (phase.duration_days) {
-        calculatedDuration += phase.duration_days;
-      }
-    }
+    for (const phase of phases) {}
 
     // If no phases detected, create a default single phase

[Survived] ConditionalExpression
src/lib/ai/providers.ts:632:11
     // Calculate total duration (sum of all phase durations)
     let calculatedDuration = 0;
     for (const phase of phases) {
-      if (phase.duration_days) {
+      if (false) {
         calculatedDuration += phase.duration_days;
       }

[Survived] ConditionalExpression
src/lib/ai/providers.ts:632:11
     // Calculate total duration (sum of all phase durations)
     let calculatedDuration = 0;
     for (const phase of phases) {
-      if (phase.duration_days) {
+      if (true) {
         calculatedDuration += phase.duration_days;
       }

[Killed] AssignmentOperator
src/lib/ai/providers.ts:633:9
     let calculatedDuration = 0;
     for (const phase of phases) {
       if (phase.duration_days) {
-        calculatedDuration += phase.duration_days;
+        calculatedDuration -= phase.duration_days;
       }
     }
killedBy: AI Providers KeywordParser generateProjectPlan should generate a project plan with basic input
statusReason: expected -9 to be greater than 0

[Killed] EqualityOperator
src/lib/ai/providers.ts:638:9
     }
 
     // If no phases detected, create a default single phase
-    if (phases.length === 0) {
+    if (phases.length !== 0) {
       phases.push({
         name: 'Execution',
killedBy: AI Providers KeywordParser generateProjectPlan should set priority based on keywords
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:638:9
     }
 
     // If no phases detected, create a default single phase
-    if (phases.length === 0) {
+    if (false) {
       phases.push({
         name: 'Execution',
killedBy: AI Providers KeywordParser generateProjectPlan should set priority based on keywords
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/ai/providers.ts:641:22
     if (phases.length === 0) {
       phases.push({
         name: 'Execution',
-        description: `Primary phase for ${projectName}`,
+        description: ``,
         duration_days: totalDuration,
         priority: 'high',

[Survived] EqualityOperator
src/lib/ai/providers.ts:649:9
     }
 
     // Distribute remaining days across phases if calculated < total
-    if (calculatedDuration < totalDuration) {
+    if (calculatedDuration >= totalDuration) {
       const remainingDays = totalDuration - calculatedDuration;
       // Add remaining days to the highest priority phase or spread across all

[Survived] EqualityOperator
src/lib/ai/providers.ts:649:9
     }
 
     // Distribute remaining days across phases if calculated < total
-    if (calculatedDuration < totalDuration) {
+    if (calculatedDuration <= totalDuration) {
       const remainingDays = totalDuration - calculatedDuration;
       // Add remaining days to the highest priority phase or spread across all

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:650:29
 
     // Distribute remaining days across phases if calculated < total
     if (calculatedDuration < totalDuration) {
-      const remainingDays = totalDuration - calculatedDuration;
+      const remainingDays = totalDuration + calculatedDuration;
       // Add remaining days to the highest priority phase or spread across all
       if (phases.length > 0) {

[Survived] BlockStatement
src/lib/ai/providers.ts:652:30
     if (calculatedDuration < totalDuration) {
       const remainingDays = totalDuration - calculatedDuration;
       // Add remaining days to the highest priority phase or spread across all
-      if (phases.length > 0) {
-        phases[0] = {
-          ...phases[0],
-          duration_days: (phases[0].duration_days || 0) + remainingDays,
-        };
-      }
+      if (phases.length > 0) {}
     }
 

[Survived] EqualityOperator
src/lib/ai/providers.ts:652:11
     if (calculatedDuration < totalDuration) {
       const remainingDays = totalDuration - calculatedDuration;
       // Add remaining days to the highest priority phase or spread across all
-      if (phases.length > 0) {
+      if (phases.length >= 0) {
         phases[0] = {
           ...phases[0],

[Survived] LogicalOperator
src/lib/ai/providers.ts:655:27
       if (phases.length > 0) {
         phases[0] = {
           ...phases[0],
-          duration_days: (phases[0].duration_days || 0) + remainingDays,
+          duration_days: (phases[0].duration_days && 0) + remainingDays,
         };
       }

[Survived] ConditionalExpression
src/lib/ai/providers.ts:655:27
       if (phases.length > 0) {
         phases[0] = {
           ...phases[0],
-          duration_days: (phases[0].duration_days || 0) + remainingDays,
+          duration_days: (true) + remainingDays,
         };
       }

[Killed] ConditionalExpression
src/lib/ai/providers.ts:662:20
 
     return {
       name: projectName,
-      description: description || undefined,
+      description: true,
       phases,
       total_duration_days: calculatedDuration || totalDuration,
killedBy: AI Providers KeywordParser generateProjectPlan should include description in result
statusReason: expected true to be 'This is my detailed project descripti…' // Object.is equality

[Killed] LogicalOperator
src/lib/ai/providers.ts:662:20
 
     return {
       name: projectName,
-      description: description || undefined,
+      description: description && undefined,
       phases,
       total_duration_days: calculatedDuration || totalDuration,
killedBy: AI Providers KeywordParser generateProjectPlan should include description in result
statusReason: expected undefined to be 'This is my detailed project descripti…' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:664:28
       name: projectName,
       description: description || undefined,
       phases,
-      total_duration_days: calculatedDuration || totalDuration,
+      total_duration_days: false,
       provider: this.name,
     };
killedBy: AI Providers KeywordParser generateProjectPlan should generate a project plan with basic input
statusReason: actual value must be number or bigint, received "boolean"

[Killed] ConditionalExpression
src/lib/ai/providers.ts:664:28
       name: projectName,
       description: description || undefined,
       phases,
-      total_duration_days: calculatedDuration || totalDuration,
+      total_duration_days: true,
       provider: this.name,
     };
killedBy: AI Providers KeywordParser generateProjectPlan should generate a project plan with basic input
statusReason: actual value must be number or bigint, received "boolean"

[Killed] ObjectLiteral
src/lib/ai/providers.ts:692:17
         option_template:
       },
-      approach: {
-        name: 'Approach Decision Template',
-        prompt_template:
-          "You need to decide on an approach for: {task_name}. What's the best strategy? Consider: available resources, constraints, past learnings, and desired outcome.",
-        option_template:
-          '[{{ "method1": "Description", "method2": "Description", "method3": "Description" }}]',
-      },
+      approach: {},
       tool: {
         name: 'Tool Selection Template',
killedBy: Decision Templates generateDecisionTemplate returns approach template for approach type
statusReason: expected undefined to be 'Approach Decision Template' // Object.is equality

[Killed] StringLiteral
src/lib/ai/providers.ts:693:15
       },
       approach: {
-        name: 'Approach Decision Template',
+        name: "",
         prompt_template:
           "You need to decide on an approach for: {task_name}. What's the best strategy? Consider: available resources, constraints, past learnings, and desired outcome.",
killedBy: Decision Templates generateDecisionTemplate returns approach template for approach type
statusReason: expected '' to be 'Approach Decision Template' // Object.is equality

[Killed] ObjectLiteral
src/lib/ai/providers.ts:699:13
         option_template:
           '[{{ "method1": "Description", "method2": "Description", "method3": "Description" }}]',
       },
-      tool: {
-        name: 'Tool Selection Template',
-        prompt_template:
-          'You need to select a tool for: {task_name}. What tool best fits the need? Consider: cost, integration, learning curve, and capabilities.',
-        option_template:
-          '[{{ "tool_name": "Features, pros, cons", "alternative": "Features, pros, cons" }}]',
-      },
+      tool: {},
       timeline: {
         name: 'Timeline Decision Template',
killedBy: Decision Templates generateDecisionTemplate returns tool template for tool type
statusReason: expected undefined to be 'Tool Selection Template' // Object.is equality

[Survived] StringLiteral
src/lib/ai/providers.ts:704:11
         prompt_template:
           'You need to select a tool for: {task_name}. What tool best fits the need? Consider: cost, integration, learning curve, and capabilities.',
         option_template:
-          '[{{ "tool_name": "Features, pros, cons", "alternative": "Features, pros, cons" }}]',
+          "",
       },
       timeline: {

[Killed] StringLiteral
src/lib/ai/providers.ts:707:15
           '[{{ "tool_name": "Features, pros, cons", "alternative": "Features, pros, cons" }}]',
       },
       timeline: {
-        name: 'Timeline Decision Template',
+        name: "",
         prompt_template:
           'You need to decide on a timeline for: {task_name}. When should this be completed? Consider: dependencies, deadlines, and available time.',
killedBy: Decision Templates generateDecisionTemplate returns timeline template for timeline type
statusReason: expected '' to be 'Timeline Decision Template' // Object.is equality

[Survived] StringLiteral
src/lib/ai/providers.ts:711:11
         prompt_template:
           'You need to decide on a timeline for: {task_name}. When should this be completed? Consider: dependencies, deadlines, and available time.',
         option_template:
-          '[{{ "date": "Duration, milestones", "alternative_date": "Duration, milestones" }}]',
+          "",
       },
       allocation: {

[Killed] ConditionalExpression
src/lib/ai/providers.ts:730:7
     };
 
     const template =
-      decisionTemplates[context.decisionType || 'approach'] ||
-      decisionTemplates.approach;
+      true;
     return { ...template, provider: this.name };
   }
killedBy: Decision Templates generateDecisionTemplate returns priority template for priority type
statusReason: expected undefined to be 'Priority Decision Template' // Object.is equality

[Killed] LogicalOperator
src/lib/ai/providers.ts:730:7
     };
 
     const template =
-      decisionTemplates[context.decisionType || 'approach'] ||
-      decisionTemplates.approach;
+      decisionTemplates[context.decisionType || 'approach'] && decisionTemplates.approach;
     return { ...template, provider: this.name };
   }
killedBy: Decision Templates generateDecisionTemplate returns priority template for priority type
statusReason: expected 'Approach Decision Template' to be 'Priority Decision Template' // Object.is equality

[Killed] ObjectLiteral
src/lib/ai/providers.ts:732:12
     const template =
       decisionTemplates[context.decisionType || 'approach'] ||
       decisionTemplates.approach;
-    return { ...template, provider: this.name };
+    return {};
   }
 
killedBy: Decision Templates generateDecisionTemplate returns priority template for priority type
statusReason: expected undefined to be 'Priority Decision Template' // Object.is equality

[Survived] ConditionalExpression
src/lib/ai/providers.ts:743:9
     constraints: ProjectPlanInput['constraints']
   ): number {
     // Check for explicit constraint dates
-    if (constraints?.deadline && constraints?.startDate) {
+    if (true) {
       const deadline = new Date(constraints.deadline);
       const startDate = new Date(constraints.startDate);

[Survived] OptionalChaining
src/lib/ai/providers.ts:743:9
     constraints: ProjectPlanInput['constraints']
   ): number {
     // Check for explicit constraint dates
-    if (constraints?.deadline && constraints?.startDate) {
+    if (constraints.deadline && constraints?.startDate) {
       const deadline = new Date(constraints.deadline);
       const startDate = new Date(constraints.startDate);

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:747:10
       const deadline = new Date(constraints.deadline);
       const startDate = new Date(constraints.startDate);
       const diffDays = Math.ceil(
-        (deadline.getTime() - startDate.getTime()) / (1000 * 60 * 60 * 24)
+        (deadline.getTime() + startDate.getTime()) / (1000 * 60 * 60 * 24)
       );
       if (diffDays > 0) return diffDays;

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:747:9
       const deadline = new Date(constraints.deadline);
       const startDate = new Date(constraints.startDate);
       const diffDays = Math.ceil(
-        (deadline.getTime() - startDate.getTime()) / (1000 * 60 * 60 * 24)
+        (deadline.getTime() - startDate.getTime()) * (1000 * 60 * 60 * 24)
       );
       if (diffDays > 0) return diffDays;

[Survived] EqualityOperator
src/lib/ai/providers.ts:749:11
       const diffDays = Math.ceil(
         (deadline.getTime() - startDate.getTime()) / (1000 * 60 * 60 * 24)
       );
-      if (diffDays > 0) return diffDays;
+      if (diffDays <= 0) return diffDays;
     }
 

[Survived] EqualityOperator
src/lib/ai/providers.ts:749:11
       const diffDays = Math.ceil(
         (deadline.getTime() - startDate.getTime()) / (1000 * 60 * 60 * 24)
       );
-      if (diffDays > 0) return diffDays;
+      if (diffDays >= 0) return diffDays;
     }
 

[Survived] Regex
src/lib/ai/providers.ts:756:18
     // eslint-disable-next-line @typescript-eslint/no-unused-vars
     const durationPatterns = [
       { pattern: /(\d+)\s*day/i, days: 1 },
-      { pattern: /(\d+)\s*week/i, days: 7 },
+      { pattern: /(\D+)\s*week/i, days: 7 },
       { pattern: /(\d+)\s*month/i, days: 30 },
       { pattern: /(\d+)\s*hour/i, days: 0 },
