[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:34:60
 class DatabaseRateLimiter implements RateLimiterBackend {
   private db: ReturnType<typeof import('./db').getDb>;
 
-  constructor(db: ReturnType<typeof import('./db').getDb>) {
-    this.db = db;
-  }
+  constructor(db: ReturnType<typeof import('./db').getDb>) {}
 
   async isAllowed(

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:43:23
     limitConfig: RateLimitConfig
   ): Promise<RateLimitResult> {
     const now = Date.now();
-    const resetTime = now + limitConfig.windowMs;
+    const resetTime = now - limitConfig.windowMs;
 
     // Try to insert or update the rate limit record

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:58:9
 
       const result = stmt.run(key, resetTime, now, now, resetTime);
       const newCount =
-        result.changes > 0
+        false
           ? this.db
               .prepare('SELECT count FROM rate_limit_log WHERE key = ?')

[NoCoverage] EqualityOperator
src/lib/rate-limiter.ts:58:9
 
       const result = stmt.run(key, resetTime, now, now, resetTime);
       const newCount =
-        result.changes > 0
+        result.changes <= 0
           ? this.db
               .prepare('SELECT count FROM rate_limit_log WHERE key = ?')

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:59:13
       const result = stmt.run(key, resetTime, now, now, resetTime);
       const newCount =
         result.changes > 0
-          ? this.db
-              .prepare('SELECT count FROM rate_limit_log WHERE key = ?')
-              .get(key)?.count || 1
+          ? false
           : 1;
 

[NoCoverage] LogicalOperator
src/lib/rate-limiter.ts:59:13
       const result = stmt.run(key, resetTime, now, now, resetTime);
       const newCount =
         result.changes > 0
-          ? this.db
-              .prepare('SELECT count FROM rate_limit_log WHERE key = ?')
-              .get(key)?.count || 1
+          ? this.db.prepare('SELECT count FROM rate_limit_log WHERE key = ?').get(key)?.count && 1
           : 1;
 

[NoCoverage] StringLiteral
src/lib/rate-limiter.ts:60:24
       const newCount =
         result.changes > 0
           ? this.db
-              .prepare('SELECT count FROM rate_limit_log WHERE key = ?')
+              .prepare("")
               .get(key)?.count || 1
           : 1;

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:64:23
               .get(key)?.count || 1
           : 1;
 
-      const allowed = newCount <= limitConfig.max;
+      const allowed = false;
       const currentCount = allowed ? newCount : limitConfig.max;
 

[NoCoverage] EqualityOperator
src/lib/rate-limiter.ts:64:23
               .get(key)?.count || 1
           : 1;
 
-      const allowed = newCount <= limitConfig.max;
+      const allowed = newCount > limitConfig.max;
       const currentCount = allowed ? newCount : limitConfig.max;
 

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:69:32
 
       return {
         allowed,
-        remaining: Math.max(0, limitConfig.max - currentCount),
+        remaining: Math.max(0, limitConfig.max + currentCount),
         resetTime: resetTime,
         limit: limitConfig.max,

[NoCoverage] MethodExpression
src/lib/rate-limiter.ts:69:20
 
       return {
         allowed,
-        remaining: Math.max(0, limitConfig.max - currentCount),
+        remaining: Math.min(0, limitConfig.max - currentCount),
         resetTime: resetTime,
         limit: limitConfig.max,

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:73:21
         resetTime: resetTime,
         limit: limitConfig.max,
       };
-    } catch (error) {
-      console.error('Database rate limiter error:', error);
-      // Fall back to allowing the request
-      return {
-        allowed: true,
-        remaining: limitConfig.max,
-        resetTime,
-        limit: limitConfig.max,
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/lib/rate-limiter.ts:74:21
         limit: limitConfig.max,
       };
     } catch (error) {
-      console.error('Database rate limiter error:', error);
+      console.error("", error);
       // Fall back to allowing the request
       return {

[NoCoverage] BooleanLiteral
src/lib/rate-limiter.ts:77:18
       console.error('Database rate limiter error:', error);
       // Fall back to allowing the request
       return {
-        allowed: true,
+        allowed: false,
         remaining: limitConfig.max,
         resetTime,

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:85:43
     }
   }
 
-  async reset(key: string): Promise<void> {
-    this.db.prepare('DELETE FROM rate_limit_log WHERE key = ?').run(key);
-  }
+  async reset(key: string): Promise<void> {}
 }
 

[NoCoverage] StringLiteral
src/lib/rate-limiter.ts:86:21
   }
 
   async reset(key: string): Promise<void> {
-    this.db.prepare('DELETE FROM rate_limit_log WHERE key = ?').run(key);
+    this.db.prepare("").run(key);
   }
 }

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:96:17
 class MemoryRateLimiter implements RateLimiterBackend {
   private store: Map<string, { count: number; resetTime: number }>;
 
-  constructor() {
-    this.store = new Map();
-
-    // Cleanup expired entries periodically
-    setInterval(() => {
-      const now = Date.now();
-      for (const [key, value] of this.store.entries()) {
-        if (now > value.resetTime) {
-          this.store.delete(key);
-        }
-      }
-    }, 60000);
-  }
+  constructor() {}
 
   async isAllowed(

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:100:23
     this.store = new Map();
 
     // Cleanup expired entries periodically
-    setInterval(() => {
-      const now = Date.now();
-      for (const [key, value] of this.store.entries()) {
-        if (now > value.resetTime) {
-          this.store.delete(key);
-        }
-      }
-    }, 60000);
+    setInterval(() => {}, 60000);
   }
 

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:102:56
     // Cleanup expired entries periodically
     setInterval(() => {
       const now = Date.now();
-      for (const [key, value] of this.store.entries()) {
-        if (now > value.resetTime) {
-          this.store.delete(key);
-        }
-      }
+      for (const [key, value] of this.store.entries()) {}
     }, 60000);
   }

[NoCoverage] EqualityOperator
src/lib/rate-limiter.ts:103:13
     setInterval(() => {
       const now = Date.now();
       for (const [key, value] of this.store.entries()) {
-        if (now > value.resetTime) {
+        if (now >= value.resetTime) {
           this.store.delete(key);
         }

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:103:13
     setInterval(() => {
       const now = Date.now();
       for (const [key, value] of this.store.entries()) {
-        if (now > value.resetTime) {
+        if (true) {
           this.store.delete(key);
         }

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:119:9
 
     const record = this.store.get(key);
 
-    if (!record || now > record.resetTime) {
+    if (true) {
       this.store.set(key, { count: 1, resetTime });
       return {

[NoCoverage] EqualityOperator
src/lib/rate-limiter.ts:119:20
 
     const record = this.store.get(key);
 
-    if (!record || now > record.resetTime) {
+    if (!record || now <= record.resetTime) {
       this.store.set(key, { count: 1, resetTime });
       return {

[NoCoverage] ObjectLiteral
src/lib/rate-limiter.ts:120:27
     const record = this.store.get(key);
 
     if (!record || now > record.resetTime) {
-      this.store.set(key, { count: 1, resetTime });
+      this.store.set(key, {});
       return {
         allowed: true,

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:123:20
       this.store.set(key, { count: 1, resetTime });
       return {
         allowed: true,
-        remaining: limitConfig.max - 1,
+        remaining: limitConfig.max + 1,
         resetTime,
         limit: limitConfig.max,

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:129:9
       };
     }
 
-    if (record.count >= limitConfig.max) {
+    if (true) {
       return {
         allowed: false,

[NoCoverage] EqualityOperator
src/lib/rate-limiter.ts:129:9
       };
     }
 
-    if (record.count >= limitConfig.max) {
+    if (record.count > limitConfig.max) {
       return {
         allowed: false,

[NoCoverage] UpdateOperator
src/lib/rate-limiter.ts:138:5
       };
     }
 
-    record.count++;
+    record.count--;
     this.store.set(key, record);
     return {

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:142:18
     this.store.set(key, record);
     return {
       allowed: true,
-      remaining: limitConfig.max - record.count,
+      remaining: limitConfig.max + record.count,
       resetTime,
       limit: limitConfig.max,

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:148:43
     };
   }
 
-  async reset(key: string): Promise<void> {
-    this.store.delete(key);
-  }
+  async reset(key: string): Promise<void> {}
 }
 

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:160:34
   // eslint-disable-next-line @typescript-eslint/no-explicit-any -- Redis type is complex
   private redis: any;
 
-  constructor(redisUrl?: string) {
-    if (redisUrl) {
-      try {
-        // Dynamic import to avoid issues if Redis isn't configured
-        // eslint-disable-next-line @typescript-eslint/no-require-imports
-        const Redis = require('ioredis');
-        // eslint-disable-next-line @typescript-eslint/no-explicit-any
-        this.redis = new Redis(redisUrl) as any;
-      } catch {
-        // Fall back to memory if Redis unavailable
-        console.warn(
-          'Redis not available, falling back to in-memory rate limiting'
-        );
-      }
-    }
-  }
+  constructor(redisUrl?: string) {}
 
   async isAllowed(

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:161:9
   private redis: any;
 
   constructor(redisUrl?: string) {
-    if (redisUrl) {
+    if (false) {
       try {
         // Dynamic import to avoid issues if Redis isn't configured

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:161:19
   private redis: any;
 
   constructor(redisUrl?: string) {
-    if (redisUrl) {
-      try {
-        // Dynamic import to avoid issues if Redis isn't configured
-        // eslint-disable-next-line @typescript-eslint/no-require-imports
-        const Redis = require('ioredis');
-        // eslint-disable-next-line @typescript-eslint/no-explicit-any
-        this.redis = new Redis(redisUrl) as any;
-      } catch {
-        // Fall back to memory if Redis unavailable
-        console.warn(
-          'Redis not available, falling back to in-memory rate limiting'
-        );
-      }
-    }
+    if (redisUrl) {}
   }
 

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:162:11
 
   constructor(redisUrl?: string) {
     if (redisUrl) {
-      try {
-        // Dynamic import to avoid issues if Redis isn't configured
-        // eslint-disable-next-line @typescript-eslint/no-require-imports
-        const Redis = require('ioredis');
-        // eslint-disable-next-line @typescript-eslint/no-explicit-any
-        this.redis = new Redis(redisUrl) as any;
-      } catch {
+      try {} catch {
         // Fall back to memory if Redis unavailable
         console.warn(

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:168:15
         const Redis = require('ioredis');
         // eslint-disable-next-line @typescript-eslint/no-explicit-any
         this.redis = new Redis(redisUrl) as any;
-      } catch {
-        // Fall back to memory if Redis unavailable
-        console.warn(
-          'Redis not available, falling back to in-memory rate limiting'
-        );
-      }
+      } catch {}
     }
   }

[NoCoverage] BooleanLiteral
src/lib/rate-limiter.ts:181:9
     key: string,
     limitConfig: RateLimitConfig
   ): Promise<RateLimitResult> {
-    if (!this.redis) {
+    if (this.redis) {
       // Fall back to memory
       return new MemoryRateLimiter().isAllowed(key, limitConfig);

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:181:9
     key: string,
     limitConfig: RateLimitConfig
   ): Promise<RateLimitResult> {
-    if (!this.redis) {
+    if (false) {
       // Fall back to memory
       return new MemoryRateLimiter().isAllowed(key, limitConfig);

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:186:9
       return new MemoryRateLimiter().isAllowed(key, limitConfig);
     }
 
-    try {
-      const resetTime = Date.now() + limitConfig.windowMs;
-      const redisKey = `rate_limit:${key}`;
-
-      const multi = this.redis.multi();
-      multi.incr(redisKey);
-      multi.ttl(redisKey);
-      multi.expireat(redisKey, Math.floor(resetTime / 1000));
-
-      const results = await multi.exec();
-      const count = results?.[0]?.[1] as number;
-      const ttl = results?.[1]?.[1] as number;
-
-      const allowed = count <= limitConfig.max;
-      const remaining = Math.max(0, limitConfig.max - count);
-
-      return {
-        allowed,
-        remaining,
-        resetTime: ttl ? Date.now() + ttl * 1000 : resetTime,
-        limit: limitConfig.max,
-      };
-    } catch (error) {
+    try {} catch (error) {
       console.error('Redis rate limiter error:', error);
       const resetTime = Date.now() + limitConfig.windowMs;

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:187:25
     }
 
     try {
-      const resetTime = Date.now() + limitConfig.windowMs;
+      const resetTime = Date.now() - limitConfig.windowMs;
       const redisKey = `rate_limit:${key}`;
 

[NoCoverage] StringLiteral
src/lib/rate-limiter.ts:188:24
 
     try {
       const resetTime = Date.now() + limitConfig.windowMs;
-      const redisKey = `rate_limit:${key}`;
+      const redisKey = ``;
 
       const multi = this.redis.multi();

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:193:43
       const multi = this.redis.multi();
       multi.incr(redisKey);
       multi.ttl(redisKey);
-      multi.expireat(redisKey, Math.floor(resetTime / 1000));
+      multi.expireat(redisKey, Math.floor(resetTime * 1000));
 
       const results = await multi.exec();

[NoCoverage] EqualityOperator
src/lib/rate-limiter.ts:199:23
       const count = results?.[0]?.[1] as number;
       const ttl = results?.[1]?.[1] as number;
 
-      const allowed = count <= limitConfig.max;
+      const allowed = count < limitConfig.max;
       const remaining = Math.max(0, limitConfig.max - count);
 

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:199:23
       const count = results?.[0]?.[1] as number;
       const ttl = results?.[1]?.[1] as number;
 
-      const allowed = count <= limitConfig.max;
+      const allowed = true;
       const remaining = Math.max(0, limitConfig.max - count);
 

[NoCoverage] MethodExpression
src/lib/rate-limiter.ts:200:25
       const ttl = results?.[1]?.[1] as number;
 
       const allowed = count <= limitConfig.max;
-      const remaining = Math.max(0, limitConfig.max - count);
+      const remaining = Math.min(0, limitConfig.max - count);
 
       return {

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:200:37
       const ttl = results?.[1]?.[1] as number;
 
       const allowed = count <= limitConfig.max;
-      const remaining = Math.max(0, limitConfig.max - count);
+      const remaining = Math.max(0, limitConfig.max + count);
 
       return {

[NoCoverage] ObjectLiteral
src/lib/rate-limiter.ts:202:14
       const allowed = count <= limitConfig.max;
       const remaining = Math.max(0, limitConfig.max - count);
 
-      return {
-        allowed,
-        remaining,
-        resetTime: ttl ? Date.now() + ttl * 1000 : resetTime,
-        limit: limitConfig.max,
-      };
+      return {};
     } catch (error) {
       console.error('Redis rate limiter error:', error);

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:205:26
       return {
         allowed,
         remaining,
-        resetTime: ttl ? Date.now() + ttl * 1000 : resetTime,
+        resetTime: ttl ? Date.now() - ttl * 1000 : resetTime,
         limit: limitConfig.max,
       };

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:205:39
       return {
         allowed,
         remaining,
-        resetTime: ttl ? Date.now() + ttl * 1000 : resetTime,
+        resetTime: ttl ? Date.now() + ttl / 1000 : resetTime,
         limit: limitConfig.max,
       };

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:208:21
         resetTime: ttl ? Date.now() + ttl * 1000 : resetTime,
         limit: limitConfig.max,
       };
-    } catch (error) {
-      console.error('Redis rate limiter error:', error);
-      const resetTime = Date.now() + limitConfig.windowMs;
-      return {
-        allowed: true,
-        remaining: limitConfig.max,
-        resetTime,
-        limit: limitConfig.max,
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/lib/rate-limiter.ts:209:21
         limit: limitConfig.max,
       };
     } catch (error) {
-      console.error('Redis rate limiter error:', error);
+      console.error("", error);
       const resetTime = Date.now() + limitConfig.windowMs;
       return {

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:210:25
       };
     } catch (error) {
       console.error('Redis rate limiter error:', error);
-      const resetTime = Date.now() + limitConfig.windowMs;
+      const resetTime = Date.now() - limitConfig.windowMs;
       return {
         allowed: true,

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:220:43
     }
   }
 
-  async reset(key: string): Promise<void> {
-    if (this.redis) {
-      await this.redis.del(`rate_limit:${key}`);
-    }
-  }
+  async reset(key: string): Promise<void> {}
 }
 

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:221:9
   }
 
   async reset(key: string): Promise<void> {
-    if (this.redis) {
+    if (true) {
       await this.redis.del(`rate_limit:${key}`);
     }

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:221:21
   }
 
   async reset(key: string): Promise<void> {
-    if (this.redis) {
-      await this.redis.del(`rate_limit:${key}`);
-    }
+    if (this.redis) {}
   }
 }

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:229:44
 
 // Select backend based on configuration
 // Priority: Redis > Database > Memory
-function initBackend(): RateLimiterBackend {
-  if (config.redis.url) {
-    return new RedisRateLimiter(config.redis.url);
-  }
-  // Use memory backend as fallback (database backend has circular dependency issues)
-  return new MemoryRateLimiter();
-}
+function initBackend(): RateLimiterBackend {}
 
 const backend: RateLimiterBackend = initBackend();

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:230:7
 // Select backend based on configuration
 // Priority: Redis > Database > Memory
 function initBackend(): RateLimiterBackend {
-  if (config.redis.url) {
+  if (false) {
     return new RedisRateLimiter(config.redis.url);
   }

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:230:25
 // Select backend based on configuration
 // Priority: Redis > Database > Memory
 function initBackend(): RateLimiterBackend {
-  if (config.redis.url) {
-    return new RedisRateLimiter(config.redis.url);
-  }
+  if (config.redis.url) {}
   // Use memory backend as fallback (database backend has circular dependency issues)
   return new MemoryRateLimiter();

[NoCoverage] ObjectLiteral
src/lib/rate-limiter.ts:240:27
 const backend: RateLimiterBackend = initBackend();
 
 // Named rate limiters for different endpoint types
-export const rateLimits = {
-  api: { windowMs: 60 * 1000, max: 100 },
-  auth: { windowMs: 15 * 60 * 1000, max: 10 },
-  ai: { windowMs: 60 * 1000, max: 20 },
-  strict: { windowMs: 60 * 1000, max: 30 },
-};
+export const rateLimits = {};
 
 /**

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:241:20
 
 // Named rate limiters for different endpoint types
 export const rateLimits = {
-  api: { windowMs: 60 * 1000, max: 100 },
+  api: { windowMs: 60 / 1000, max: 100 },
   auth: { windowMs: 15 * 60 * 1000, max: 10 },
   ai: { windowMs: 60 * 1000, max: 20 },

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:242:21
 // Named rate limiters for different endpoint types
 export const rateLimits = {
   api: { windowMs: 60 * 1000, max: 100 },
-  auth: { windowMs: 15 * 60 * 1000, max: 10 },
+  auth: { windowMs: 15 * 60 / 1000, max: 10 },
   ai: { windowMs: 60 * 1000, max: 20 },
   strict: { windowMs: 60 * 1000, max: 30 },

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:242:21
 // Named rate limiters for different endpoint types
 export const rateLimits = {
   api: { windowMs: 60 * 1000, max: 100 },
-  auth: { windowMs: 15 * 60 * 1000, max: 10 },
+  auth: { windowMs: 15 / 60 * 1000, max: 10 },
   ai: { windowMs: 60 * 1000, max: 20 },
   strict: { windowMs: 60 * 1000, max: 30 },

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:243:19
 export const rateLimits = {
   api: { windowMs: 60 * 1000, max: 100 },
   auth: { windowMs: 15 * 60 * 1000, max: 10 },
-  ai: { windowMs: 60 * 1000, max: 20 },
+  ai: { windowMs: 60 / 1000, max: 20 },
   strict: { windowMs: 60 * 1000, max: 30 },
 };

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:244:23
   api: { windowMs: 60 * 1000, max: 100 },
   auth: { windowMs: 15 * 60 * 1000, max: 10 },
   ai: { windowMs: 60 * 1000, max: 20 },
-  strict: { windowMs: 60 * 1000, max: 30 },
+  strict: { windowMs: 60 / 1000, max: 30 },
 };
 

[NoCoverage] ObjectLiteral
src/lib/rate-limiter.ts:244:11
   api: { windowMs: 60 * 1000, max: 100 },
   auth: { windowMs: 15 * 60 * 1000, max: 10 },
   ai: { windowMs: 60 * 1000, max: 20 },
-  strict: { windowMs: 60 * 1000, max: 30 },
+  strict: {},
 };
 

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:253:29
 export async function checkRateLimit(
   key: string,
   limitConfig: RateLimitConfig
-): Promise<RateLimitResult> {
-  return backend.isAllowed(key, limitConfig);
-}
+): Promise<RateLimitResult> {}
 
 /**

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:261:56
  * Get a client identification key from the request
  * Handles various proxy headers for accurate client identification
  */
-export function getClientKey(request: Request): string {
-  // Try X-Forwarded-For first (standard proxy header)
-  const forwardedFor = request.headers
-    .get('x-forwarded-for')
-    ?.split(',')[0]
-    ?.trim();
-
-  // Fall back to X-Real-IP (used by some proxies)
-  const realIp = request.headers.get('x-real-ip');
-
-  // Use the first available IP
-  const ip = forwardedFor || realIp || '127.0.0.1';
-
-  // Combine with user ID if available (for authenticated users)
-  const userId = request.headers.get('x-user-id') || 'anonymous';
-
-  return `${ip}:${userId}`;
-}
+export function getClientKey(request: Request): string {}
 
 /**

[NoCoverage] MethodExpression
src/lib/rate-limiter.ts:263:24
  */
 export function getClientKey(request: Request): string {
   // Try X-Forwarded-For first (standard proxy header)
-  const forwardedFor = request.headers
-    .get('x-forwarded-for')
-    ?.split(',')[0]
-    ?.trim();
+  const forwardedFor = request.headers.get('x-forwarded-for')?.split(',')[0];
 
   // Fall back to X-Real-IP (used by some proxies)

[NoCoverage] OptionalChaining
src/lib/rate-limiter.ts:263:24
  */
 export function getClientKey(request: Request): string {
   // Try X-Forwarded-For first (standard proxy header)
-  const forwardedFor = request.headers
-    .get('x-forwarded-for')
-    ?.split(',')[0]
-    ?.trim();
+  const forwardedFor = request.headers.get('x-forwarded-for')?.split(',')[0].trim();
 
   // Fall back to X-Real-IP (used by some proxies)

[NoCoverage] LogicalOperator
src/lib/rate-limiter.ts:272:14
   const realIp = request.headers.get('x-real-ip');
 
   // Use the first available IP
-  const ip = forwardedFor || realIp || '127.0.0.1';
+  const ip = (forwardedFor || realIp) && '127.0.0.1';
 
   // Combine with user ID if available (for authenticated users)

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:272:14
   const realIp = request.headers.get('x-real-ip');
 
   // Use the first available IP
-  const ip = forwardedFor || realIp || '127.0.0.1';
+  const ip = false;
 
   // Combine with user ID if available (for authenticated users)

[NoCoverage] ConditionalExpression
src/lib/rate-limiter.ts:275:18
   const ip = forwardedFor || realIp || '127.0.0.1';
 
   // Combine with user ID if available (for authenticated users)
-  const userId = request.headers.get('x-user-id') || 'anonymous';
+  const userId = true;
 
   return `${ip}:${userId}`;

[NoCoverage] LogicalOperator
src/lib/rate-limiter.ts:275:18
   const ip = forwardedFor || realIp || '127.0.0.1';
 
   // Combine with user ID if available (for authenticated users)
-  const userId = request.headers.get('x-user-id') || 'anonymous';
+  const userId = request.headers.get('x-user-id') && 'anonymous';
 
   return `${ip}:${userId}`;

[NoCoverage] StringLiteral
src/lib/rate-limiter.ts:277:10
   // Combine with user ID if available (for authenticated users)
   const userId = request.headers.get('x-user-id') || 'anonymous';
 
-  return `${ip}:${userId}`;
+  return ``;
 }
 

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:283:55
 /**
  * Get just the IP address from the request
  */
-export function getClientIp(request: Request): string {
-  return getClientKey(request).split(':')[0];
-}
+export function getClientIp(request: Request): string {}
 
 /**

[NoCoverage] StringLiteral
src/lib/rate-limiter.ts:284:38
  * Get just the IP address from the request
  */
 export function getClientIp(request: Request): string {
-  return getClientKey(request).split(':')[0];
+  return getClientKey(request).split("")[0];
 }
 

[NoCoverage] BlockStatement
src/lib/rate-limiter.ts:297:24
   const key = getClientKey(request);
   const result = await checkRateLimit(key, limitConfig);
 
-  if (!result.allowed) {
-    return {
-      allowed: false,
-      response: new Response(
-        JSON.stringify({
-          error: 'Too many requests',
-          code: 'RATE_LIMITED',
-          resetTime: result.resetTime,
-        }),
-        {
-          status: 429,
-          headers: {
-            'Content-Type': 'application/json',
-            'Retry-After': Math.ceil(
-              (result.resetTime - Date.now()) / 1000
-            ).toString(),
-          },
-        }
-      ),
-    };
-  }
+  if (!result.allowed) {}
 
   return { allowed: true };

[NoCoverage] StringLiteral
src/lib/rate-limiter.ts:303:17
       response: new Response(
         JSON.stringify({
           error: 'Too many requests',
-          code: 'RATE_LIMITED',
+          code: "",
           resetTime: result.resetTime,
         }),

[NoCoverage] ObjectLiteral
src/lib/rate-limiter.ts:306:9
           code: 'RATE_LIMITED',
           resetTime: result.resetTime,
         }),
-        {
-          status: 429,
-          headers: {
-            'Content-Type': 'application/json',
-            'Retry-After': Math.ceil(
-              (result.resetTime - Date.now()) / 1000
-            ).toString(),
-          },
-        }
+        {}
       ),
     };

[NoCoverage] ObjectLiteral
src/lib/rate-limiter.ts:308:20
         }),
         {
           status: 429,
-          headers: {
-            'Content-Type': 'application/json',
-            'Retry-After': Math.ceil(
-              (result.resetTime - Date.now()) / 1000
-            ).toString(),
-          },
+          headers: {},
         }
       ),

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:311:16
           headers: {
             'Content-Type': 'application/json',
             'Retry-After': Math.ceil(
-              (result.resetTime - Date.now()) / 1000
+              (result.resetTime + Date.now()) / 1000
             ).toString(),
           },

[NoCoverage] ArithmeticOperator
src/lib/rate-limiter.ts:311:15
           headers: {
             'Content-Type': 'application/json',
             'Retry-After': Math.ceil(
-              (result.resetTime - Date.now()) / 1000
+              (result.resetTime - Date.now()) * 1000
             ).toString(),
           },
