[Survived] StringLiteral
src/lib/ai/providers.ts:951:15
       qa: 'QA',
       quality: 'Quality Assurance',
       debug: 'Debugging',
-      launch: 'Launch',
+      launch: "",
       deployment: 'Deployment',
       release: 'Release',

[Survived] StringLiteral
src/lib/ai/providers.ts:956:16
       release: 'Release',
       'go-live': 'Go Live',
       maintenance: 'Maintenance',
-      support: 'Support',
+      support: "",
       update: 'Update',
       optimization: 'Optimization',

[Survived] StringLiteral
src/lib/ai/providers.ts:957:15
       'go-live': 'Go Live',
       maintenance: 'Maintenance',
       support: 'Support',
-      update: 'Update',
+      update: "",
       optimization: 'Optimization',
     };

[Survived] StringLiteral
src/lib/ai/providers.ts:958:21
       maintenance: 'Maintenance',
       support: 'Support',
       update: 'Update',
-      optimization: 'Optimization',
+      optimization: "",
     };
 

[Killed] ConditionalExpression
src/lib/ai/providers.ts:962:7
     };
 
     return (
-      nameMap[keyword.toLowerCase()] ||
-      keyword.charAt(0).toUpperCase() + keyword.slice(1)
+      true
     );
   }
killedBy: AI Providers KeywordParser generateProjectPlan should detect development phases from description
statusReason: p.name.toLowerCase is not a function

[Killed] ConditionalExpression
src/lib/ai/providers.ts:962:7
     };
 
     return (
-      nameMap[keyword.toLowerCase()] ||
-      keyword.charAt(0).toUpperCase() + keyword.slice(1)
+      false
     );
   }
killedBy: AI Providers KeywordParser generateProjectPlan should detect development phases from description
statusReason: p.name.toLowerCase is not a function

[NoCoverage] MethodExpression
src/lib/ai/providers.ts:963:41
 
     return (
       nameMap[keyword.toLowerCase()] ||
-      keyword.charAt(0).toUpperCase() + keyword.slice(1)
+      keyword.charAt(0).toUpperCase() + keyword
     );
   }

[NoCoverage] MethodExpression
src/lib/ai/providers.ts:963:7
 
     return (
       nameMap[keyword.toLowerCase()] ||
-      keyword.charAt(0).toUpperCase() + keyword.slice(1)
+      keyword.toUpperCase() + keyword.slice(1)
     );
   }

[Killed] ArrowFunction
src/lib/ai/providers.ts:976:36
       deadline?: string | null;
     }>
   ): Promise<{ tips: string[]; suggestions: string[]; trends: string[] }> {
-    const completed = tasks.filter(t => t.completed).length;
+    const completed = tasks.filter(() => undefined).length;
     const total = tasks.length;
     const completionRate =
killedBy: KeywordParser generateInsights should calculate completion rate
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/ai/providers.ts:976:23
       deadline?: string | null;
     }>
   ): Promise<{ tips: string[]; suggestions: string[]; trends: string[] }> {
-    const completed = tasks.filter(t => t.completed).length;
+    const completed = tasks.length;
     const total = tasks.length;
     const completionRate =
killedBy: KeywordParser generateInsights should calculate completion rate
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:979:7
     const completed = tasks.filter(t => t.completed).length;
     const total = tasks.length;
     const completionRate =
-      total > 0 ? Math.round((completed / total) * 100) : 0;
+      false ? Math.round((completed / total) * 100) : 0;
     const now = new Date();
 
killedBy: AI Providers - Edge Cases KeywordParser should generate insights for completed tasks
statusReason: expected [ 'Current completion rate: 0%', …(3) ] to include 'Current completion rate: 100%'

[Killed] ArithmeticOperator
src/lib/ai/providers.ts:979:30
     const completed = tasks.filter(t => t.completed).length;
     const total = tasks.length;
     const completionRate =
-      total > 0 ? Math.round((completed / total) * 100) : 0;
+      total > 0 ? Math.round(completed / total / 100) : 0;
     const now = new Date();
 
killedBy: AI Providers - Edge Cases KeywordParser should generate insights for completed tasks
statusReason: expected [ 'Current completion rate: 0%', …(3) ] to include 'Current completion rate: 100%'

[Killed] ArrayDeclaration
src/lib/ai/providers.ts:984:30
 
     const tips: string[] = [];
     const suggestions: string[] = [];
-    const trends: string[] = [];
+    const trends: string[] = ["Stryker was here"];
 
     // Productivity tips based on completion rate
killedBy: AI Module generateTaskInsights should generate insights for tasks
statusReason: expected 'Stryker was here' to contain '50%'

[Killed] EqualityOperator
src/lib/ai/providers.ts:987:9
     const trends: string[] = [];
 
     // Productivity tips based on completion rate
-    if (completionRate < 30) {
+    if (completionRate >= 30) {
       tips.push(
         'Your completion rate is quite low. Try breaking large tasks into smaller, actionable steps.'
killedBy: AI Module generateTaskInsights should provide positive tips for high completion rate
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:987:9
     const trends: string[] = [];
 
     // Productivity tips based on completion rate
-    if (completionRate < 30) {
+    if (true) {
       tips.push(
         'Your completion rate is quite low. Try breaking large tasks into smaller, actionable steps.'
killedBy: AI Module generateTaskInsights should provide positive tips for high completion rate
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:991:37
       tips.push(
         'Your completion rate is quite low. Try breaking large tasks into smaller, actionable steps.'
       );
-    } else if (completionRate < 50) {
-      tips.push(
-        'Focus on completing high-priority tasks first to improve your completion rate.'
-      );
-    } else if (completionRate >= 80) {
+    } else if (completionRate < 50) {} else if (completionRate >= 80) {
       tips.push(
         'Great job! Your completion rate is excellent. Consider taking on more challenging tasks.'
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should generate insights for medium completion rate (30-50%)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/lib/ai/providers.ts:991:16
       tips.push(
         'Your completion rate is quite low. Try breaking large tasks into smaller, actionable steps.'
       );
-    } else if (completionRate < 50) {
+    } else if (false) {
       tips.push(
         'Focus on completing high-priority tasks first to improve your completion rate.'
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should generate insights for medium completion rate (30-50%)
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/lib/ai/providers.ts:995:38
       tips.push(
         'Focus on completing high-priority tasks first to improve your completion rate.'
       );
-    } else if (completionRate >= 80) {
-      tips.push(
-        'Great job! Your completion rate is excellent. Consider taking on more challenging tasks.'
-      );
-    } else if (completionRate >= 60) {
+    } else if (completionRate >= 80) {} else if (completionRate >= 60) {
       tips.push(
         'Good progress! Keep focusing on consistency to reach the next level.'
killedBy: AI Module generateTaskInsights should provide positive tips for high completion rate
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:995:16
       tips.push(
         'Focus on completing high-priority tasks first to improve your completion rate.'
       );
-    } else if (completionRate >= 80) {
+    } else if (false) {
       tips.push(
         'Great job! Your completion rate is excellent. Consider taking on more challenging tasks.'
killedBy: AI Module generateTaskInsights should provide positive tips for high completion rate
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:999:38
       tips.push(
         'Great job! Your completion rate is excellent. Consider taking on more challenging tasks.'
       );
-    } else if (completionRate >= 60) {
-      tips.push(
-        'Good progress! Keep focusing on consistency to reach the next level.'
-      );
-    }
+    } else if (completionRate >= 60) {}
 
     // Priority-based suggestions
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should generate insights for good completion rate (60-80%)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/lib/ai/providers.ts:999:16
       tips.push(
         'Great job! Your completion rate is excellent. Consider taking on more challenging tasks.'
       );
-    } else if (completionRate >= 60) {
+    } else if (false) {
       tips.push(
         'Good progress! Keep focusing on consistency to reach the next level.'
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should generate insights for good completion rate (60-80%)
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
src/lib/ai/providers.ts:1006:27
     }
 
     // Priority-based suggestions
-    const criticalTasks = tasks.filter(
-      t => t.priority === 'critical' && !t.completed
-    );
+    const criticalTasks = tasks;
     const highPriorityTasks = tasks.filter(
       t => t.priority === 'high' && !t.completed
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for single critical task
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/lib/ai/providers.ts:1007:12
 
     // Priority-based suggestions
     const criticalTasks = tasks.filter(
-      t => t.priority === 'critical' && !t.completed
+      t => t.priority !== 'critical' && !t.completed
     );
     const highPriorityTasks = tasks.filter(
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for multiple critical tasks
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/lib/ai/providers.ts:1007:12
 
     // Priority-based suggestions
     const criticalTasks = tasks.filter(
-      t => t.priority === 'critical' && !t.completed
+      t => true
     );
     const highPriorityTasks = tasks.filter(
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for single critical task
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
src/lib/ai/providers.ts:1009:31
     const criticalTasks = tasks.filter(
       t => t.priority === 'critical' && !t.completed
     );
-    const highPriorityTasks = tasks.filter(
-      t => t.priority === 'high' && !t.completed
-    );
+    const highPriorityTasks = tasks;
 
     if (criticalTasks.length > 3) {

[Killed] EqualityOperator
src/lib/ai/providers.ts:1010:12
       t => t.priority === 'critical' && !t.completed
     );
     const highPriorityTasks = tasks.filter(
-      t => t.priority === 'high' && !t.completed
+      t => t.priority !== 'high' && !t.completed
     );
 
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for many high priority tasks
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/ai/providers.ts:1010:37
       t => t.priority === 'critical' && !t.completed
     );
     const highPriorityTasks = tasks.filter(
-      t => t.priority === 'high' && !t.completed
+      t => t.priority === 'high' && t.completed
     );
 
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for many high priority tasks
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:1013:9
       t => t.priority === 'high' && !t.completed
     );
 
-    if (criticalTasks.length > 3) {
+    if (false) {
       suggestions.push(
         `You have ${criticalTasks.length} critical tasks pending. Consider breaking them into smaller steps.`
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for multiple critical tasks
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/lib/ai/providers.ts:1013:9
       t => t.priority === 'high' && !t.completed
     );
 
-    if (criticalTasks.length > 3) {
+    if (criticalTasks.length <= 3) {
       suggestions.push(
         `You have ${criticalTasks.length} critical tasks pending. Consider breaking them into smaller steps.`
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for multiple critical tasks
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/lib/ai/providers.ts:1017:16
       suggestions.push(
         `You have ${criticalTasks.length} critical tasks pending. Consider breaking them into smaller steps.`
       );
-    } else if (criticalTasks.length === 1) {
+    } else if (false) {
       suggestions.push(
         `Focus on completing "${criticalTasks[0].name}" - your only critical task.`
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for single critical task
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/lib/ai/providers.ts:1017:44
       suggestions.push(
         `You have ${criticalTasks.length} critical tasks pending. Consider breaking them into smaller steps.`
       );
-    } else if (criticalTasks.length === 1) {
-      suggestions.push(
-        `Focus on completing "${criticalTasks[0].name}" - your only critical task.`
-      );
-    }
+    } else if (criticalTasks.length === 1) {}
 
     if (highPriorityTasks.length > 5) {
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for single critical task
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/lib/ai/providers.ts:1023:9
       );
     }
 
-    if (highPriorityTasks.length > 5) {
+    if (highPriorityTasks.length <= 5) {
       suggestions.push(
         `${highPriorityTasks.length} high-priority tasks could be rescheduled if not urgent.`
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for many high priority tasks
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:1023:39
       );
     }
 
-    if (highPriorityTasks.length > 5) {
-      suggestions.push(
-        `${highPriorityTasks.length} high-priority tasks could be rescheduled if not urgent.`
-      );
-    }
+    if (highPriorityTasks.length > 5) {}
 
     // Overdue analysis
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should suggest for many high priority tasks
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/lib/ai/providers.ts:1030:26
     }
 
     // Overdue analysis
-    const overdueTasks = tasks.filter(
-      t => t.deadline && new Date(t.deadline) < now && !t.completed
-    );
+    const overdueTasks = tasks;
     if (overdueTasks.length > 0) {
       const oldestOverdue = overdueTasks.reduce(

[Killed] BooleanLiteral
src/lib/ai/providers.ts:1031:56
 
     // Overdue analysis
     const overdueTasks = tasks.filter(
-      t => t.deadline && new Date(t.deadline) < now && !t.completed
+      t => t.deadline && new Date(t.deadline) < now && t.completed
     );
     if (overdueTasks.length > 0) {
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze overdue tasks
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/ai/providers.ts:1031:7
 
     // Overdue analysis
     const overdueTasks = tasks.filter(
-      t => t.deadline && new Date(t.deadline) < now && !t.completed
+      () => undefined
     );
     if (overdueTasks.length > 0) {
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze overdue tasks
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:1033:9
     const overdueTasks = tasks.filter(
       t => t.deadline && new Date(t.deadline) < now && !t.completed
     );
-    if (overdueTasks.length > 0) {
+    if (false) {
       const oldestOverdue = overdueTasks.reduce(
         (oldest, t) =>
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze overdue tasks
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:1033:34
     const overdueTasks = tasks.filter(
       t => t.deadline && new Date(t.deadline) < now && !t.completed
     );
-    if (overdueTasks.length > 0) {
-      const oldestOverdue = overdueTasks.reduce(
-        (oldest, t) =>
-          t.deadline &&
-          (!oldest.deadline || new Date(t.deadline) < new Date(oldest.deadline))
-            ? t
-            : oldest,
-        { deadline: null as string | null } as (typeof tasks)[0]
-      );
-      suggestions.push(
-        `${overdueTasks.length} task(s) are overdue. Review and update deadlines or prioritize completion.`
-      );
-      if (oldestOverdue.deadline) {
-        const daysOverdue = Math.floor(
-          (now.getTime() - new Date(oldestOverdue.deadline).getTime()) /
-            (1000 * 60 * 60 * 24)
-        );
-        suggestions.push(
-          `Your oldest overdue task "${oldestOverdue.name}" has been pending for ${daysOverdue} days.`
-        );
-      }
-    }
+    if (overdueTasks.length > 0) {}
 
     // Deadline proximity suggestions
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze overdue tasks
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/ai/providers.ts:1035:9
     );
     if (overdueTasks.length > 0) {
       const oldestOverdue = overdueTasks.reduce(
-        (oldest, t) =>
-          t.deadline &&
-          (!oldest.deadline || new Date(t.deadline) < new Date(oldest.deadline))
-            ? t
-            : oldest,
+        () => undefined,
         { deadline: null as string | null } as (typeof tasks)[0]
       );
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze overdue tasks
statusReason: Cannot read properties of undefined (reading 'deadline')

[Survived] LogicalOperator
src/lib/ai/providers.ts:1036:11
     if (overdueTasks.length > 0) {
       const oldestOverdue = overdueTasks.reduce(
         (oldest, t) =>
-          t.deadline &&
-          (!oldest.deadline || new Date(t.deadline) < new Date(oldest.deadline))
+          t.deadline || !oldest.deadline || new Date(t.deadline) < new Date(oldest.deadline)
             ? t
             : oldest,

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1036:11
     if (overdueTasks.length > 0) {
       const oldestOverdue = overdueTasks.reduce(
         (oldest, t) =>
-          t.deadline &&
-          (!oldest.deadline || new Date(t.deadline) < new Date(oldest.deadline))
+          true
             ? t
             : oldest,

[Survived] BooleanLiteral
src/lib/ai/providers.ts:1037:12
       const oldestOverdue = overdueTasks.reduce(
         (oldest, t) =>
           t.deadline &&
-          (!oldest.deadline || new Date(t.deadline) < new Date(oldest.deadline))
+          (oldest.deadline || new Date(t.deadline) < new Date(oldest.deadline))
             ? t
             : oldest,

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1037:12
       const oldestOverdue = overdueTasks.reduce(
         (oldest, t) =>
           t.deadline &&
-          (!oldest.deadline || new Date(t.deadline) < new Date(oldest.deadline))
+          (true)
             ? t
             : oldest,

[Survived] StringLiteral
src/lib/ai/providers.ts:1043:9
         { deadline: null as string | null } as (typeof tasks)[0]
       );
       suggestions.push(
-        `${overdueTasks.length} task(s) are overdue. Review and update deadlines or prioritize completion.`
+        ``
       );
       if (oldestOverdue.deadline) {

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1045:11
       suggestions.push(
         `${overdueTasks.length} task(s) are overdue. Review and update deadlines or prioritize completion.`
       );
-      if (oldestOverdue.deadline) {
+      if (false) {
         const daysOverdue = Math.floor(
           (now.getTime() - new Date(oldestOverdue.deadline).getTime()) /

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1045:11
       suggestions.push(
         `${overdueTasks.length} task(s) are overdue. Review and update deadlines or prioritize completion.`
       );
-      if (oldestOverdue.deadline) {
+      if (true) {
         const daysOverdue = Math.floor(
           (now.getTime() - new Date(oldestOverdue.deadline).getTime()) /

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:1047:12
       );
       if (oldestOverdue.deadline) {
         const daysOverdue = Math.floor(
-          (now.getTime() - new Date(oldestOverdue.deadline).getTime()) /
+          (now.getTime() + new Date(oldestOverdue.deadline).getTime()) /
             (1000 * 60 * 60 * 24)
         );

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:1047:11
       );
       if (oldestOverdue.deadline) {
         const daysOverdue = Math.floor(
-          (now.getTime() - new Date(oldestOverdue.deadline).getTime()) /
-            (1000 * 60 * 60 * 24)
+          (now.getTime() - new Date(oldestOverdue.deadline).getTime()) * (1000 * 60 * 60 * 24)
         );
         suggestions.push(

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:1048:14
       if (oldestOverdue.deadline) {
         const daysOverdue = Math.floor(
           (now.getTime() - new Date(oldestOverdue.deadline).getTime()) /
-            (1000 * 60 * 60 * 24)
+            (1000 * 60 / 60 * 24)
         );
         suggestions.push(

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:1048:14
       if (oldestOverdue.deadline) {
         const daysOverdue = Math.floor(
           (now.getTime() - new Date(oldestOverdue.deadline).getTime()) /
-            (1000 * 60 * 60 * 24)
+            (1000 / 60 * 60 * 24)
         );
         suggestions.push(

[Survived] StringLiteral
src/lib/ai/providers.ts:1051:11
             (1000 * 60 * 60 * 24)
         );
         suggestions.push(
-          `Your oldest overdue task "${oldestOverdue.name}" has been pending for ${daysOverdue} days.`
+          ``
         );
       }

[Survived] MethodExpression
src/lib/ai/providers.ts:1057:22
     }
 
     // Deadline proximity suggestions
-    const thisWeek = tasks.filter(
-      t =>
-        t.deadline &&
-        new Date(t.deadline) >= now &&
-        new Date(t.deadline) <=
-          new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
-        !t.completed
-    );
+    const thisWeek = tasks;
     if (thisWeek.length > 0) {
       tips.push(

[Killed] ArrowFunction
src/lib/ai/providers.ts:1058:7
 
     // Deadline proximity suggestions
     const thisWeek = tasks.filter(
-      t =>
-        t.deadline &&
-        new Date(t.deadline) >= now &&
-        new Date(t.deadline) <=
-          new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
-        !t.completed
+      () => undefined
     );
     if (thisWeek.length > 0) {
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:1059:9
     // Deadline proximity suggestions
     const thisWeek = tasks.filter(
       t =>
-        t.deadline &&
-        new Date(t.deadline) >= now &&
-        new Date(t.deadline) <=
-          new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
-        !t.completed
+        false
     );
     if (thisWeek.length > 0) {
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/lib/ai/providers.ts:1059:9
     // Deadline proximity suggestions
     const thisWeek = tasks.filter(
       t =>
-        t.deadline &&
-        new Date(t.deadline) >= now &&
+        t.deadline || new Date(t.deadline) >= now &&
         new Date(t.deadline) <=
           new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&

[Killed] EqualityOperator
src/lib/ai/providers.ts:1060:9
     const thisWeek = tasks.filter(
       t =>
         t.deadline &&
-        new Date(t.deadline) >= now &&
+        new Date(t.deadline) < now &&
         new Date(t.deadline) <=
           new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
src/lib/ai/providers.ts:1060:9
     const thisWeek = tasks.filter(
       t =>
         t.deadline &&
-        new Date(t.deadline) >= now &&
+        new Date(t.deadline) > now &&
         new Date(t.deadline) <=
           new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&

[Killed] EqualityOperator
src/lib/ai/providers.ts:1061:9
       t =>
         t.deadline &&
         new Date(t.deadline) >= now &&
-        new Date(t.deadline) <=
-          new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
+        new Date(t.deadline) > new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
         !t.completed
     );
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
src/lib/ai/providers.ts:1061:9
       t =>
         t.deadline &&
         new Date(t.deadline) >= now &&
-        new Date(t.deadline) <=
-          new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
+        new Date(t.deadline) < new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
         !t.completed
     );

[Killed] ArithmeticOperator
src/lib/ai/providers.ts:1062:20
         t.deadline &&
         new Date(t.deadline) >= now &&
         new Date(t.deadline) <=
-          new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
+          new Date(now.getTime() - 7 * 24 * 60 * 60 * 1000) &&
         !t.completed
     );
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/lib/ai/providers.ts:1062:36
         t.deadline &&
         new Date(t.deadline) >= now &&
         new Date(t.deadline) <=
-          new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
+          new Date(now.getTime() + 7 * 24 * 60 * 60 / 1000) &&
         !t.completed
     );
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/ai/providers.ts:1063:9
         new Date(t.deadline) >= now &&
         new Date(t.deadline) <=
           new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
-        !t.completed
+        t.completed
     );
     if (thisWeek.length > 0) {
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:1065:30
           new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
         !t.completed
     );
-    if (thisWeek.length > 0) {
-      tips.push(
-        `${thisWeek.length} task(s) due this week. Consider blocking dedicated time for them.`
-      );
-    }
+    if (thisWeek.length > 0) {}
 
     // Trends analysis
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/ai/providers.ts:1065:9
           new Date(now.getTime() + 7 * 24 * 60 * 60 * 1000) &&
         !t.completed
     );
-    if (thisWeek.length > 0) {
+    if (thisWeek.length <= 0) {
       tips.push(
         `${thisWeek.length} task(s) due this week. Consider blocking dedicated time for them.`
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/ai/providers.ts:1067:9
     );
     if (thisWeek.length > 0) {
       tips.push(
-        `${thisWeek.length} task(s) due this week. Consider blocking dedicated time for them.`
+        ``
       );
     }
killedBy: Providers Comprehensive Coverage KeywordParser - generateInsights should analyze tasks due this week
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/ai/providers.ts:1077:7
       `${criticalTasks.length} critical, ${highPriorityTasks.length} high-priority tasks in progress`
     );
     trends.push(
-      `${overdueTasks.length} overdue, ${thisWeek.length} due this week`
+      ``
     );
 

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1081:27
     );
 
     // Productivity insights
-    const avgCompletion = tasks.length > 0 ? completed / tasks.length : 0;
+    const avgCompletion = false ? completed / tasks.length : 0;
     if (avgCompletion > 0.8) {
       trends.push(
