[Survived] StringLiteral
src/lib/ai/providers.ts:1665:21
         }
         const response = await withTimeout(
           fetch(`${this.baseURL}/v1/messages`, {
-            method: 'POST',
+            method: "",
             headers: {
               'x-api-key': apiKey,

[Survived] ObjectLiteral
src/lib/ai/providers.ts:1671:34
               'Content-Type': 'application/json',
               'anthropic-version': '2023-06-01',
             },
-            body: JSON.stringify({
-              model: this.model,
-              max_tokens: 500,
-              messages: [{ role: 'user', content: prompt }],
-            }),
+            body: JSON.stringify({}),
           }),
           DEFAULT_TIMEOUT_MS

[Survived] ArrayDeclaration
src/lib/ai/providers.ts:1674:25
             body: JSON.stringify({
               model: this.model,
               max_tokens: 500,
-              messages: [{ role: 'user', content: prompt }],
+              messages: [],
             }),
           }),

[NoCoverage] ObjectLiteral
src/lib/ai/providers.ts:1682:40
 
         if (!response.ok) {
           const errorBody = await response.text();
-          logError('Claude API error', {
-            status: response.status,
-            body: errorBody,
-          });
+          logError('Claude API error', {});
           throw new Error(
             `Claude API error: ${response.status} ${response.statusText}`

[Killed] LogicalOperator
src/lib/ai/providers.ts:1692:25
         }
 
         const data = await response.json();
-        const content = data.content[0]?.text ?? '{}';
+        const content = data.content[0]?.text && '{}';
         const parsed = taskSuggestionSchema.safeParse(JSON.parse(content));
         if (!parsed.success) {
killedBy: AI Providers - Edge Cases ClaudeProvider should handle malformed response
statusReason: promise resolved "{ name: 'Test', …(11) }" instead of rejecting

[Survived] OptionalChaining
src/lib/ai/providers.ts:1692:25
         }
 
         const data = await response.json();
-        const content = data.content[0]?.text ?? '{}';
+        const content = data.content[0].text ?? '{}';
         const parsed = taskSuggestionSchema.safeParse(JSON.parse(content));
         if (!parsed.success) {

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:1694:30
         const data = await response.json();
         const content = data.content[0]?.text ?? '{}';
         const parsed = taskSuggestionSchema.safeParse(JSON.parse(content));
-        if (!parsed.success) {
-          logWarn('Claude response validation failed, using fallback', {
-            issues: parsed.error.issues,
-          });
-          // Fallback to keyword parser on validation failure
-          return new KeywordParser().parseTask(input);
-        }
+        if (!parsed.success) {}
         return parsed.data;
       });

[Killed] BlockStatement
src/lib/ai/providers.ts:1703:21
         }
         return parsed.data;
       });
-    } catch (error) {
-      logError(
-        'Claude parsing failed',
-        undefined,
-        error instanceof Error ? error : new Error(String(error))
-      );
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: AI Providers - Edge Cases ClaudeProvider should handle API error response
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1722:9
       deadline?: string | null;
     }>
   ): Promise<{ tips: string[]; suggestions: string[]; trends: string[] }> {
-    if (!process.env.ANTHROPIC_API_KEY) {
+    if (false) {
       return { tips: [], suggestions: [], trends: [] };
     }

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1722:9
       deadline?: string | null;
     }>
   ): Promise<{ tips: string[]; suggestions: string[]; trends: string[] }> {
-    if (!process.env.ANTHROPIC_API_KEY) {
+    if (true) {
       return { tips: [], suggestions: [], trends: [] };
     }

[Killed] ArrayDeclaration
src/lib/ai/providers.ts:1723:51
     }>
   ): Promise<{ tips: string[]; suggestions: string[]; trends: string[] }> {
     if (!process.env.ANTHROPIC_API_KEY) {
-      return { tips: [], suggestions: [], trends: [] };
+      return { tips: [], suggestions: [], trends: ["Stryker was here"] };
     }
 
killedBy: Providers Comprehensive Coverage ClaudeProvider - generateInsights should return empty arrays when ANTHROPIC_API_KEY is not set
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ObjectLiteral
src/lib/ai/providers.ts:1723:14
     }>
   ): Promise<{ tips: string[]; suggestions: string[]; trends: string[] }> {
     if (!process.env.ANTHROPIC_API_KEY) {
-      return { tips: [], suggestions: [], trends: [] };
+      return {};
     }
 
killedBy: Providers Comprehensive Coverage ClaudeProvider - generateInsights should return empty arrays when ANTHROPIC_API_KEY is not set
statusReason: expected undefined to deeply equal []

[Survived] BooleanLiteral
src/lib/ai/providers.ts:1736:11
 
     try {
       const apiKey = process.env.ANTHROPIC_API_KEY;
-      if (!apiKey) {
+      if (apiKey) {
         throw new Error('ANTHROPIC_API_KEY is not set');
       }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1737:25
     try {
       const apiKey = process.env.ANTHROPIC_API_KEY;
       if (!apiKey) {
-        throw new Error('ANTHROPIC_API_KEY is not set');
+        throw new Error("");
       }
       return await this.withRetry(async () => {

[Survived] ObjectLiteral
src/lib/ai/providers.ts:1740:69
         throw new Error('ANTHROPIC_API_KEY is not set');
       }
       return await this.withRetry(async () => {
-        const response = await fetch(`${this.baseURL}/v1/messages`, {
-          method: 'POST',
-          headers: {
-            'x-api-key': apiKey,
-            'Content-Type': 'application/json',
-            'anthropic-version': '2023-06-01',
-          },
-          body: JSON.stringify({
-            model: this.model,
-            max_tokens: 500,
-            messages: [{ role: 'user', content: prompt }],
-          }),
-        });
+        const response = await fetch(`${this.baseURL}/v1/messages`, {});
 
         if (!response.ok) {

[Survived] StringLiteral
src/lib/ai/providers.ts:1744:29
           method: 'POST',
           headers: {
             'x-api-key': apiKey,
-            'Content-Type': 'application/json',
+            'Content-Type': "",
             'anthropic-version': '2023-06-01',
           },

[Survived] LogicalOperator
src/lib/ai/providers.ts:1760:11
 
         const data = await response.json();
         const content =
-          data.content[0]?.text ?? '{"tips":[],"suggestions":[],"trends":[]}';
+          data.content[0]?.text && '{"tips":[],"suggestions":[],"trends":[]}';
         const parsed = aiInsightsSchema.safeParse(JSON.parse(content));
         if (!parsed.success) {

[Survived] OptionalChaining
src/lib/ai/providers.ts:1760:11
 
         const data = await response.json();
         const content =
-          data.content[0]?.text ?? '{"tips":[],"suggestions":[],"trends":[]}';
+          data.content[0].text ?? '{"tips":[],"suggestions":[],"trends":[]}';
         const parsed = aiInsightsSchema.safeParse(JSON.parse(content));
         if (!parsed.success) {

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:1762:30
         const content =
           data.content[0]?.text ?? '{"tips":[],"suggestions":[],"trends":[]}';
         const parsed = aiInsightsSchema.safeParse(JSON.parse(content));
-        if (!parsed.success) {
-          logWarn('Claude insights validation failed', {
-            issues: parsed.error.issues,
-          });
-          return { tips: [], suggestions: [], trends: [] };
-        }
+        if (!parsed.success) {}
         return parsed.data;
       });

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1762:13
         const content =
           data.content[0]?.text ?? '{"tips":[],"suggestions":[],"trends":[]}';
         const parsed = aiInsightsSchema.safeParse(JSON.parse(content));
-        if (!parsed.success) {
+        if (true) {
           logWarn('Claude insights validation failed', {
             issues: parsed.error.issues,

[NoCoverage] ArrayDeclaration
src/lib/ai/providers.ts:1766:43
           logWarn('Claude insights validation failed', {
             issues: parsed.error.issues,
           });
-          return { tips: [], suggestions: [], trends: [] };
+          return { tips: [], suggestions: ["Stryker was here"], trends: [] };
         }
         return parsed.data;

[NoCoverage] ArrayDeclaration
src/lib/ai/providers.ts:1766:26
           logWarn('Claude insights validation failed', {
             issues: parsed.error.issues,
           });
-          return { tips: [], suggestions: [], trends: [] };
+          return { tips: ["Stryker was here"], suggestions: [], trends: [] };
         }
         return parsed.data;

[Killed] BlockStatement
src/lib/ai/providers.ts:1770:21
         }
         return parsed.data;
       });
-    } catch (error) {
-      logError(
-        'Claude insights failed',
-        undefined,
-        error instanceof Error ? error : new Error(String(error))
-      );
-      return { tips: [], suggestions: [], trends: [] };
-    }
+    } catch (error) {}
   }
 
killedBy: AI Providers - Full Coverage ClaudeProvider - Full Coverage should handle API error in generateInsights
statusReason: Cannot read properties of undefined (reading 'tips')

[Survived] StringLiteral
src/lib/ai/providers.ts:1772:9
       });
     } catch (error) {
       logError(
-        'Claude insights failed',
+        "",
         undefined,
         error instanceof Error ? error : new Error(String(error))

[Survived] BlockStatement
src/lib/ai/providers.ts:1787:41
       priority?: 'critical' | 'high' | 'medium' | 'low' | 'none';
     }>
   > {
-    if (!process.env.ANTHROPIC_API_KEY) {
-      return [];
-    }
+    if (!process.env.ANTHROPIC_API_KEY) {}
 
     const prompt = `

[Survived] BooleanLiteral
src/lib/ai/providers.ts:1787:9
       priority?: 'critical' | 'high' | 'medium' | 'low' | 'none';
     }>
   > {
-    if (!process.env.ANTHROPIC_API_KEY) {
+    if (process.env.ANTHROPIC_API_KEY) {
       return [];
     }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1791:20
       return [];
     }
 
-    const prompt = `
-Extract actionable tasks from the following notes/bullet points. Return JSON array:
-
-"${notes}"
-
-Format:
-[
-  {"name": "Task 1", "description": "optional description", "priority": "medium"},
-  {"name": "Task 2", "priority": "high"}
-]
-Only return valid JSON.
-`;
+    const prompt = ``;
 
     try {

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:1806:20
 
     try {
       const apiKey = process.env.ANTHROPIC_API_KEY;
-      if (!apiKey) {
-        return [];
-      }
+      if (!apiKey) {}
       const response = await fetch(`${this.baseURL}/v1/messages`, {
         method: 'POST',

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:1806:11
 
     try {
       const apiKey = process.env.ANTHROPIC_API_KEY;
-      if (!apiKey) {
+      if (true) {
         return [];
       }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1810:17
         return [];
       }
       const response = await fetch(`${this.baseURL}/v1/messages`, {
-        method: 'POST',
+        method: "",
         headers: {
           'x-api-key': apiKey,

[NoCoverage] LogicalOperator
src/lib/ai/providers.ts:1828:25
       }
 
       const data = await response.json();
-      return JSON.parse(data.content[0]?.text ?? '[]');
+      return JSON.parse(data.content[0]?.text && '[]');
     } catch {
       return [];

[NoCoverage] OptionalChaining
src/lib/ai/providers.ts:1828:25
       }
 
       const data = await response.json();
-      return JSON.parse(data.content[0]?.text ?? '[]');
+      return JSON.parse(data.content[0].text ?? '[]');
     } catch {
       return [];

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:1829:13
 
       const data = await response.json();
       return JSON.parse(data.content[0]?.text ?? '[]');
-    } catch {
-      return [];
-    }
+    } catch {}
   }
 

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:1837:9
   async generateProjectPlan(
     input: ProjectPlanInput
   ): Promise<GeneratedProject> {
-    if (!process.env.ANTHROPIC_API_KEY) {
+    if (true) {
       throw new Error('ANTHROPIC_API_KEY not configured');
     }

[NoCoverage] BooleanLiteral
src/lib/ai/providers.ts:1837:9
   async generateProjectPlan(
     input: ProjectPlanInput
   ): Promise<GeneratedProject> {
-    if (!process.env.ANTHROPIC_API_KEY) {
+    if (process.env.ANTHROPIC_API_KEY) {
       throw new Error('ANTHROPIC_API_KEY not configured');
     }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1838:23
     input: ProjectPlanInput
   ): Promise<GeneratedProject> {
     if (!process.env.ANTHROPIC_API_KEY) {
-      throw new Error('ANTHROPIC_API_KEY not configured');
+      throw new Error("");
     }
 

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:1845:16
 Generate a detailed project plan:
 
 Project Name: ${input.projectName}
-Description: ${input.description || 'No description'}
+Description: ${false}
 Constraints: ${JSON.stringify(input.constraints || {})}
 

[NoCoverage] LogicalOperator
src/lib/ai/providers.ts:1845:16
 Generate a detailed project plan:
 
 Project Name: ${input.projectName}
-Description: ${input.description || 'No description'}
+Description: ${input.description && 'No description'}
 Constraints: ${JSON.stringify(input.constraints || {})}
 

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:1846:31
 
 Project Name: ${input.projectName}
 Description: ${input.description || 'No description'}
-Constraints: ${JSON.stringify(input.constraints || {})}
+Constraints: ${JSON.stringify(false)}
 
 Return JSON with phases and total_duration_days.

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:1846:31
 
 Project Name: ${input.projectName}
 Description: ${input.description || 'No description'}
-Constraints: ${JSON.stringify(input.constraints || {})}
+Constraints: ${JSON.stringify(true)}
 
 Return JSON with phases and total_duration_days.

[NoCoverage] ObjectLiteral
src/lib/ai/providers.ts:1863:30
           'Content-Type': 'application/json',
           'anthropic-version': '2023-06-01',
         },
-        body: JSON.stringify({
-          model: this.model,
-          max_tokens: 1000,
-          messages: [{ role: 'user', content: prompt }],
-        }),
+        body: JSON.stringify({}),
       });
 

[NoCoverage] ObjectLiteral
src/lib/ai/providers.ts:1866:22
         body: JSON.stringify({
           model: this.model,
           max_tokens: 1000,
-          messages: [{ role: 'user', content: prompt }],
+          messages: [{}],
         }),
       });

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1866:30
         body: JSON.stringify({
           model: this.model,
           max_tokens: 1000,
-          messages: [{ role: 'user', content: prompt }],
+          messages: [{ role: "", content: prompt }],
         }),
       });

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:1870:25
         }),
       });
 
-      if (!response.ok) {
-        return new KeywordParser().generateProjectPlan(input);
-      }
+      if (!response.ok) {}
 
       const data = await response.json();

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:1877:13
       const data = await response.json();
       const content = data.content[0]?.text ?? '{}';
       return JSON.parse(content);
-    } catch {
-      return new KeywordParser().generateProjectPlan(input);
-    }
+    } catch {}
   }
 

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:1885:9
   async generateDecisionTemplate(
     context: DecisionContext
   ): Promise<GeneratedDecisionTemplate> {
-    if (!process.env.ANTHROPIC_API_KEY) {
+    if (false) {
       throw new Error('ANTHROPIC_API_KEY not configured');
     }

[NoCoverage] BooleanLiteral
src/lib/ai/providers.ts:1885:9
   async generateDecisionTemplate(
     context: DecisionContext
   ): Promise<GeneratedDecisionTemplate> {
-    if (!process.env.ANTHROPIC_API_KEY) {
+    if (process.env.ANTHROPIC_API_KEY) {
       throw new Error('ANTHROPIC_API_KEY not configured');
     }

[NoCoverage] ConditionalExpression
src/lib/ai/providers.ts:1890:35
     }
 
     const prompt = `
-Generate decision template for: ${context.decisionType || 'general'}
+Generate decision template for: ${false}
 
 Task: ${context.task?.name}

[NoCoverage] LogicalOperator
src/lib/ai/providers.ts:1890:35
     }
 
     const prompt = `
-Generate decision template for: ${context.decisionType || 'general'}
+Generate decision template for: ${context.decisionType && 'general'}
 
 Task: ${context.task?.name}

[NoCoverage] OptionalChaining
src/lib/ai/providers.ts:1892:9
     const prompt = `
 Generate decision template for: ${context.decisionType || 'general'}
 
-Task: ${context.task?.name}
+Task: ${context.task.name}
 
 Return JSON with name, prompt_template, and option_template.

[NoCoverage] ObjectLiteral
src/lib/ai/providers.ts:1902:67
       if (!apiKey) {
         throw new Error('ANTHROPIC_API_KEY is not set');
       }
-      const response = await fetch(`${this.baseURL}/v1/messages`, {
-        method: 'POST',
-        headers: {
-          'x-api-key': apiKey,
-          'Content-Type': 'application/json',
-          'anthropic-version': '2023-06-01',
-        },
-        body: JSON.stringify({
-          model: this.model,
-          max_tokens: 500,
-          messages: [{ role: 'user', content: prompt }],
-        }),
-      });
+      const response = await fetch(`${this.baseURL}/v1/messages`, {});
 
       if (!response.ok) {

[NoCoverage] ObjectLiteral
src/lib/ai/providers.ts:1917:33
       });
 
       if (!response.ok) {
-        const defaultTemplate = {
-          name: 'General Decision Template',
-          prompt_template:
-            'You need to decide on: {task_name}. What are the options?',
-          option_template: '[{"option": "description, pros, cons"}]',
-          provider: this.name,
-        };
+        const defaultTemplate = {};
         return defaultTemplate;
       }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1918:17
 
       if (!response.ok) {
         const defaultTemplate = {
-          name: 'General Decision Template',
+          name: "",
           prompt_template:
             'You need to decide on: {task_name}. What are the options?',

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1920:13
         const defaultTemplate = {
           name: 'General Decision Template',
           prompt_template:
-            'You need to decide on: {task_name}. What are the options?',
+            "",
           option_template: '[{"option": "description, pros, cons"}]',
           provider: this.name,

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:1931:13
       const content = data.content[0]?.text ?? '{}';
       const parsed = JSON.parse(content);
       return { ...parsed, provider: this.name };
-    } catch {
-      return {
-        name: 'General Decision Template',
-        prompt_template:
-          'You need to decide on: {task_name}. What are the options?',
-        option_template: '[{"option": "description, pros, cons"}]',
-        provider: this.name,
-      };
-    }
+    } catch {}
   }
 }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1936:26
         name: 'General Decision Template',
         prompt_template:
           'You need to decide on: {task_name}. What are the options?',
-        option_template: '[{"option": "description, pros, cons"}]',
+        option_template: "",
         provider: this.name,
       };

[Killed] BlockStatement
src/lib/ai/providers.ts:1949:17
 export class AIManager {
   private providers: AIProvider[];
 
-  constructor() {
-    this.providers = [];
-
-    // Add keyword parser as fallback
-    this.providers.push(new KeywordParser());
-
-    // Add AI providers if configured
-    if (process.env.OPENAI_API_KEY) {
-      this.providers.push(new OpenAIProvider());
-    }
-
-    if (process.env.ANTHROPIC_API_KEY) {
-      this.providers.push(new ClaudeProvider());
-    }
-  }
+  constructor() {}
 
   async parseTask(
killedBy: Providers Comprehensive Coverage AIManager - parseTask should parse task and cache keyword parser result
statusReason: this.providers is not iterable

[Killed] ConditionalExpression
src/lib/ai/providers.ts:1956:9
     this.providers.push(new KeywordParser());
 
     // Add AI providers if configured
-    if (process.env.OPENAI_API_KEY) {
+    if (false) {
       this.providers.push(new OpenAIProvider());
     }
killedBy: AI Providers - Full Coverage AIManager - Provider Selection should use OpenAI when configured
statusReason: expected 1 to be greater than 1

[Killed] BlockStatement
src/lib/ai/providers.ts:1956:37
     this.providers.push(new KeywordParser());
 
     // Add AI providers if configured
-    if (process.env.OPENAI_API_KEY) {
-      this.providers.push(new OpenAIProvider());
-    }
+    if (process.env.OPENAI_API_KEY) {}
 
     if (process.env.ANTHROPIC_API_KEY) {
killedBy: AI Providers - Full Coverage AIManager - Provider Selection should use OpenAI when configured
statusReason: expected 1 to be greater than 1

[Killed] BlockStatement
src/lib/ai/providers.ts:1960:40
       this.providers.push(new OpenAIProvider());
     }
 
-    if (process.env.ANTHROPIC_API_KEY) {
-      this.providers.push(new ClaudeProvider());
-    }
+    if (process.env.ANTHROPIC_API_KEY) {}
   }
 
killedBy: AI Providers - Full Coverage AIManager - Provider Selection should use both when both configured
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:1960:9
       this.providers.push(new OpenAIProvider());
     }
 
-    if (process.env.ANTHROPIC_API_KEY) {
+    if (true) {
       this.providers.push(new ClaudeProvider());
     }
killedBy: Providers Comprehensive Coverage AIManager - generateInsights should generate insights using keyword parser when no AI providers
statusReason: expected 'claude-sonnet' to be 'keyword-parser' // Object.is equality

[Killed] StringLiteral
src/lib/ai/providers.ts:1969:22
     input: AITaskInput
   ): Promise<TaskSuggestion & { provider: string }> {
     // Check cache first (only for keyword parser to avoid stale AI results)
-    const cacheKey = `parse:${input.text}`;
+    const cacheKey = ``;
     const cachedResult = aiCache.get<TaskSuggestion & { provider: string }>(
       cacheKey
killedBy: AI Module parseTaskInput should detect critical priority
statusReason: expected 'none' to be 'critical' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:1973:9
     const cachedResult = aiCache.get<TaskSuggestion & { provider: string }>(
       cacheKey
     );
-    if (cachedResult) {
+    if (true) {
       return cachedResult;
     }
killedBy: AI Module parseTaskInput should parse basic task input
statusReason: Cannot read properties of null (reading 'name')

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1973:9
     const cachedResult = aiCache.get<TaskSuggestion & { provider: string }>(
       cacheKey
     );
-    if (cachedResult) {
+    if (false) {
       return cachedResult;
     }

[Survived] BlockStatement
src/lib/ai/providers.ts:1977:44
       return cachedResult;
     }
 
-    for (const provider of this.providers) {
-      try {
-        const result = await provider.parseTask(input);
-        const resultWithProvider = { ...result, provider: provider.name };
-
-        // Cache keyword parser results
-        if (provider.name === 'keyword-parser') {
-          aiCache.set(cacheKey, resultWithProvider);
-        }
-
-        return resultWithProvider;
-      } catch (error) {
-        logWarn(`${provider.name} failed, trying next provider`, {
-          error: error instanceof Error ? error.message : String(error),
-        });
-        continue;
-      }
-    }
+    for (const provider of this.providers) {}
 
     // Fallback to keyword parser (should never fail)

[Survived] BlockStatement
src/lib/ai/providers.ts:1978:11
     }
 
     for (const provider of this.providers) {
-      try {
-        const result = await provider.parseTask(input);
-        const resultWithProvider = { ...result, provider: provider.name };
-
-        // Cache keyword parser results
-        if (provider.name === 'keyword-parser') {
-          aiCache.set(cacheKey, resultWithProvider);
-        }
-
-        return resultWithProvider;
-      } catch (error) {
+      try {} catch (error) {
         logWarn(`${provider.name} failed, trying next provider`, {
           error: error instanceof Error ? error.message : String(error),

[Killed] ObjectLiteral
src/lib/ai/providers.ts:1980:36
     for (const provider of this.providers) {
       try {
         const result = await provider.parseTask(input);
-        const resultWithProvider = { ...result, provider: provider.name };
+        const resultWithProvider = {};
 
         // Cache keyword parser results
killedBy: AI Index Module - Comprehensive Tests parseTaskInput should parse task with keyword parser fallback
statusReason: expected undefined to be defined

[Survived] EqualityOperator
src/lib/ai/providers.ts:1983:13
         const resultWithProvider = { ...result, provider: provider.name };
 
         // Cache keyword parser results
-        if (provider.name === 'keyword-parser') {
+        if (provider.name !== 'keyword-parser') {
           aiCache.set(cacheKey, resultWithProvider);
         }

[Survived] ConditionalExpression
src/lib/ai/providers.ts:1983:13
         const resultWithProvider = { ...result, provider: provider.name };
 
         // Cache keyword parser results
-        if (provider.name === 'keyword-parser') {
+        if (false) {
           aiCache.set(cacheKey, resultWithProvider);
         }

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:1988:23
         }
 
         return resultWithProvider;
-      } catch (error) {
-        logWarn(`${provider.name} failed, trying next provider`, {
-          error: error instanceof Error ? error.message : String(error),
-        });
-        continue;
-      }
+      } catch (error) {}
     }
 

[NoCoverage] ObjectLiteral
src/lib/ai/providers.ts:1989:66
 
         return resultWithProvider;
       } catch (error) {
-        logWarn(`${provider.name} failed, trying next provider`, {
-          error: error instanceof Error ? error.message : String(error),
-        });
+        logWarn(`${provider.name} failed, trying next provider`, {});
         continue;
       }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:1998:35
 
     // Fallback to keyword parser (should never fail)
     const result = await new KeywordParser().parseTask(input);
-    return { ...result, provider: 'keyword-parser' };
+    return { ...result, provider: "" };
   }
 

[Killed] BlockStatement
src/lib/ai/providers.ts:2014:6
     suggestions: string[];
     trends: string[];
     provider: string;
-  }> {
-    // Use the first AI provider, fallback to keyword parser
-    for (const provider of this.providers) {
-      if (provider.name !== 'keyword-parser') {
-        try {
-          const result = await provider.generateInsights(tasks);
-          return { ...result, provider: provider.name };
-        } catch (error) {
-          logWarn(`${provider.name} insights failed`, {
-            error: error instanceof Error ? error.message : String(error),
-          });
-        }
-      }
-    }
-
-    const result = await new KeywordParser().generateInsights(tasks);
-    return { ...result, provider: 'keyword-parser' };
-  }
+  }> {}
 
   async generateTasksFromNotes(
killedBy: AI Index Module - Comprehensive Tests generateTaskInsights should return productivity tips
statusReason: Cannot read properties of undefined (reading 'tips')

[Killed] BlockStatement
src/lib/ai/providers.ts:2016:44
     provider: string;
   }> {
     // Use the first AI provider, fallback to keyword parser
-    for (const provider of this.providers) {
-      if (provider.name !== 'keyword-parser') {
-        try {
-          const result = await provider.generateInsights(tasks);
-          return { ...result, provider: provider.name };
-        } catch (error) {
-          logWarn(`${provider.name} insights failed`, {
-            error: error instanceof Error ? error.message : String(error),
-          });
-        }
-      }
-    }
+    for (const provider of this.providers) {}
 
     const result = await new KeywordParser().generateInsights(tasks);
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateInsights returning successfully
statusReason: expected 'keyword-parser' to be 'mock-insights-success' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2017:11
   }> {
     // Use the first AI provider, fallback to keyword parser
     for (const provider of this.providers) {
-      if (provider.name !== 'keyword-parser') {
+      if (false) {
         try {
           const result = await provider.generateInsights(tasks);
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateInsights returning successfully
statusReason: expected 'keyword-parser' to be 'mock-insights-success' // Object.is equality
