[Killed] EqualityOperator
src/lib/ai/providers.ts:2017:11
   }> {
     // Use the first AI provider, fallback to keyword parser
     for (const provider of this.providers) {
-      if (provider.name !== 'keyword-parser') {
+      if (provider.name === 'keyword-parser') {
         try {
           const result = await provider.generateInsights(tasks);
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateInsights returning successfully
statusReason: expected 'keyword-parser' to be 'mock-insights-success' // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:2018:13
     // Use the first AI provider, fallback to keyword parser
     for (const provider of this.providers) {
       if (provider.name !== 'keyword-parser') {
-        try {
-          const result = await provider.generateInsights(tasks);
-          return { ...result, provider: provider.name };
-        } catch (error) {
+        try {} catch (error) {
           logWarn(`${provider.name} insights failed`, {
             error: error instanceof Error ? error.message : String(error),
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateInsights returning successfully
statusReason: expected 'keyword-parser' to be 'mock-insights-success' // Object.is equality

[Survived] BlockStatement
src/lib/ai/providers.ts:2021:25
         try {
           const result = await provider.generateInsights(tasks);
           return { ...result, provider: provider.name };
-        } catch (error) {
-          logWarn(`${provider.name} insights failed`, {
-            error: error instanceof Error ? error.message : String(error),
-          });
-        }
+        } catch (error) {}
       }
     }

[Survived] ObjectLiteral
src/lib/ai/providers.ts:2022:55
           const result = await provider.generateInsights(tasks);
           return { ...result, provider: provider.name };
         } catch (error) {
-          logWarn(`${provider.name} insights failed`, {
-            error: error instanceof Error ? error.message : String(error),
-          });
+          logWarn(`${provider.name} insights failed`, {});
         }
       }

[Killed] BlockStatement
src/lib/ai/providers.ts:2040:44
     }
   ): Promise<Array<TaskSuggestion & { provider: string }>> {
     // Try AI providers first (skip keyword-parser since we want to use it as fallback)
-    for (const provider of this.providers) {
-      if (
-        provider.name !== 'keyword-parser' &&
-        provider.generateTasksFromNotes
-      ) {
-        try {
-          const result = await provider.generateTasksFromNotes?.(
-            notes,
-            context
-          );
-          if (result && result.length > 0) {
-            return result.map((task: TaskSuggestion) => ({
-              ...task,
-              provider: provider.name,
-            }));
-          }
-        } catch (error) {
-          logWarn(
-            `${provider.name} notes generation failed, trying next provider`,
-            { error: error instanceof Error ? error.message : String(error) }
-          );
-        }
-      }
-    }
+    for (const provider of this.providers) {}
 
     // Fallback to keyword parser
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateTasksFromNotes returning non-empty results
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2042:9
     // Try AI providers first (skip keyword-parser since we want to use it as fallback)
     for (const provider of this.providers) {
       if (
-        provider.name !== 'keyword-parser' &&
-        provider.generateTasksFromNotes
+        true
       ) {
         try {
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateTasksFromNotes returning non-empty results
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2042:9
     // Try AI providers first (skip keyword-parser since we want to use it as fallback)
     for (const provider of this.providers) {
       if (
-        provider.name !== 'keyword-parser' &&
+        true &&
         provider.generateTasksFromNotes
       ) {
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateTasksFromNotes returning non-empty results
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:2044:9
       if (
         provider.name !== 'keyword-parser' &&
         provider.generateTasksFromNotes
-      ) {
-        try {
-          const result = await provider.generateTasksFromNotes?.(
-            notes,
-            context
-          );
-          if (result && result.length > 0) {
-            return result.map((task: TaskSuggestion) => ({
-              ...task,
-              provider: provider.name,
-            }));
-          }
-        } catch (error) {
-          logWarn(
-            `${provider.name} notes generation failed, trying next provider`,
-            { error: error instanceof Error ? error.message : String(error) }
-          );
-        }
-      }
+      ) {}
     }
 
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateTasksFromNotes returning non-empty results
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:2045:13
         provider.name !== 'keyword-parser' &&
         provider.generateTasksFromNotes
       ) {
-        try {
-          const result = await provider.generateTasksFromNotes?.(
-            notes,
-            context
-          );
-          if (result && result.length > 0) {
-            return result.map((task: TaskSuggestion) => ({
-              ...task,
-              provider: provider.name,
-            }));
-          }
-        } catch (error) {
+        try {} catch (error) {
           logWarn(
             `${provider.name} notes generation failed, trying next provider`,
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateTasksFromNotes returning non-empty results
statusReason: expected 1 to be 2 // Object.is equality

[Survived] OptionalChaining
src/lib/ai/providers.ts:2046:32
         provider.generateTasksFromNotes
       ) {
         try {
-          const result = await provider.generateTasksFromNotes?.(
-            notes,
-            context
-          );
+          const result = await provider.generateTasksFromNotes(notes, context);
           if (result && result.length > 0) {
             return result.map((task: TaskSuggestion) => ({

[Killed] EqualityOperator
src/lib/ai/providers.ts:2050:25
             notes,
             context
           );
-          if (result && result.length > 0) {
+          if (result && result.length >= 0) {
             return result.map((task: TaskSuggestion) => ({
               ...task,
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateTasksFromNotes returning empty array
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:2050:44
             notes,
             context
           );
-          if (result && result.length > 0) {
-            return result.map((task: TaskSuggestion) => ({
-              ...task,
-              provider: provider.name,
-            }));
-          }
+          if (result && result.length > 0) {}
         } catch (error) {
           logWarn(
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateTasksFromNotes returning non-empty results
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
src/lib/ai/providers.ts:2051:31
             context
           );
           if (result && result.length > 0) {
-            return result.map((task: TaskSuggestion) => ({
-              ...task,
-              provider: provider.name,
-            }));
+            return result.map(() => undefined);
           }
         } catch (error) {
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should handle AI generateTasksFromNotes returning non-empty results
statusReason: Cannot read properties of undefined (reading 'provider')

[Survived] BlockStatement
src/lib/ai/providers.ts:2056:25
               provider: provider.name,
             }));
           }
-        } catch (error) {
-          logWarn(
-            `${provider.name} notes generation failed, trying next provider`,
-            { error: error instanceof Error ? error.message : String(error) }
-          );
-        }
+        } catch (error) {}
       }
     }

[Survived] StringLiteral
src/lib/ai/providers.ts:2058:13
           }
         } catch (error) {
           logWarn(
-            `${provider.name} notes generation failed, trying next provider`,
+            ``,
             { error: error instanceof Error ? error.message : String(error) }
           );

[Survived] ObjectLiteral
src/lib/ai/providers.ts:2059:13
         } catch (error) {
           logWarn(
             `${provider.name} notes generation failed, trying next provider`,
-            { error: error instanceof Error ? error.message : String(error) }
+            {}
           );
         }

[Killed] ArrowFunction
src/lib/ai/providers.ts:2068:23
     // Fallback to keyword parser
     const parser = new KeywordParser();
     const result = await parser.generateTasksFromNotes(notes);
-    return result.map(task => ({
-      ...task,
-      provider: 'keyword-parser',
-    }));
+    return result.map(() => undefined);
   }
 
killedBy: Providers Comprehensive Coverage AIManager - generateTasksFromNotes should generate tasks from notes using keyword parser fallback
statusReason: Cannot read properties of undefined (reading 'provider')

[Killed] BlockStatement
src/lib/ai/providers.ts:2079:55
    */
   async generateProjectPlan(
     input: ProjectPlanInput
-  ): Promise<GeneratedProject & { provider: string }> {
-    // Try providers that support project planning (keyword parser always has it)
-    for (const provider of this.providers) {
-      if (provider.generateProjectPlan) {
-        try {
-          const result = await provider.generateProjectPlan?.(input);
-          if (result) {
-            return { ...result, provider: provider.name };
-          }
-        } catch (error) {
-          logWarn(`${provider.name} project plan generation failed`, {
-            error: error instanceof Error ? error.message : String(error),
-          });
-        }
-      }
-    }
-
-    // Fallback to keyword parser (should never fail)
-    const parser = new KeywordParser();
-    const result = await parser.generateProjectPlan(input);
-    return { ...result, provider: 'keyword-parser' };
-  }
+  ): Promise<GeneratedProject & { provider: string }> {}
 
   /**
killedBy: Providers Comprehensive Coverage AIManager - Error handling paths should handle generateProjectPlan with provider throwing error
statusReason: Cannot read properties of undefined (reading 'name')

[Survived] BlockStatement
src/lib/ai/providers.ts:2081:44
     input: ProjectPlanInput
   ): Promise<GeneratedProject & { provider: string }> {
     // Try providers that support project planning (keyword parser always has it)
-    for (const provider of this.providers) {
-      if (provider.generateProjectPlan) {
-        try {
-          const result = await provider.generateProjectPlan?.(input);
-          if (result) {
-            return { ...result, provider: provider.name };
-          }
-        } catch (error) {
-          logWarn(`${provider.name} project plan generation failed`, {
-            error: error instanceof Error ? error.message : String(error),
-          });
-        }
-      }
-    }
+    for (const provider of this.providers) {}
 
     // Fallback to keyword parser (should never fail)

[Survived] ConditionalExpression
src/lib/ai/providers.ts:2082:11
   ): Promise<GeneratedProject & { provider: string }> {
     // Try providers that support project planning (keyword parser always has it)
     for (const provider of this.providers) {
-      if (provider.generateProjectPlan) {
+      if (true) {
         try {
           const result = await provider.generateProjectPlan?.(input);

[Survived] BlockStatement
src/lib/ai/providers.ts:2082:41
   ): Promise<GeneratedProject & { provider: string }> {
     // Try providers that support project planning (keyword parser always has it)
     for (const provider of this.providers) {
-      if (provider.generateProjectPlan) {
-        try {
-          const result = await provider.generateProjectPlan?.(input);
-          if (result) {
-            return { ...result, provider: provider.name };
-          }
-        } catch (error) {
-          logWarn(`${provider.name} project plan generation failed`, {
-            error: error instanceof Error ? error.message : String(error),
-          });
-        }
-      }
+      if (provider.generateProjectPlan) {}
     }
 

[Survived] BlockStatement
src/lib/ai/providers.ts:2083:13
     // Try providers that support project planning (keyword parser always has it)
     for (const provider of this.providers) {
       if (provider.generateProjectPlan) {
-        try {
-          const result = await provider.generateProjectPlan?.(input);
-          if (result) {
-            return { ...result, provider: provider.name };
-          }
-        } catch (error) {
+        try {} catch (error) {
           logWarn(`${provider.name} project plan generation failed`, {
             error: error instanceof Error ? error.message : String(error),

[Survived] OptionalChaining
src/lib/ai/providers.ts:2084:32
     for (const provider of this.providers) {
       if (provider.generateProjectPlan) {
         try {
-          const result = await provider.generateProjectPlan?.(input);
+          const result = await provider.generateProjectPlan(input);
           if (result) {
             return { ...result, provider: provider.name };

[Survived] ConditionalExpression
src/lib/ai/providers.ts:2085:15
       if (provider.generateProjectPlan) {
         try {
           const result = await provider.generateProjectPlan?.(input);
-          if (result) {
+          if (true) {
             return { ...result, provider: provider.name };
           }

[Survived] BlockStatement
src/lib/ai/providers.ts:2085:23
       if (provider.generateProjectPlan) {
         try {
           const result = await provider.generateProjectPlan?.(input);
-          if (result) {
-            return { ...result, provider: provider.name };
-          }
+          if (result) {}
         } catch (error) {
           logWarn(`${provider.name} project plan generation failed`, {

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:2088:25
           if (result) {
             return { ...result, provider: provider.name };
           }
-        } catch (error) {
-          logWarn(`${provider.name} project plan generation failed`, {
-            error: error instanceof Error ? error.message : String(error),
-          });
-        }
+        } catch (error) {}
       }
     }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:2089:19
             return { ...result, provider: provider.name };
           }
         } catch (error) {
-          logWarn(`${provider.name} project plan generation failed`, {
+          logWarn(``, {
             error: error instanceof Error ? error.message : String(error),
           });

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:2099:35
     // Fallback to keyword parser (should never fail)
     const parser = new KeywordParser();
     const result = await parser.generateProjectPlan(input);
-    return { ...result, provider: 'keyword-parser' };
+    return { ...result, provider: "" };
   }
 

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:2112:6
     name: string;
     prompt_template: string;
     option_template?: string;
-  }> {
-    // Try keyword parser first (always available)
-    const parser = new KeywordParser();
-    try {
-      return await parser.generateDecisionTemplate(context);
-    } catch (error) {
-      logWarn('Decision template generation failed', {
-        error: error instanceof Error ? error.message : String(error),
-      });
-      // Return a default template
-      return {
-        name: 'General Decision Template',
-        prompt_template:
-          'You need to make a decision about: {task_name}. What are the options, pros, and cons of each?',
-        option_template: '[{{ "option1": "Description, pros, cons" }}]',
-      };
-    }
-  }
+  }> {}
 
   /**

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:2115:9
   }> {
     // Try keyword parser first (always available)
     const parser = new KeywordParser();
-    try {
-      return await parser.generateDecisionTemplate(context);
-    } catch (error) {
+    try {} catch (error) {
       logWarn('Decision template generation failed', {
         error: error instanceof Error ? error.message : String(error),

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:2117:21
     const parser = new KeywordParser();
     try {
       return await parser.generateDecisionTemplate(context);
-    } catch (error) {
-      logWarn('Decision template generation failed', {
-        error: error instanceof Error ? error.message : String(error),
-      });
-      // Return a default template
-      return {
-        name: 'General Decision Template',
-        prompt_template:
-          'You need to make a decision about: {task_name}. What are the options, pros, and cons of each?',
-        option_template: '[{{ "option1": "Description, pros, cons" }}]',
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/lib/ai/providers.ts:2118:54
     try {
       return await parser.generateDecisionTemplate(context);
     } catch (error) {
-      logWarn('Decision template generation failed', {
-        error: error instanceof Error ? error.message : String(error),
-      });
+      logWarn('Decision template generation failed', {});
       // Return a default template
       return {

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:2118:15
     try {
       return await parser.generateDecisionTemplate(context);
     } catch (error) {
-      logWarn('Decision template generation failed', {
+      logWarn("", {
         error: error instanceof Error ? error.message : String(error),
       });

[NoCoverage] ObjectLiteral
src/lib/ai/providers.ts:2122:14
         error: error instanceof Error ? error.message : String(error),
       });
       // Return a default template
-      return {
-        name: 'General Decision Template',
-        prompt_template:
-          'You need to make a decision about: {task_name}. What are the options, pros, and cons of each?',
-        option_template: '[{{ "option1": "Description, pros, cons" }}]',
-      };
+      return {};
     }
   }

[NoCoverage] StringLiteral
src/lib/ai/providers.ts:2126:26
         name: 'General Decision Template',
         prompt_template:
           'You need to make a decision about: {task_name}. What are the options, pros, and cons of each?',
-        option_template: '[{{ "option1": "Description, pros, cons" }}]',
+        option_template: "",
       };
     }

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:2141:6
     estimated_duration: number;
     confidence: number;
     factors: string[];
-  }> {
-    const provider = this.providers[0]; // Use keyword parser by default
-    if (typeof provider.predictTaskDuration === 'function') {
-      return provider.predictTaskDuration(task, context);
-    }
-    // Fallback
-    return {
-      estimated_duration: 45,
-      confidence: 0.6,
-      factors: ['default'],
-    };
-  }
+  }> {}
 
   clearCache(): void {

[NoCoverage] EqualityOperator
src/lib/ai/providers.ts:2143:9
     factors: string[];
   }> {
     const provider = this.providers[0]; // Use keyword parser by default
-    if (typeof provider.predictTaskDuration === 'function') {
+    if (typeof provider.predictTaskDuration !== 'function') {
       return provider.predictTaskDuration(task, context);
     }

[NoCoverage] BlockStatement
src/lib/ai/providers.ts:2143:61
     factors: string[];
   }> {
     const provider = this.providers[0]; // Use keyword parser by default
-    if (typeof provider.predictTaskDuration === 'function') {
-      return provider.predictTaskDuration(task, context);
-    }
+    if (typeof provider.predictTaskDuration === 'function') {}
     // Fallback
     return {

[Killed] BlockStatement
src/lib/ai/providers.ts:2154:22
     };
   }
 
-  clearCache(): void {
-    aiCache.clear();
-  }
+  clearCache(): void {}
 
   /**
killedBy: Providers Comprehensive Coverage AIManager - clearCache should clear the AI cache
statusReason: expected { Object (name, priority, ...) } to be null

[Killed] BlockStatement
src/lib/ai/providers.ts:2176:23
     const cachedResult = aiCache.get<AIEditCommand & { provider: string }>(
       cacheKey
     );
-    if (cachedResult) {
-      return cachedResult;
-    }
+    if (cachedResult) {}
 
     // Check for simple keyword patterns first
killedBy: Providers Comprehensive Coverage parseEditCommand Cache Hit should return cached result when available for edit command
statusReason: expected 'edit' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2182:9
 
     // Check for simple keyword patterns first
     const simpleResult = this.trySimpleEditCommand(text, context);
-    if (simpleResult) {
+    if (true) {
       aiCache.set(cacheKey, { ...simpleResult, provider: 'keyword-parser' });
       return { ...simpleResult, provider: 'keyword-parser' };
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return edit command for unrecognized input
statusReason: expected undefined to be 'edit' // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:2182:23
 
     // Check for simple keyword patterns first
     const simpleResult = this.trySimpleEditCommand(text, context);
-    if (simpleResult) {
-      aiCache.set(cacheKey, { ...simpleResult, provider: 'keyword-parser' });
-      return { ...simpleResult, provider: 'keyword-parser' };
-    }
+    if (simpleResult) {}
 
     // Try AI providers
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse complete command with task name
statusReason: expected 'edit' to be 'complete' // Object.is equality

[Survived] ObjectLiteral
src/lib/ai/providers.ts:2183:29
     // Check for simple keyword patterns first
     const simpleResult = this.trySimpleEditCommand(text, context);
     if (simpleResult) {
-      aiCache.set(cacheKey, { ...simpleResult, provider: 'keyword-parser' });
+      aiCache.set(cacheKey, {});
       return { ...simpleResult, provider: 'keyword-parser' };
     }

[Killed] BlockStatement
src/lib/ai/providers.ts:2188:44
     }
 
     // Try AI providers
-    for (const provider of this.providers) {
-      try {
-        if (provider.name !== 'keyword-parser' && provider.parseEditCommand) {
-          const result = await provider.parseEditCommand?.(text, context);
-          if (result) {
-            return { ...result, provider: provider.name };
-          }
-        }
-      } catch (error) {
-        logWarn(`${provider.name} edit command failed`, {
-          error: error instanceof Error ? error.message : String(error),
-        });
-        continue;
-      }
-    }
+    for (const provider of this.providers) {}
 
     // Fallback: return a safe command that won't modify anything
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return AI provider result for parseEditCommand
statusReason: expected 'edit' to be 'complete' // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:2189:11
 
     // Try AI providers
     for (const provider of this.providers) {
-      try {
-        if (provider.name !== 'keyword-parser' && provider.parseEditCommand) {
-          const result = await provider.parseEditCommand?.(text, context);
-          if (result) {
-            return { ...result, provider: provider.name };
-          }
-        }
-      } catch (error) {
+      try {} catch (error) {
         logWarn(`${provider.name} edit command failed`, {
           error: error instanceof Error ? error.message : String(error),
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return AI provider result for parseEditCommand
statusReason: expected 'edit' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2190:13
     // Try AI providers
     for (const provider of this.providers) {
       try {
-        if (provider.name !== 'keyword-parser' && provider.parseEditCommand) {
+        if (false) {
           const result = await provider.parseEditCommand?.(text, context);
           if (result) {
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return AI provider result for parseEditCommand
statusReason: expected 'edit' to be 'complete' // Object.is equality

[Killed] EqualityOperator
src/lib/ai/providers.ts:2190:13
     // Try AI providers
     for (const provider of this.providers) {
       try {
-        if (provider.name !== 'keyword-parser' && provider.parseEditCommand) {
+        if (provider.name === 'keyword-parser' && provider.parseEditCommand) {
           const result = await provider.parseEditCommand?.(text, context);
           if (result) {
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return AI provider result for parseEditCommand
statusReason: expected 'edit' to be 'complete' // Object.is equality

[Survived] OptionalChaining
src/lib/ai/providers.ts:2191:32
     for (const provider of this.providers) {
       try {
         if (provider.name !== 'keyword-parser' && provider.parseEditCommand) {
-          const result = await provider.parseEditCommand?.(text, context);
+          const result = await provider.parseEditCommand(text, context);
           if (result) {
             return { ...result, provider: provider.name };

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2192:15
       try {
         if (provider.name !== 'keyword-parser' && provider.parseEditCommand) {
           const result = await provider.parseEditCommand?.(text, context);
-          if (result) {
+          if (false) {
             return { ...result, provider: provider.name };
           }
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return AI provider result for parseEditCommand
statusReason: expected 'edit' to be 'complete' // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:2192:23
       try {
         if (provider.name !== 'keyword-parser' && provider.parseEditCommand) {
           const result = await provider.parseEditCommand?.(text, context);
-          if (result) {
-            return { ...result, provider: provider.name };
-          }
+          if (result) {}
         }
       } catch (error) {
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return AI provider result for parseEditCommand
statusReason: expected 'edit' to be 'complete' // Object.is equality

[Survived] BlockStatement
src/lib/ai/providers.ts:2196:23
             return { ...result, provider: provider.name };
           }
         }
-      } catch (error) {
-        logWarn(`${provider.name} edit command failed`, {
-          error: error instanceof Error ? error.message : String(error),
-        });
-        continue;
-      }
+      } catch (error) {}
     }
 

[Killed] ObjectLiteral
src/lib/ai/providers.ts:2205:12
     }
 
     // Fallback: return a safe command that won't modify anything
-    return { action: 'edit' as const, provider: 'keyword-parser' };
+    return {};
   }
 
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return edit command for unrecognized input
statusReason: expected undefined to be 'edit' // Object.is equality

[Survived] Regex
src/lib/ai/providers.ts:2224:7
   ): AIEditCommand | null {
     // Pattern: "complete/mark done [task name]" or "mark [task] as complete"
     const completeMatch = text.match(
-      /(?:complete|mark\s+(?:as\s+)?done|finish|done)[:\s]+(.+?)(?:\s*$|\s*[.!?])/i
+      /(?:complete|mark\s+(?:as\S+)?done|finish|done)[:\s]+(.+?)(?:\s*$|\s*[.!?])/i
     );
     if (completeMatch) {

[Survived] Regex
src/lib/ai/providers.ts:2224:7
   ): AIEditCommand | null {
     // Pattern: "complete/mark done [task name]" or "mark [task] as complete"
     const completeMatch = text.match(
-      /(?:complete|mark\s+(?:as\s+)?done|finish|done)[:\s]+(.+?)(?:\s*$|\s*[.!?])/i
+      /(?:complete|mark\s+(?:as\s+)?done|finish|done)[:\s]+(.+?)(?:\s*$|\s[.!?])/i
     );
     if (completeMatch) {

[Killed] BlockStatement
src/lib/ai/providers.ts:2226:24
     const completeMatch = text.match(
       /(?:complete|mark\s+(?:as\s+)?done|finish|done)[:\s]+(.+?)(?:\s*$|\s*[.!?])/i
     );
-    if (completeMatch) {
-      const taskName = completeMatch[1].trim();
-      const task = context.tasks.find(t =>
-        t.name.toLowerCase().includes(taskName.toLowerCase())
-      );
-      if (task) {
-        return { action: 'complete', taskId: task.id };
-      }
-    }
+    if (completeMatch) {}
 
     // Pattern: "delete/remove [task name]"
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse complete command with task name
statusReason: expected 'edit' to be 'complete' // Object.is equality
