[Killed] BlockStatement
src/lib/ai/providers.ts:2326:19
       );
       if (task) {
         const date = this.parseNaturalDate(timeRef);
-        if (date) {
-          return { action: 'schedule', taskId: task.id, updates: { date } };
-        }
+        if (date) {}
       }
     }
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse move task to list command (not schedule)
statusReason: expected 'edit' to be 'schedule' // Object.is equality

[Killed] StringLiteral
src/lib/ai/providers.ts:2327:28
       if (task) {
         const date = this.parseNaturalDate(timeRef);
         if (date) {
-          return { action: 'schedule', taskId: task.id, updates: { date } };
+          return { action: "", taskId: task.id, updates: { date } };
         }
       }
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse move task to list command (not schedule)
statusReason: expected '' to be 'schedule' // Object.is equality

[Killed] Regex
src/lib/ai/providers.ts:2333:36
     }
 
     // Pattern: "search for [query]" or "find [query]"
-    const searchMatch = text.match(/(?:search|find)\s+(?:for\s+)?(.+)/i);
+    const searchMatch = text.match(/(?:search|find)\s+(?:for\S+)?(.+)/i);
     if (searchMatch) {
       const query = searchMatch[1].trim();
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse search command
statusReason: expected 'for important tasks' to be 'important tasks' // Object.is equality

[Killed] Regex
src/lib/ai/providers.ts:2333:36
     }
 
     // Pattern: "search for [query]" or "find [query]"
-    const searchMatch = text.match(/(?:search|find)\s+(?:for\s+)?(.+)/i);
+    const searchMatch = text.match(/(?:search|find)\s+(?:for\s+)?(.)/i);
     if (searchMatch) {
       const query = searchMatch[1].trim();
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse search command
statusReason: expected 'i' to be 'important tasks' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2334:9
 
     // Pattern: "search for [query]" or "find [query]"
     const searchMatch = text.match(/(?:search|find)\s+(?:for\s+)?(.+)/i);
-    if (searchMatch) {
+    if (false) {
       const query = searchMatch[1].trim();
       return { action: 'search', searchQuery: query };
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse search command
statusReason: expected 'edit' to be 'search' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2334:9
 
     // Pattern: "search for [query]" or "find [query]"
     const searchMatch = text.match(/(?:search|find)\s+(?:for\s+)?(.+)/i);
-    if (searchMatch) {
+    if (true) {
       const query = searchMatch[1].trim();
       return { action: 'search', searchQuery: query };
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should return edit command for unrecognized input
statusReason: Cannot read properties of null (reading '1')

[Survived] MethodExpression
src/lib/ai/providers.ts:2335:21
     // Pattern: "search for [query]" or "find [query]"
     const searchMatch = text.match(/(?:search|find)\s+(?:for\s+)?(.+)/i);
     if (searchMatch) {
-      const query = searchMatch[1].trim();
+      const query = searchMatch[1];
       return { action: 'search', searchQuery: query };
     }

[Killed] MethodExpression
src/lib/ai/providers.ts:2346:24
    * Parse natural language dates (tomorrow, today, monday, next week, etc.)
    */
   private parseNaturalDate(dateStr: string): string | null {
-    const normalized = dateStr.toLowerCase().trim();
+    const normalized = dateStr.toUpperCase().trim();
     const today = new Date();
 
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse move task to list command (not schedule)
statusReason: expected 'edit' to be 'schedule' // Object.is equality

[Survived] MethodExpression
src/lib/ai/providers.ts:2346:24
    * Parse natural language dates (tomorrow, today, monday, next week, etc.)
    */
   private parseNaturalDate(dateStr: string): string | null {
-    const normalized = dateStr.toLowerCase().trim();
+    const normalized = dateStr.toLowerCase();
     const today = new Date();
 

[Killed] EqualityOperator
src/lib/ai/providers.ts:2349:9
     const normalized = dateStr.toLowerCase().trim();
     const today = new Date();
 
-    if (normalized === 'today') {
+    if (normalized !== 'today') {
       return today.toISOString().split('T')[0];
     }
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should handle schedule match when date parse fails
statusReason: expected 'schedule' to be 'edit' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2349:9
     const normalized = dateStr.toLowerCase().trim();
     const today = new Date();
 
-    if (normalized === 'today') {
+    if (true) {
       return today.toISOString().split('T')[0];
     }
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should handle schedule match when date parse fails
statusReason: expected 'schedule' to be 'edit' // Object.is equality

[Killed] EqualityOperator
src/lib/ai/providers.ts:2353:9
       return today.toISOString().split('T')[0];
     }
 
-    if (normalized === 'tomorrow') {
+    if (normalized !== 'tomorrow') {
       const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
       return tomorrow.toISOString().split('T')[0];
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse move task to list command (not schedule)
statusReason: expected 'edit' to be 'schedule' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2353:9
       return today.toISOString().split('T')[0];
     }
 
-    if (normalized === 'tomorrow') {
+    if (false) {
       const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
       return tomorrow.toISOString().split('T')[0];
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse move task to list command (not schedule)
statusReason: expected 'edit' to be 'schedule' // Object.is equality

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2354:51
     }
 
     if (normalized === 'tomorrow') {
-      const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
+      const tomorrow = new Date(today.getTime() + 24 / 60 * 60 * 1000);
       return tomorrow.toISOString().split('T')[0];
     }

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2354:51
     }
 
     if (normalized === 'tomorrow') {
-      const tomorrow = new Date(today.getTime() + 24 * 60 * 60 * 1000);
+      const tomorrow = new Date(today.getTime() + 24 * 60 / 60 * 1000);
       return tomorrow.toISOString().split('T')[0];
     }

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2358:9
       return tomorrow.toISOString().split('T')[0];
     }
 
-    if (normalized === 'next week' || normalized === 'weekend') {
+    if (true) {
       const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 60 * 1000);
       return nextWeek.toISOString().split('T')[0];
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should handle schedule match when date parse fails
statusReason: expected 'schedule' to be 'edit' // Object.is equality

[Killed] EqualityOperator
src/lib/ai/providers.ts:2358:9
       return tomorrow.toISOString().split('T')[0];
     }
 
-    if (normalized === 'next week' || normalized === 'weekend') {
+    if (normalized !== 'next week' || normalized === 'weekend') {
       const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 60 * 1000);
       return nextWeek.toISOString().split('T')[0];
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should handle schedule match when date parse fails
statusReason: expected 'schedule' to be 'edit' // Object.is equality

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2359:33
     }
 
     if (normalized === 'next week' || normalized === 'weekend') {
-      const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 60 * 1000);
+      const nextWeek = new Date(today.getTime() - 7 * 24 * 60 * 60 * 1000);
       return nextWeek.toISOString().split('T')[0];
     }

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2359:51
     }
 
     if (normalized === 'next week' || normalized === 'weekend') {
-      const nextWeek = new Date(today.getTime() + 7 * 24 * 60 * 60 * 1000);
+      const nextWeek = new Date(today.getTime() + 7 * 24 * 60 / 60 * 1000);
       return nextWeek.toISOString().split('T')[0];
     }

[Killed] ObjectLiteral
src/lib/ai/providers.ts:2363:44
       return nextWeek.toISOString().split('T')[0];
     }
 
-    const dayMap: Record<string, number> = {
-      sunday: 0,
-      monday: 1,
-      tuesday: 2,
-      wednesday: 3,
-      thursday: 4,
-      friday: 5,
-      saturday: 6,
-    };
+    const dayMap: Record<string, number> = {};
 
     if (dayMap[normalized] !== undefined) {
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse postpone command
statusReason: expected 'edit' to be 'schedule' // Object.is equality

[Killed] BlockStatement
src/lib/ai/providers.ts:2373:43
       saturday: 6,
     };
 
-    if (dayMap[normalized] !== undefined) {
-      const targetDay = dayMap[normalized];
-      const daysUntil = (targetDay - today.getDay() + 7) % 7 || 7;
-      const targetDate = new Date(
-        today.getTime() + daysUntil * 24 * 60 * 60 * 1000
-      );
-      return targetDate.toISOString().split('T')[0];
-    }
+    if (dayMap[normalized] !== undefined) {}
 
     // Try YYYY-MM-DD format
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse postpone command
statusReason: expected 'edit' to be 'schedule' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2373:9
       saturday: 6,
     };
 
-    if (dayMap[normalized] !== undefined) {
+    if (false) {
       const targetDay = dayMap[normalized];
       const daysUntil = (targetDay - today.getDay() + 7) % 7 || 7;
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should parse postpone command
statusReason: expected 'edit' to be 'schedule' // Object.is equality

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2375:26
 
     if (dayMap[normalized] !== undefined) {
       const targetDay = dayMap[normalized];
-      const daysUntil = (targetDay - today.getDay() + 7) % 7 || 7;
+      const daysUntil = (targetDay + today.getDay() + 7) % 7 || 7;
       const targetDate = new Date(
         today.getTime() + daysUntil * 24 * 60 * 60 * 1000

[Survived] ConditionalExpression
src/lib/ai/providers.ts:2375:25
 
     if (dayMap[normalized] !== undefined) {
       const targetDay = dayMap[normalized];
-      const daysUntil = (targetDay - today.getDay() + 7) % 7 || 7;
+      const daysUntil = true;
       const targetDate = new Date(
         today.getTime() + daysUntil * 24 * 60 * 60 * 1000

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2377:27
       const targetDay = dayMap[normalized];
       const daysUntil = (targetDay - today.getDay() + 7) % 7 || 7;
       const targetDate = new Date(
-        today.getTime() + daysUntil * 24 * 60 * 60 * 1000
+        today.getTime() + daysUntil * 24 * 60 * 60 / 1000
       );
       return targetDate.toISOString().split('T')[0];

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2377:27
       const targetDay = dayMap[normalized];
       const daysUntil = (targetDay - today.getDay() + 7) % 7 || 7;
       const targetDate = new Date(
-        today.getTime() + daysUntil * 24 * 60 * 60 * 1000
+        today.getTime() + daysUntil * 24 / 60 * 60 * 1000
       );
       return targetDate.toISOString().split('T')[0];

[Killed] BlockStatement
src/lib/ai/providers.ts:2383:49
     }
 
     // Try YYYY-MM-DD format
-    if (/^\d{4}-\d{2}-\d{2}$/.test(normalized)) {
-      return normalized;
-    }
+    if (/^\d{4}-\d{2}-\d{2}$/.test(normalized)) {}
 
     // "in X days/weeks"
killedBy: Providers Comprehensive Coverage parseNaturalDate should parse YYYY-MM-DD format
statusReason: expected null to be '2024-06-15' // Object.is equality

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2383:9
     }
 
     // Try YYYY-MM-DD format
-    if (/^\d{4}-\d{2}-\d{2}$/.test(normalized)) {
+    if (false) {
       return normalized;
     }
killedBy: Providers Comprehensive Coverage parseNaturalDate should parse YYYY-MM-DD format
statusReason: expected null to be '2024-06-15' // Object.is equality

[Survived] Regex
src/lib/ai/providers.ts:2388:38
     }
 
     // "in X days/weeks"
-    const inMatch = normalized.match(/in\s+(\d+)\s+(day|week|month)/);
+    const inMatch = normalized.match(/in\s+(\d)\s+(day|week|month)/);
     if (inMatch) {
       const num = parseInt(inMatch[1]);

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2389:9
 
     // "in X days/weeks"
     const inMatch = normalized.match(/in\s+(\d+)\s+(day|week|month)/);
-    if (inMatch) {
+    if (true) {
       const num = parseInt(inMatch[1]);
       const unit = inMatch[2];
killedBy: Providers Comprehensive Coverage AIManager - parseEditCommand should handle schedule match when date parse fails
statusReason: Cannot read properties of null (reading '1')

[Survived] ConditionalExpression
src/lib/ai/providers.ts:2389:9
 
     // "in X days/weeks"
     const inMatch = normalized.match(/in\s+(\d+)\s+(day|week|month)/);
-    if (inMatch) {
+    if (false) {
       const num = parseInt(inMatch[1]);
       const unit = inMatch[2];

[Survived] ConditionalExpression
src/lib/ai/providers.ts:2392:47
     if (inMatch) {
       const num = parseInt(inMatch[1]);
       const unit = inMatch[2];
-      const multiplier = unit === 'day' ? 1 : unit === 'week' ? 7 : 30;
+      const multiplier = unit === 'day' ? 1 : true ? 7 : 30;
       const targetDate = new Date(
         today.getTime() + num * multiplier * 24 * 60 * 60 * 1000

[Survived] ConditionalExpression
src/lib/ai/providers.ts:2392:47
     if (inMatch) {
       const num = parseInt(inMatch[1]);
       const unit = inMatch[2];
-      const multiplier = unit === 'day' ? 1 : unit === 'week' ? 7 : 30;
+      const multiplier = unit === 'day' ? 1 : false ? 7 : 30;
       const targetDate = new Date(
         today.getTime() + num * multiplier * 24 * 60 * 60 * 1000

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2394:27
       const unit = inMatch[2];
       const multiplier = unit === 'day' ? 1 : unit === 'week' ? 7 : 30;
       const targetDate = new Date(
-        today.getTime() + num * multiplier * 24 * 60 * 60 * 1000
+        today.getTime() + num / multiplier * 24 * 60 * 60 * 1000
       );
       return targetDate.toISOString().split('T')[0];

[Survived] ArithmeticOperator
src/lib/ai/providers.ts:2394:9
       const unit = inMatch[2];
       const multiplier = unit === 'day' ? 1 : unit === 'week' ? 7 : 30;
       const targetDate = new Date(
-        today.getTime() + num * multiplier * 24 * 60 * 60 * 1000
+        today.getTime() - num * multiplier * 24 * 60 * 60 * 1000
       );
       return targetDate.toISOString().split('T')[0];

[Survived] StringLiteral
src/lib/ai/providers.ts:2396:45
       const targetDate = new Date(
         today.getTime() + num * multiplier * 24 * 60 * 60 * 1000
       );
-      return targetDate.toISOString().split('T')[0];
+      return targetDate.toISOString().split("")[0];
     }
 

[Killed] BlockStatement
src/lib/ai/providers.ts:2406:43
 // Singleton instance
 let aiManager: AIManager | null = null;
 
-export function getAIManager(): AIManager {
-  if (!aiManager) {
-    aiManager = new AIManager();
-  }
-  return aiManager;
-}
+export function getAIManager(): AIManager {}
 
killedBy: AI Index Module - Comprehensive Tests generateTaskInsights should return productivity tips
statusReason: Cannot read properties of undefined (reading 'generateInsights')

[Killed] BooleanLiteral
src/lib/ai/providers.ts:2407:7
 let aiManager: AIManager | null = null;
 
 export function getAIManager(): AIManager {
-  if (!aiManager) {
+  if (aiManager) {
     aiManager = new AIManager();
   }
killedBy: AI Index Module - Comprehensive Tests generateTaskInsights should return productivity tips
statusReason: Cannot read properties of null (reading 'generateInsights')

[Killed] ConditionalExpression
src/lib/ai/providers.ts:2407:7
 let aiManager: AIManager | null = null;
 
 export function getAIManager(): AIManager {
-  if (!aiManager) {
+  if (false) {
     aiManager = new AIManager();
   }
killedBy: AI Index Module - Comprehensive Tests generateTaskInsights should return productivity tips
statusReason: Cannot read properties of null (reading 'generateInsights')
