[Killed] ArithmeticOperator
src/lib/validation.ts:6:33
 /**
  * Maximum request body size (1MB) to prevent DoS attacks
  */
-export const MAX_REQUEST_SIZE = 1024 * 1024;
+export const MAX_REQUEST_SIZE = 1024 / 1024;
 
 /**
killedBy: Validation Constants Constants should have MAX_REQUEST_SIZE defined
statusReason: expected 1 to be 1048576 // Object.is equality

[Killed] BlockStatement
src/lib/validation.ts:24:18
  */
 export function sanitizeString(
   input: string | null | undefined
-): string | null {
-  if (!input) return null;
-
-  let clean = input;
-
-  // Remove script tags with their content first (most dangerous)
-  clean = clean
-    .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '') // Script with content
-    .replace(/<script[^>]*>/gi, '') // Opening script tag
-    .replace(/<\/script>/gi, ''); // Closing script tag
-
-  // Strip all remaining HTML tags
-  clean = clean.replace(/<[^>]+>/g, '');
-
-  // Remove dangerous attributes and protocols
-  clean = clean
-    .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
-    .replace(/on\w+=/gi, '') // Remove unquoted event handlers
-    .replace(/javascript:/gi, '') // Remove javascript: URLs
-    .replace(/vbscript:/gi, '') // Remove vbscript: URLs
-    .replace(/data:text\/html/gi, '') // Remove data:text/html URLs
-    .trim();
-
-  return clean;
-}
+): string | null {}
 
 /**
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should create a task with minimal data
statusReason: expected '' to be 'Test Task' // Object.is equality

[Killed] ConditionalExpression
src/lib/validation.ts:25:7
 export function sanitizeString(
   input: string | null | undefined
 ): string | null {
-  if (!input) return null;
+  if (false) return null;
 
   let clean = input;
killedBy: Task Actions - Comprehensive Tests List Operations deleteList should reassign tasks to inbox when list is deleted
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/lib/validation.ts:25:7
 export function sanitizeString(
   input: string | null | undefined
 ): string | null {
-  if (!input) return null;
+  if (true) return null;
 
   let clean = input;
killedBy: Task Actions - Comprehensive Tests Task Operations createTask should create a task with minimal data
statusReason: expected '' to be 'Test Task' // Object.is equality

[Killed] Regex
src/lib/validation.ts:31:14
 
   // Remove script tags with their content first (most dangerous)
   clean = clean
-    .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '') // Script with content
+    .replace(/<script[^>]>[\s\S]*?<\/script>/gi, '') // Script with content
     .replace(/<script[^>]*>/gi, '') // Opening script tag
     .replace(/<\/script>/gi, ''); // Closing script tag
killedBy: Validation - Comprehensive Coverage sanitizeString should strip HTML tags
statusReason: expected 'alert(\'xss\')Hello' to be 'Hello' // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:31:51
 
   // Remove script tags with their content first (most dangerous)
   clean = clean
-    .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '') // Script with content
+    .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, "Stryker was here!") // Script with content
     .replace(/<script[^>]*>/gi, '') // Opening script tag
     .replace(/<\/script>/gi, ''); // Closing script tag
killedBy: Validation - Comprehensive Coverage sanitizeString should strip HTML tags
statusReason: expected 'Stryker was here!Hello' to be 'Hello' // Object.is equality

[Killed] Regex
src/lib/validation.ts:32:14
   // Remove script tags with their content first (most dangerous)
   clean = clean
     .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '') // Script with content
-    .replace(/<script[^>]*>/gi, '') // Opening script tag
+    .replace(/<script[^>]>/gi, '') // Opening script tag
     .replace(/<\/script>/gi, ''); // Closing script tag
 
killedBy: Validation - Comprehensive Coverage sanitizeString should remove data:text/html URLs
statusReason: expected '">' to be '' // Object.is equality

[Survived] StringLiteral
src/lib/validation.ts:32:33
   // Remove script tags with their content first (most dangerous)
   clean = clean
     .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '') // Script with content
-    .replace(/<script[^>]*>/gi, '') // Opening script tag
+    .replace(/<script[^>]*>/gi, "Stryker was here!") // Opening script tag
     .replace(/<\/script>/gi, ''); // Closing script tag
 

[Survived] StringLiteral
src/lib/validation.ts:33:30
   clean = clean
     .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '') // Script with content
     .replace(/<script[^>]*>/gi, '') // Opening script tag
-    .replace(/<\/script>/gi, ''); // Closing script tag
+    .replace(/<\/script>/gi, "Stryker was here!"); // Closing script tag
 
   // Strip all remaining HTML tags

[Killed] Regex
src/lib/validation.ts:36:25
     .replace(/<\/script>/gi, ''); // Closing script tag
 
   // Strip all remaining HTML tags
-  clean = clean.replace(/<[^>]+>/g, '');
+  clean = clean.replace(/<[^>]>/g, '');
 
   // Remove dangerous attributes and protocols
killedBy: Security Edge Cases XSS Prevention should strip HTML tags but preserve text content
statusReason: expected 'Hello</b>World</i>' to be 'HelloWorld' // Object.is equality

[Killed] Regex
src/lib/validation.ts:36:25
     .replace(/<\/script>/gi, ''); // Closing script tag
 
   // Strip all remaining HTML tags
-  clean = clean.replace(/<[^>]+>/g, '');
+  clean = clean.replace(/<[>]+>/g, '');
 
   // Remove dangerous attributes and protocols
killedBy: Security Edge Cases XSS Prevention should strip HTML tags but preserve text content
statusReason: expected '<b>Hello</b><i>World</i>' to be 'HelloWorld' // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:39:11
   clean = clean.replace(/<[^>]+>/g, '');
 
   // Remove dangerous attributes and protocols
-  clean = clean
-    .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
-    .replace(/on\w+=/gi, '') // Remove unquoted event handlers
-    .replace(/javascript:/gi, '') // Remove javascript: URLs
-    .replace(/vbscript:/gi, '') // Remove vbscript: URLs
-    .replace(/data:text\/html/gi, '') // Remove data:text/html URLs
-    .trim();
+  clean = clean.replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
+.replace(/on\w+=/gi, '') // Remove unquoted event handlers
+.replace(/javascript:/gi, '') // Remove javascript: URLs
+.replace(/vbscript:/gi, '') // Remove vbscript: URLs
+.replace(/data:text\/html/gi, '') // Remove data:text/html URLs;
 
   return clean;
killedBy: Security Edge Cases Null and Undefined Handling should trim whitespace-only strings
statusReason: expected '   ' to be '' // Object.is equality

[Survived] Regex
src/lib/validation.ts:40:14
 
   // Remove dangerous attributes and protocols
   clean = clean
-    .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
+    .replace(/on\w\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
     .replace(/on\w+=/gi, '') // Remove unquoted event handlers
     .replace(/javascript:/gi, '') // Remove javascript: URLs

[Survived] Regex
src/lib/validation.ts:40:14
 
   // Remove dangerous attributes and protocols
   clean = clean
-    .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
+    .replace(/on\w+\s*=\s*["'][^"']*[^"']/gi, '') // Remove event handlers
     .replace(/on\w+=/gi, '') // Remove unquoted event handlers
     .replace(/javascript:/gi, '') // Remove javascript: URLs

[Survived] Regex
src/lib/validation.ts:41:14
   // Remove dangerous attributes and protocols
   clean = clean
     .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
-    .replace(/on\w+=/gi, '') // Remove unquoted event handlers
+    .replace(/on\W+=/gi, '') // Remove unquoted event handlers
     .replace(/javascript:/gi, '') // Remove javascript: URLs
     .replace(/vbscript:/gi, '') // Remove vbscript: URLs

[Survived] StringLiteral
src/lib/validation.ts:41:26
   // Remove dangerous attributes and protocols
   clean = clean
     .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
-    .replace(/on\w+=/gi, '') // Remove unquoted event handlers
+    .replace(/on\w+=/gi, "Stryker was here!") // Remove unquoted event handlers
     .replace(/javascript:/gi, '') // Remove javascript: URLs
     .replace(/vbscript:/gi, '') // Remove vbscript: URLs

[Survived] StringLiteral
src/lib/validation.ts:42:31
   clean = clean
     .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
     .replace(/on\w+=/gi, '') // Remove unquoted event handlers
-    .replace(/javascript:/gi, '') // Remove javascript: URLs
+    .replace(/javascript:/gi, "Stryker was here!") // Remove javascript: URLs
     .replace(/vbscript:/gi, '') // Remove vbscript: URLs
     .replace(/data:text\/html/gi, '') // Remove data:text/html URLs

[Killed] ConditionalExpression
src/lib/validation.ts:56:7
  * Allows basic formatting: b, i, u, strong, em, p, br, ul, ol, li, h1-3, code, pre
  */
 export function sanitizeHtml(input: string | null | undefined): string | null {
-  if (!input) return null;
+  if (true) return null;
 
   let clean = input;
killedBy: Security Edge Cases HTML Sanitization Edge Cases should remove iframe tags
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/lib/validation.ts:56:7
  * Allows basic formatting: b, i, u, strong, em, p, br, ul, ol, li, h1-3, code, pre
  */
 export function sanitizeHtml(input: string | null | undefined): string | null {
-  if (!input) return null;
+  if (false) return null;
 
   let clean = input;
killedBy: Validation - Comprehensive Coverage sanitizeHtml should return null for null/undefined input
statusReason: Cannot read properties of null (reading 'replace')

[Killed] StringLiteral
src/lib/validation.ts:62:51
 
   // Remove script tags with their content first (most dangerous)
   clean = clean
-    .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '')
+    .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, "Stryker was here!")
     .replace(/<script[^>]*>/gi, '')
     .replace(/<\/script>/gi, '');
killedBy: Validation - Comprehensive Coverage sanitizeHtml should remove script tags
statusReason: expected 'Stryker was here!Hello' to be 'Hello' // Object.is equality

[Killed] Regex
src/lib/validation.ts:62:14
 
   // Remove script tags with their content first (most dangerous)
   clean = clean
-    .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '')
+    .replace(/<script[^>]>[\s\S]*?<\/script>/gi, '')
     .replace(/<script[^>]*>/gi, '')
     .replace(/<\/script>/gi, '');
killedBy: Validation - Comprehensive Coverage sanitizeHtml should remove script tags
statusReason: expected 'alert(\'xss\')Hello' to be 'Hello' // Object.is equality

[Survived] StringLiteral
src/lib/validation.ts:63:33
   // Remove script tags with their content first (most dangerous)
   clean = clean
     .replace(/<script[^>]*>[\s\S]*?<\/script>/gi, '')
-    .replace(/<script[^>]*>/gi, '')
+    .replace(/<script[^>]*>/gi, "Stryker was here!")
     .replace(/<\/script>/gi, '');
 

[Killed] Regex
src/lib/validation.ts:68:5
 
   // Strip dangerous tags completely (keeping their content)
   clean = clean.replace(
-    /<\/?(iframe|object|embed|form|input|button|select|textarea)[^>]*>/gi,
+    /<\/?(iframe|object|embed|form|input|button|select|textarea)[^>]>/gi,
     ''
   );
killedBy: Validation - Comprehensive Coverage sanitizeHtml should remove dangerous tags (iframe, object, embed, form, input, button, select, textarea)
statusReason: expected '<iframe src=\'evil\'></iframe><p>Safe…' not to contain 'iframe'

[Survived] StringLiteral
src/lib/validation.ts:69:5
   // Strip dangerous tags completely (keeping their content)
   clean = clean.replace(
     /<\/?(iframe|object|embed|form|input|button|select|textarea)[^>]*>/gi,
-    ''
+    "Stryker was here!"
   );
 

[Survived] Regex
src/lib/validation.ts:74:14
 
   // Remove dangerous attributes and protocols
   clean = clean
-    .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '')
+    .replace(/on\w+\S*=\s*["'][^"']*["']/gi, '')
     .replace(/on\w+=/gi, '')
     .replace(/javascript:/gi, '')

[Survived] Regex
src/lib/validation.ts:74:14
 
   // Remove dangerous attributes and protocols
   clean = clean
-    .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '')
+    .replace(/on\w\s*=\s*["'][^"']*["']/gi, '')
     .replace(/on\w+=/gi, '')
     .replace(/javascript:/gi, '')

[Survived] Regex
src/lib/validation.ts:75:14
   // Remove dangerous attributes and protocols
   clean = clean
     .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '')
-    .replace(/on\w+=/gi, '')
+    .replace(/on\W+=/gi, '')
     .replace(/javascript:/gi, '')
     .replace(/vbscript:/gi, '')

[Survived] StringLiteral
src/lib/validation.ts:76:31
   clean = clean
     .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '')
     .replace(/on\w+=/gi, '')
-    .replace(/javascript:/gi, '')
+    .replace(/javascript:/gi, "Stryker was here!")
     .replace(/vbscript:/gi, '')
     .replace(/data:text\/html/gi, '');

[Survived] StringLiteral
src/lib/validation.ts:78:35
     .replace(/on\w+=/gi, '')
     .replace(/javascript:/gi, '')
     .replace(/vbscript:/gi, '')
-    .replace(/data:text\/html/gi, '');
+    .replace(/data:text\/html/gi, "Stryker was here!");
 
   // Clean up extra whitespace

[Survived] MethodExpression
src/lib/validation.ts:81:11
     .replace(/data:text\/html/gi, '');
 
   // Clean up extra whitespace
-  clean = clean.replace(/\s+/g, ' ').trim();
+  clean = clean.replace(/\s+/g, ' ');
 
   return clean;

[Killed] BlockStatement
src/lib/validation.ts:86:58
   return clean;
 }
 
-export function isValidSortField(field: string): boolean {
-  return [
-    'name',
-    'date',
-    'deadline',
-    'priority',
-    'created_at',
-    'updated_at',
-  ].includes(field);
-}
+export function isValidSortField(field: string): boolean {}
 
 export function isValidSortDirection(direction: string): boolean {
killedBy: Validation - Comprehensive Coverage isValidSortField should return true for valid sort fields
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:89:5
 export function isValidSortField(field: string): boolean {
   return [
     'name',
-    'date',
+    "",
     'deadline',
     'priority',
killedBy: Validation - Comprehensive Coverage isValidSortField should return true for valid sort fields
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:91:5
     'name',
     'date',
     'deadline',
-    'priority',
+    "",
     'created_at',
     'updated_at',
killedBy: Validation - Comprehensive Coverage isValidSortField should return true for valid sort fields
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:92:5
     'date',
     'deadline',
     'priority',
-    'created_at',
+    "",
     'updated_at',
   ].includes(field);
killedBy: Validation - Comprehensive Coverage isValidSortField should return true for valid sort fields
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/validation.ts:97:66
   ].includes(field);
 }
 
-export function isValidSortDirection(direction: string): boolean {
-  return ['asc', 'desc'].includes(direction);
-}
+export function isValidSortDirection(direction: string): boolean {}
 
 /**
killedBy: Validation - Comprehensive Coverage isValidSortDirection should return true for valid sort directions
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/lib/validation.ts:107:38
 export function parsePaginationParams(
   limit?: string | null,
   offset?: string | null
-): { limit: number; offset: number } {
-  const parsedLimit = limit ? parseInt(limit, 10) : DEFAULT_LIMIT;
-  const parsedOffset = offset ? parseInt(offset, 10) : 0;
-
-  return {
-    limit: Math.min(
-      Math.max(1, isNaN(parsedLimit) ? DEFAULT_LIMIT : parsedLimit),
-      MAX_LIMIT
-    ),
-    offset: Math.max(0, isNaN(parsedOffset) ? 0 : parsedOffset),
-  };
-}
+): { limit: number; offset: number } {}
 
 export const taskSchema = z.object({
killedBy: Validation - Comprehensive Coverage parsePaginationParams should use defaults when no params provided
statusReason: Cannot read properties of undefined (reading 'limit')

[Killed] MethodExpression
src/lib/validation.ts:112:12
   const parsedOffset = offset ? parseInt(offset, 10) : 0;
 
   return {
-    limit: Math.min(
-      Math.max(1, isNaN(parsedLimit) ? DEFAULT_LIMIT : parsedLimit),
-      MAX_LIMIT
-    ),
+    limit: Math.max(Math.max(1, isNaN(parsedLimit) ? DEFAULT_LIMIT : parsedLimit), MAX_LIMIT),
     offset: Math.max(0, isNaN(parsedOffset) ? 0 : parsedOffset),
   };
killedBy: Validation - Comprehensive Coverage parsePaginationParams should use defaults when no params provided
statusReason: expected 100 to be 20 // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:113:7
 
   return {
     limit: Math.min(
-      Math.max(1, isNaN(parsedLimit) ? DEFAULT_LIMIT : parsedLimit),
+      Math.min(1, isNaN(parsedLimit) ? DEFAULT_LIMIT : parsedLimit),
       MAX_LIMIT
     ),
killedBy: Validation - Comprehensive Coverage parsePaginationParams should use defaults when no params provided
statusReason: expected 1 to be 20 // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:116:13
       Math.max(1, isNaN(parsedLimit) ? DEFAULT_LIMIT : parsedLimit),
       MAX_LIMIT
     ),
-    offset: Math.max(0, isNaN(parsedOffset) ? 0 : parsedOffset),
+    offset: Math.min(0, isNaN(parsedOffset) ? 0 : parsedOffset),
   };
 }
killedBy: Validation - Comprehensive Coverage parsePaginationParams should parse limit and offset
statusReason: expected +0 to be 10 // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:121:9
 }
 
 export const taskSchema = z.object({
-  name: z
-    .string()
-    .min(1, 'Task name is required')
+  name: z.string().max(1, 'Task name is required')
     .max(500, 'Task name must be 500 characters or less'),
   description: z.string().optional().nullable(),
killedBy: Validation Schemas - Edge Cases taskSchema - Various Priority Levels should accept critical priority
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:121:9
 }
 
 export const taskSchema = z.object({
-  name: z
-    .string()
-    .min(1, 'Task name is required')
-    .max(500, 'Task name must be 500 characters or less'),
+  name: z.string().min(1, 'Task name is required').min(500, 'Task name must be 500 characters or less'),
   description: z.string().optional().nullable(),
   notes: z.string().optional().nullable(),
killedBy: Validation Schemas - Edge Cases taskSchema - Various Priority Levels should accept critical priority
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:123:13
 export const taskSchema = z.object({
   name: z
     .string()
-    .min(1, 'Task name is required')
+    .min(1, "")
     .max(500, 'Task name must be 500 characters or less'),
   description: z.string().optional().nullable(),
killedBy: Validation - Comprehensive Coverage taskSchema should require name (min 1 char)
statusReason: expected 'Too small: expected string to have >=…' to be 'Task name is required' // Object.is equality

[Survived] StringLiteral
src/lib/validation.ts:124:15
   name: z
     .string()
     .min(1, 'Task name is required')
-    .max(500, 'Task name must be 500 characters or less'),
+    .max(500, ""),
   description: z.string().optional().nullable(),
   notes: z.string().optional().nullable(),

[Killed] StringLiteral
src/lib/validation.ts:133:12
   estimate: z.string().optional().nullable(),
   actual_time: z.string().optional().nullable(),
   priority: z
-    .enum(['critical', 'high', 'medium', 'low', 'none'])
+    .enum(["", 'high', 'medium', 'low', 'none'])
     .default('none'),
   recurring: z
killedBy: Validation - Comprehensive Coverage taskSchema should validate all priority values
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:133:49
   estimate: z.string().optional().nullable(),
   actual_time: z.string().optional().nullable(),
   priority: z
-    .enum(['critical', 'high', 'medium', 'low', 'none'])
+    .enum(['critical', 'high', 'medium', 'low', ""])
     .default('none'),
   recurring: z
killedBy: Validation - Comprehensive Coverage taskSchema should validate all priority values
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:137:7
     .default('none'),
   recurring: z
     .enum([
-      'none',
+      "",
       'daily',
       'weekly',
killedBy: Validation - Comprehensive Coverage taskSchema should validate all recurring values
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:154:9
 });
 
 export const listSchema = z.object({
-  name: z
-    .string()
-    .min(1, 'List name is required')
+  name: z.string().max(1, 'List name is required')
     .max(100, 'List name must be 100 characters or less'),
   emoji: z
killedBy: Validation - Comprehensive Coverage listSchema should validate list with defaults
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:154:9
 });
 
 export const listSchema = z.object({
-  name: z
-    .string()
-    .min(1, 'List name is required')
-    .max(100, 'List name must be 100 characters or less'),
+  name: z.string().min(1, 'List name is required').min(100, 'List name must be 100 characters or less'),
   emoji: z
     .string()
killedBy: Validation - Comprehensive Coverage listSchema should validate list with defaults
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:158:10
     .string()
     .min(1, 'List name is required')
     .max(100, 'List name must be 100 characters or less'),
-  emoji: z
-    .string()
-    .max(2, 'Emoji must be 2 characters or less')
+  emoji: z.string().min(2, 'Emoji must be 2 characters or less')
     .optional()
     .default('📋'),
killedBy: API Routes - Lists POST /api/lists should create a list with custom fields
statusReason: Emoji must be 2 characters or less

[Survived] StringLiteral
src/lib/validation.ts:160:13
     .max(100, 'List name must be 100 characters or less'),
   emoji: z
     .string()
-    .max(2, 'Emoji must be 2 characters or less')
+    .max(2, "")
     .optional()
     .default('📋'),

[Survived] Regex
src/lib/validation.ts:165:12
     .default('📋'),
   color: z
     .string()
-    .regex(/^#([A-Fa-f0-9]{6}|[A-Fa-f0-9]{3})$/, 'Invalid color format')
+    .regex(/^#([A-Fa-f0-9]{6}|[A-Fa-f0-9]{3})/, 'Invalid color format')
     .optional()
     .default('#6366f1'),

[Survived] Regex
src/lib/validation.ts:165:12
     .default('📋'),
   color: z
     .string()
-    .regex(/^#([A-Fa-f0-9]{6}|[A-Fa-f0-9]{3})$/, 'Invalid color format')
+    .regex(/#([A-Fa-f0-9]{6}|[A-Fa-f0-9]{3})$/, 'Invalid color format')
     .optional()
     .default('#6366f1'),

[Killed] StringLiteral
src/lib/validation.ts:167:14
     .string()
     .regex(/^#([A-Fa-f0-9]{6}|[A-Fa-f0-9]{3})$/, 'Invalid color format')
     .optional()
-    .default('#6366f1'),
+    .default(""),
 });
 
killedBy: Validation - Comprehensive Coverage listSchema should validate list with defaults
statusReason: expected '' to be '#6366f1' // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:171:9
 });
 
 export const labelSchema = z.object({
-  name: z
-    .string()
-    .min(1, 'Label name is required')
-    .max(50, 'Label name must be 50 characters or less'),
+  name: z.string().min(1, 'Label name is required').min(50, 'Label name must be 50 characters or less'),
   icon: z
     .string()
killedBy: Validation - Comprehensive Coverage labelSchema should validate label with defaults
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:171:9
 });
 
 export const labelSchema = z.object({
-  name: z
-    .string()
-    .min(1, 'Label name is required')
+  name: z.string().max(1, 'Label name is required')
     .max(50, 'Label name must be 50 characters or less'),
   icon: z
killedBy: Validation - Comprehensive Coverage labelSchema should validate label with defaults
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:175:9
     .string()
     .min(1, 'Label name is required')
     .max(50, 'Label name must be 50 characters or less'),
-  icon: z
-    .string()
-    .max(2, 'Icon must be 2 characters or less')
+  icon: z.string().min(2, 'Icon must be 2 characters or less')
     .optional()
     .default('🏷️'),
killedBy: API Routes - Labels POST /api/labels should create a label with custom fields
statusReason: Icon must be 2 characters or less

[Killed] StringLiteral
src/lib/validation.ts:179:14
     .string()
     .max(2, 'Icon must be 2 characters or less')
     .optional()
-    .default('🏷️'),
+    .default("",
   color: z
     .string()
killedBy: Validation - Comprehensive Coverage labelSchema should validate label with defaults
statusReason: expected '' to be '🏷️' // Object.is equality

[Killed] ObjectLiteral
src/lib/validation.ts:196:40
   completed: z.boolean().optional(),
 });
 
-export const templateSchema = z.object({
-  name: z.string().min(1, 'Template name is required'),
-  description: z.string().optional().nullable(),
-  list_id: z.number().optional(),
-  priority: z
-    .enum(['critical', 'high', 'medium', 'low', 'none'])
-    .default('none'),
-  label_ids: z.array(z.number()).optional(),
-  subtasks: z.array(z.string()).optional(),
-});
+export const templateSchema = z.object({});
 
 export const customViewSchema = z.object({
killedBy: Validation Schemas - Helper Schemas templateSchema should reject empty template name
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/lib/validation.ts:197:9
 });
 
 export const templateSchema = z.object({
-  name: z.string().min(1, 'Template name is required'),
+  name: z.string().max(1, 'Template name is required'),
   description: z.string().optional().nullable(),
   list_id: z.number().optional(),
killedBy: Validation Schemas - Helper Schemas templateSchema should validate template with required fields
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/validation.ts:197:27
 });
 
 export const templateSchema = z.object({
-  name: z.string().min(1, 'Template name is required'),
+  name: z.string().min(1, ""),
   description: z.string().optional().nullable(),
   list_id: z.number().optional(),

[Killed] ArrayDeclaration
src/lib/validation.ts:201:11
   description: z.string().optional().nullable(),
   list_id: z.number().optional(),
   priority: z
-    .enum(['critical', 'high', 'medium', 'low', 'none'])
+    .enum([])
     .default('none'),
   label_ids: z.array(z.number()).optional(),
killedBy: Validation - Comprehensive Coverage templateSchema should validate all priority values
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:201:42
   description: z.string().optional().nullable(),
   list_id: z.number().optional(),
   priority: z
-    .enum(['critical', 'high', 'medium', 'low', 'none'])
+    .enum(['critical', 'high', 'medium', "", 'none'])
     .default('none'),
   label_ids: z.array(z.number()).optional(),
killedBy: Validation - Comprehensive Coverage templateSchema should validate all priority values
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/validation.ts:202:14
   list_id: z.number().optional(),
   priority: z
     .enum(['critical', 'high', 'medium', 'low', 'none'])
-    .default('none'),
+    .default(""),
   label_ids: z.array(z.number()).optional(),
   subtasks: z.array(z.string()).optional(),

[Killed] MethodExpression
src/lib/validation.ts:208:9
 });
 
 export const customViewSchema = z.object({
-  name: z.string().min(1, 'View name is required'),
+  name: z.string().max(1, 'View name is required'),
   filter_preset: z
     .enum([
killedBy: Validation - Comprehensive Coverage customViewSchema should validate custom view with defaults
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:212:7
   filter_preset: z
     .enum([
       'needs_attention',
-      'this_week',
+      "",
       'with_labels',
       'with_subtasks',
killedBy: Validation - Comprehensive Coverage customViewSchema should validate all filter preset values
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/validation.ts:215:7
       'this_week',
       'with_labels',
       'with_subtasks',
-      'completed',
+      "",
     ])
     .optional()
killedBy: Validation - Comprehensive Coverage customViewSchema should validate all filter preset values
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/validation.ts:222:32
   list_id: z.number().optional().nullable(),
   label_ids: z.array(z.number()).optional(),
   priority: z
-    .enum(['critical', 'high', 'medium', 'low', 'none'])
+    .enum(['critical', 'high', "", 'low', 'none'])
     .optional()
     .nullable(),
